{
    "project": [
        {
            "name": "Aika Skill Simulator"
        }
    ],
    "forms": [
        {
            "copy-button": "Copy"
        }
    ],
    "classes": [
        {
            "warrior": "Warrior",
            "paladin": "Paladin",
            "warlock": "Warlock",
            "cleric": "Cleric",
            "rifleman": "Rifleman",
            "dual-gunner": "Dual-Gunner"
        }
    ],
    "settings": [
        {
            "classes": "Classes",
            "level": "Level",
            "extra-points": "Extra-points",
            "cd-reduction": "CD Reduction",
            "points-left": "Points Left"
        }
    ],
    "tiers_title": [
        {
            "tier1-skill": "Tier 1 Skills",
            "tier2-skill": "Tier 2 Skills",
            "tier3-skill": "Tier 3 Skills",
            "tier4-skill": "Tier 4 Skills",
            "tier5-skill": "Tier 5 Skills",
            "tier6-skill": "Tier 6 Skills"
        }
    ],
    "warrior-skills": [
        {
            "skill1": "Slash",
            "skill2": "Charge",
            "skill3": "Armor Breaker",
            "skill4": "Taunt",
            "skill5": "Berserk",
            "skill6": "Blade Storm",
            "skill7": "How of Glory",
            "skill8": "Smash",
            "skill9": "Focused Might",
            "skill10": "Dragon Spirit",
            "skill11": "How of Valor",
            "skill12": "Earthquake",
            "skill13": "Howl of Wrath",
            "skill14": "Lionheart",
            "skill15": "Gash",
            "skill16": "Howl of Fortitude",
            "skill17": "Dragon Strike",
            "skill18": "Shockwave",
            "skill19": "Howl of Dread",
            "skill20": "Battle inspiration",
            "skill21": "Dragon Rage",
            "skill22": "Deadly Charge",
            "skill23": "Battle Instinct",
            "skill24": "Master of Blades",
            "skill25": "Blood Strike",
            "skill26": "Howl of Freedom",
            "skill27": "Howl of Blood",
            "skill28": "Masochism",
            "skill29": "Power Stark",
            "skill30": "Brutal Edge",
            "skill31": "Last Stand"
        }
    ],
    "paladin-skills": [
        {
            "skill1": "Shield Smash",
            "skill2": "Recover",
            "skill3": "Divine Strike",
            "skill4": "Provoke",
            "skill5": "Vanguard",
            "skill6": "Transference",
            "skill7": "Challenge",
            "skill8": "Perseverance",
            "skill9": "Enrage",
            "skill10": "Benediction",
            "skill11": "Martyr",
            "skill12": "Divine Ward",
            "skill13": "Judgment",
            "skill14": "Reflect Blow",
            "skill15": "Deliverance",
            "skill16": "Defiance",
            "skill17": "Onslaught",
            "skill18": "Aegis",
            "skill19": "Repetence",
            "skill20": "Stronghold",
            "skill21": "Blades of Aika",
            "skill22": "Sanctuary",
            "skill23": "Judgement",
            "skill24": "Immortal Faith",
            "skill25": "Divine Cross",
            "skill26": "Aika's Affection",
            "skill27": "Divine Charge",
            "skill28": "Heavenly Shield",
            "skill29": "Iron Forge",
            "skill30": "Reckless Savior",
            "skill31": "Avenger's Shield"
        }
    ],
    "warlock-skills": [
        {
            "skill1": "FireBall",
            "skill2": "Enervate",
            "skill3": "Polymorph",
            "skill4": "Lighting Orb",
            "skill5": "Mana Shield",
            "skill6": "Hellfire",
            "skill7": "Aetheric Shackles",
            "skill8": "Black Harvest",
            "skill9": "Mana Torrent",
            "skill10": "Meditate",
            "skill11": "Shadow Fall",
            "skill12": "Soul Trap",
            "skill13": "Aether Flare",
            "skill14": "Inferno",
            "skill15": "Nightmare",
            "skill16": "Rend Soul",
            "skill17": "Mass Teleport",
            "skill18": "Meteor",
            "skill19": "Mirrored Agony",
            "skill20": "Ahriman's Blessing",
            "skill21": "Calamity",
            "skill22": "Incinerate",
            "skill23": "Focus Magic",
            "skill24": "Volt Rain",
            "skill25": "Shadow Mist",
            "skill26": "Black Hole",
            "skill27": "Ruinous Thunder",
            "skill28": "Mana Barbs",
            "skill29": "Blizzard",
            "skill30": "Black Twister",
            "skill31": "Abyssal Gate"
        }
    ],
    "cleric-skills": [
        {
            "skill1": "Holy Arrow",
            "skill2": "Cure",
            "skill3": "Angelic Armor",
            "skill4": "Bless",
            "skill5": "Rejuvenate",
            "skill6": "Ressurect",
            "skill7": "Haste",
            "skill8": "Holy signet",
            "skill9": "Exalt",
            "skill10": "Shroud of Turin",
            "skill11": "Healing Corona",
            "skill12": "Holy Tempest",
            "skill13": "Rapture",
            "skill14": "Holy Intervention",
            "skill15": "Desperate Prayer",
            "skill16": "Castigation",
            "skill17": "Archangel's Light",
            "skill18": "Revelation",
            "skill19": "Archangel's Blade",
            "skill20": "Iron Will",
            "skill21": "Aika's Grace",
            "skill22": "Holy Shield",
            "skill23": "Penance",
            "skill24": "Divine Sermon",
            "skill25": "Exorcism",
            "skill26": "Holy Water",
            "skill27": "Glory's Flowers",
            "skill28": "Enchanced Cure",
            "skill29": "Soul Gem",
            "skill30": "Mereiful Eden",
            "skill31": "Dixit Dominus"
        }
    ],
    "rifleman-skills": [
        {
            "skill1": "Countdown",
            "skill2": "Rupture",
            "skill3": "Hollow Point",
            "skill4": "Leg Shot",
            "skill5": "Stealth",
            "skill6": "Hawk Eye",
            "skill7": "Crimson Bullet",
            "skill8": "Eagle Eye",
            "skill9": "Concentration",
            "skill10": "Sharpshooter",
            "skill11": "Incendiary Round",
            "skill12": "Ambush",
            "skill13": "Terminate",
            "skill14": "Sonic Blast",
            "skill15": "Rifle Smash",
            "skill16": "Pinpoint Weakness",
            "skill17": "Deploy Turret",
            "skill18": "Headshot",
            "skill19": "Knockout Shot",
            "skill20": "Ultimatum",
            "skill21": "Predator",
            "skill22": "Spot Weakness",
            "skill23": "Roll With It",
            "skill24": "Go Postal",
            "skill25": "Bloodlust",
            "skill26": "Death Kneell",
            "skill27": "Ghost Stance",
            "skill28": "Napalm Strike",
            "skill29": "Multi Trap",
            "skill30": "Bullet May Cry",
            "skill31": "Destination"
        }
    ],
    "dual-gunner-skills": [
        {
            "skill1": "Corrosive Round",
            "skill2": "Poison Ivy",
            "skill3": "Quicksilver",
            "skill4": "Hot Shot",
            "skill5": "Stealth",
            "skill6": "Full Auto",
            "skill7": "Foxglove",
            "skill8": "Maelstrom",
            "skill9": "Tiger Eye",
            "skill10": "Sirocco",
            "skill11": "Black Rose",
            "skill12": "Hemlock",
            "skill13": "Crossfire",
            "skill14": "Concussive Shock",
            "skill15": "Flashbang",
            "skill16": "Belladonna",
            "skill17": "Reload",
            "skill18": "Heartbreaker",
            "skill19": "Nightshade",
            "skill20": "Elude",
            "skill21": "Bloody Rose",
            "skill22": "Exploit Weakness",
            "skill23": "Misdirection",
            "skill24": "Lead Rain",
            "skill25": "Death Mark",
            "skill26": "Assassinate",
            "skill27": "Chain Reaction",
            "skill28": "Cover Fire",
            "skill29": "Breakthrough",
            "skill30": "Gunblaze Festival",
            "skill31": "Wicked Timer"
        }
    ],
    "slash": [
        {
            "level1": "Strongly slays an enemy and inflicts 33 physical damage.",
            "level2": "Strongly slays an enemy and inflicts 39 physical damage.",
            "level3": "Strongly slays an enemy and inflicts 53 physical damage.",
            "level4": "Strongly slays an enemy and inflicts 69 physical damage.",
            "level5": "Strongly slays an enemy and inflicts 85 physical damage.",
            "level6": "Strongly slays an enemy and inflicts 105 physical damage.",
            "level7": "Strongly slays an enemy and inflicts 127 physical damage.",
            "level8": "Strongly slays an enemy and inflicts 155 physical damage.",
            "level9": "Strongly slays an enemy and inflicts 188 physical damage.",
            "level10": "Strongly slays an enemy and inflicts 228 physical damage.",
            "level11": "Strongly slays an enemy and inflicts 275 physical damage.",
            "level12": "Strongly slays an enemy and inflicts 325 physical damage.",
            "level13": "Strongly slays an enemy and inflicts 383 physical damage.",
            "level14": "Strongly slays an enemy and inflicts 444 physical damage.",
            "level15": "Strongly slays an enemy and inflicts 515 physical damage.",
            "level16": "Strongly slays an enemy and inflicts 592 physical damage."
        }
        
    ],
    "Charge": [
        {
            "levell1": "Charges 8 meters. Deals 13 physical change. Stuns for 3 seconds.",
            "levell2": "Charges 8 meters. Deals 17 physical change. Stuns for 3 seconds.",
            "levell3": "Charges 9 meters. Deals 22 physical change. Stuns for 3 seconds.",
            "levell4": "Charges 9 meters. Deals 27 physical change. Stuns for 3 seconds.",
            "levell5": "Charges 10 meters. Deals 34 physical change. Stuns for 3 seconds.",
            "levell6": "Charges 10 meters. Deals 41 physical change. Stuns for 3 seconds.",
            "levell7": "Charges 11 meters. Deals 50 physical change. Stuns for 3 seconds.",
            "levell8": "Charges 11 meters. Deals 60 physical change. Stuns for 3 seconds.",
            "levell9": "Charges 12 meters. Deals 73 physical change. Stuns for 3 seconds.",
            "levell10": "Charges 12 meters. Deals 88 physical change. Stuns for 3 seconds.",
            "levell11": "Charges 12 meters. Deals 88 physical change. Stuns for 3 seconds."
        }
    ],
    "Armor Break": [
        {
            "Inflicts": "Inflicts 62 physical damage and for 12 seconds, it decreases physical DEF by 100, Evasion by 4, and Movement Speed slightly.",
            "level2": "Inflicts 80 physical damage and for 12 seconds, it decreases physical DEF by 131, Evasion by 6, and Movement Speed slightly.",
            "level3": "Inflicts 101 physical damage and for 12 seconds, it decreases physical DEF by 164, Evasion by 8, and Movement Speed slightly.",
            "level4": "Inflicts 124 physical damage and for 12 seconds, it decreases physical DEF by 203, Evasion by 10, and Movement Speed slightly.",
            "level5": "Inflicts 152 physical damage and for 12 seconds, it decreases physical DEF by 258, Evasion by 12, and Movement Speed slightly.",
            "level6": "Inflicts 185 physical damage and for 12 seconds, it decreases physical DEF by 319, Evasion by 14, and Movement Speed slightly.",
            "level7": "Inflicts 225 physical damage and for 12 seconds, it decreases physical DEF by 385, Evasion by 16, and Movement Speed slightly.",
            "level8": "Inflicts 272 physical damage and for 12 seconds, it decreases physical DEF by 467, Evasion by 18, and Movement Speed slightly.",
            "level9": "Inflicts 330 physical damage and for 12 seconds, it decreases physical DEF by 566, Evasion by 20, and Movement Speed slightly.",
            "level10": "Inflicts 391 physical damage and for 12 seconds, it decreases physical DEF by 671, Evasion by 22, and Movement Speed slightly.",
            "level11": "Inflicts 461 physical damage and for 12 seconds, it decreases physical DEF by 792, Evasion by 24, and Movement Speed slightly.",
            "level12": "Inflicts 542 physical damage and for 12 seconds, it decreases physical DEF by 946, Evasion by 26, and Movement Speed slightly.",
            "level13": "Inflicts 628 physical damage and for 12 seconds, it decreases physical DEF by 1120, Evasion by 28, and Movement Speed slightly.",
            "level14": "Inflicts 725 physical damage and for 12 seconds, it decreases physical DEF by 1299, Evasion by 30, and Movement Speed slightly.",
            "level15": "Inflicts 824 physical damage and for 12 seconds, it decreases physical DEF by 1484, Evasion by 32, and Movement Speed slightly.",
            "level16'": "Inflicts 927 physical damage and for 12 seconds, it decreases physical DEF by 1672, Evasion by 34, and Movement Speed slightly."
        }
    ],
    "Taunt": [
        {
            "level1": "Increases threat level by 1 and focuses the target's attention on you for 3 seconds.",
            "level2": "Increases threat level by 2 and focuses the target's attention on you for 3 seconds.",
            "level3": "Increases threat level by 3 and focuses the target's attention on you for 3 seconds.",
            "level4": "Increases threat level by 4 and focuses the target's attention on you for 3 seconds.",
            "level5": "Increases threat level by 5 and focuses the target's attention on you for 4 seconds.",
            "level6": "Increases threat level by 6 and focuses the target's attention on you for 4 seconds.",
            "level7": "Increases threat level by 7 and focuses the target's attention on you for 4 seconds.",
            "level8": "Increases threat level by 8 and focuses the target's attention on you for 4 seconds.",
            "level9": "Increases threat level by 9 and focuses the target's attention on you for 5 seconds.",
            "level10": "Increases threat level by 10 and focuses the target's attention on you for 5 seconds.",
            "level11": "Increases threat level by 11 and focuses the target's attention on you for 5 seconds.",
            "level12": "Increases threat level by 12 and focuses the target's attention on you for 5 seconds.",
            "level13": "Increases threat level by 13 and focuses the target's attention on you for 6 seconds.",
            "level14": "Increases threat level by 14 and focuses the target's attention on you for 6 seconds.",
            "level15": "Increases threat level by 15 and focuses the target's attention on you for 6 seconds.",
            "level16": "Increases threat level by 16 and focuses the target's attention on you for 6 seconds."
        }
    ],
    "Berserk": [
        {
            "level1": "By becoming frenzied, absorbs 6% of damage on enemies as HP and increases Movement Speed by 12. However, Evasion is decreased by 5.",
            "level2": "By becoming frenzied, absorbs 8% of damage on enemies as HP and increases Movement Speed by 12. However, Evasion is decreased by 6.",
            "level3": "By becoming frenzied, absorbs 10% of damage on enemies as HP and increases Movement Speed by 12. However, Evasion is decreased by 7.",
            "level4": "By becoming frenzied, absorbs 12% of damage on enemies as HP and increases Movement Speed by 12. However, Evasion is decreased by 8.",
            "level5": "By becoming frenzied, absorbs 14% of damage on enemies as HP and increases Movement Speed by 12. However, Evasion is decreased by 9.",
            "level6": "By becoming frenzied, absorbs 16% of damage on enemies as HP and increases Movement Speed by 12. However, Evasion is decreased by 10.",
            "level7": "By becoming frenzied, absorbs 18% of damage on enemies as HP and increases Movement Speed by 12. However, Evasion is decreased by 11.",
            "level8": "By becoming frenzied, absorbs 20% of damage on enemies as HP and increases Movement Speed by 12. However, Evasion is decreased by 12.",
            "level9": "By becoming frenzied, absorbs 22% of damage on enemies as HP and increases Movement Speed by 12. However, Evasion is decreased by 13.",
            "level10": "By becoming frenzied, absorbs 24% of damage on enemies as HP and increases Movement Speed by 12. However, Evasion is decreased by 15."
        }
    ],
    "Blade Storm": [
        {
            "level1": "Deals 152 physical damage to all enemies within 4 meters.",
            "level2": "Deals 191 physical damage to all enemies within 4 meters.",
            "level3": "Deals 234 physical damage to all enemies within 4 meters.",
            "level4": "Deals 283 physical damage to all enemies within 4 meters.",
            "level5": "Deals 343 physical damage to all enemies within 4 meters.",
            "level6": "Deals 415 physical damage to all enemies within 4 meters.",
            "level7": "Deals 504 physical damage to all enemies within 4 meters.",
            "level8": "Deals 600 physical damage to all enemies within 4 meters.",
            "level9": "Deals 709 physical damage to all enemies within 4 meters.",
            "level10": "Deals 837 physical damage to all enemies within 4 meters.",
            "level11": "Deals 969 physical damage to all enemies within 4 meters.",
            "level12": "Deals 1121 physical damage to all enemies within 4 meters.",
            "level13": "Deals 1279 physical damage to all enemies within 4 meters.",
            "level14": "Deals 1437 physical damage to all enemies within 4 meters.",
            "level15": "Deals 1618 physical damage to all enemies within 4 meters.",
            "level16": "Deals 1819 physical damage to all enemies within 4 meters."
        }
    ],
    "How of Glory": [
        {
            "level1": "Increases party's Max HP by 215 and Max MP by 107; also increases HP recovery by 56 and MP recovery by 28 for 10 minutes.",
            "level2": "Increases party's Max HP by 262 and Max MP by 131; also increases HP recovery by 67 and MP recovery by 34 for 10 minutes.",
            "level3": "Increases party's Max HP by 313 and Max MP by 156; also increases HP recovery by 81 and MP recovery by 41 for 10 minutes.",
            "level4": "Increases party's Max HP by 376 and Max MP by 188; also increases HP recovery by 98 and MP recovery by 49 for 10 minutes.",
            "level5": "Increases party's Max HP by 452 and Max MP by 226; also increases HP recovery by 119 and MP recovery by 60 for 10 minutes.",
            "level6": "Increases party's Max HP by 542 and Max MP by 271; also increases HP recovery by 141 and MP recovery by 71 for 10 minutes.",
            "level7": "Increases party's Max HP by 640 and Max MP by 320; also increases HP recovery by 166 and MP recovery by 83 for 10 minutes.",
            "level8": "Increases party's Max HP by 748 and Max MP by 374; also increases HP recovery by 195 and MP recovery by 97 for 10 minutes.",
            "level9": "Increases party's Max HP by 873 and Max MP by 436; also increases HP recovery by 225 and MP recovery by 112 for 10 minutes.",
            "level10": "Increases party's Max HP by 1000 and Max MP by 500; also increases HP recovery by 257 and MP recovery by 128 for 10 minutes.",
            "level11": "Increases party's Max HP by 1148 and Max MP by 573; also increases HP recovery by 292 and MP recovery by 146 for 10 minutes.",
            "level12": "Increases party's Max HP by 1295 and Max MP by 646; also increases HP recovery by 331 and MP recovery by 166 for 10 minutes.",
            "level13": "Increases party's Max HP by 1441 and Max MP by 720; also increases HP recovery by 372 and MP recovery by 187 for 10 minutes.",
            "level14": "Increases party's Max HP by 1604 and Max MP by 802; also increases HP recovery by 414 and MP recovery by 208 for 10 minutes.",
            "level15": "Increases party's Max HP by 1784 and Max MP by 892; also increases HP recovery by 461 and MP recovery by 231 for 10 minutes.",
            "level16": "Increases party's Max HP by 1967 and Max MP by 983; also increases HP recovery by 513 and MP recovery by 257 for 10 minutes."
        }
    ],
    "Smash": [
        {
            "level1": "Deals 48 physical damage and knocks back the enemy a maximum of 1 time.",
            "level2": "Deals 59 physical damage and knocks back the enemy a maximum of 1 time.",
            "level3": "Deals 71 physical damage and knocks back the enemy a maximum of 2 time.",
            "level4": "Deals 86 physical damage and knocks back the enemy a maximum of 2 time.",
            "level5": "Deals 104 physical damage and knocks back the enemy a maximum of 3 time.",
            "level6": "Deals 126 physical damage and knocks back the enemy a maximum of 3 time.",
            "level7": "Deals 149 physical damage and knocks back the enemy a maximum of 4 time.",
            "level8": "Deals 176 physical damage and knocks back the enemy a maximum of 4 time.",
            "level9": "Deals 205 physical damage and knocks back the enemy a maximum of 5 time.",
            "level10": "Deals 237 physical damage and knocks back the enemy a maximum of 5 time."
        }
    ],
    "Focused Might": [
        {
            "level1": "Increases physical attack by 4 and hit rate by 2.",
            "level2": "Increases physical attack by 8 and hit rate by 4.",
            "level3": "Increases physical attack by 12 and hit rate by 6.",
            "level4": "Increases physical attack by 16 and hit rate by 8.",
            "level5": "Increases physical attack by 20 and hit rate by 10.",
            "level6": "Increases physical attack by 24 and hit rate by 12.",
            "level7": "Increases physical attack by 28 and hit rate by 14.",
            "level8": "Increases physical attack by 32 and hit rate by 16.",
            "level9": "Increases physical attack by 36 and hit rate by 18.",
            "level10": "Increases physical attack by 40 and hit rate by 20."
        }
    ],
    "Dragon Spirit": [
        {
            "level1": "Increases Max HP by 145 and recovers HP equivalent to 5% of HP recovery rate every 8 seconds during combat.",
            "level2": "Increases Max HP by 290 and recovers HP equivalent to 10% of HP recovery rate every 8 seconds during combat.",
            "level3": "Increases Max HP by 435 and recovers HP equivalent to 15% of HP recovery rate every 8 seconds during combat.",
            "level4": "Increases Max HP by 580 and recovers HP equivalent to 20% of HP recovery rate every 8 seconds during combat.",
            "level5": "Increases Max HP by 725 and recovers HP equivalent to 25% of HP recovery rate every 8 seconds during combat.",
            "level6": "Increases Max HP by 870 and recovers HP equivalent to 30% of HP recovery rate every 8 seconds during combat.",
            "level7": "Increases Max HP by 1015 and recovers HP equivalent to 35% of HP recovery rate every 8 seconds during combat.",
            "level8": "Increases Max HP by 1160 and recovers HP equivalent to 40% of HP recovery rate every 8 seconds during combat.",
            "level9": "Increases Max HP by 1305 and recovers HP equivalent to 45% of HP recovery rate every 8 seconds during combat.",
            "level10": "Increases Max HP by 1450 and recovers HP equivalent to 50% of HP recovery rate every 8 seconds during combat."
        }
    ],
    "How of Valor": [
        {
            "level1": "Increases your party's STR, DEX and INT by 3 for 10 minutes.",
            "level2": "Increases your party's STR, DEX and INT by 6 for 10 minutes.",
            "level3": "Increases your party's STR, DEX and INT by 9 for 10 minutes.",
            "level4": "Increases your party's STR, DEX and INT by 12 for 10 minutes.",
            "level5": "Increases your party's STR, DEX and INT by 15 for 10 minutes.",
            "level6": "Increases your party's STR, DEX and INT by 18 for 10 minutes.",
            "level7": "Increases your party's STR, DEX and INT by 21 for 10 minutes.",
            "level8": "Increases your party's STR, DEX and INT by 24 for 10 minutes.",
            "level9": "Increases your party's STR, DEX and INT by 27 for 10 minutes.",
            "level10": "Increases your party's STR, DEX and INT by 30 for 10 minutes.",
            "level11": "Increases your party's STR, DEX and INT by 33 for 10 minutes.",
            "level12": "Increases your party's STR, DEX and INT by 36 for 10 minutes.",
            "level13": "Increases your party's STR, DEX and INT by 39 for 10 minutes.",
            "level14": "Increases your party's STR, DEX and INT by 42 for 10 minutes.",
            "level15": "Increases your party's STR, DEX and INT by 45 for 10 minutes.",
            "level16": "Increases your party's STR, DEX and INT by 48 for 10 minutes."
        }
    ],
    "Earthquake": [
        {
            "level1": "Deals 214 physical damage to all enemies within 5 meters and lowers their move speed by 20 for 6 seconds.",
            "level2": "Deals 257 physical damage to all enemies within 5 meters and lowers their move speed by 22 for 6 seconds.",
            "level3": "Deals 313 physical damage to all enemies within 5 meters and lowers their move speed by 24 for 6 seconds.",
            "level4": "Deals 378 physical damage to all enemies within 5 meters and lowers their move speed by 26 for 6 seconds.",
            "level5": "Deals 446 physical damage to all enemies within 5 meters and lowers their move speed by 28 for 6 seconds.",
            "level6": "Deals 527 physical damage to all enemies within 5 meters and lowers their move speed by 30 for 6 seconds.",
            "level7": "Deals 614 physical damage to all enemies within 5 meters and lowers their move speed by 32 for 6 seconds.",
            "level8": "Deals 711 physical damage to all enemies within 5 meters and lowers their move speed by 34 for 6 seconds.",
            "level9": "Deals 814 physical damage to all enemies within 5 meters and lowers their move speed by 36 for 6 seconds.",
            "level10": "Deals 927 physical damage to all enemies within 5 meters and lowers their move speed by 38 for 6 seconds.",
            "level11": "Deals 1042 physical damage to all enemies within 5 meters and lowers their move speed by 40 for 6 seconds.",
            "level12": "Deals 1170 physical damage to all enemies within 5 meters and lowers their move speed by 42 for 6 seconds.",
            "level13": "Deals 1312 physical damage to all enemies within 5 meters and lowers their move speed by 44 for 6 seconds.",
            "level14": "Deals 1458 physical damage to all enemies within 5 meters and lowers their move speed by 46 for 6 seconds.",
            "level15": "Deals 1620 physical damage to all enemies within 5 meters and lowers their move speed by 48 for 6 seconds.",
            "level16": "Deals 1800 physical damage to all enemies within 5 meters and lowers their move speed by 50 for 6 seconds."
        }
    ],
    "Howl of Wrath": [
        {
            "level1": "Deals 240 physical damage to enemies within 6 meters and stuns them for 1 seconds.",
            "level2": "Deals 290 physical damage to enemies within 6 meters and stuns them for 1 seconds.",
            "level3": "Deals 350 physical damage to enemies within 6 meters and stuns them for 2 seconds.",
            "level4": "Deals 414 physical damage to enemies within 6 meters and stuns them for 2 seconds.",
            "level5": "Deals 488 physical damage to enemies within 6 meters and stuns them for 3 seconds.",
            "level6": "Deals 566 physical damage to enemies within 6 meters and stuns them for 3 seconds.",
            "level7": "Deals 656 physical damage to enemies within 6 meters and stuns them for 4 seconds.",
            "level8": "Deals 750 physical damage to enemies within 6 meters and stuns them for 4 seconds.",
            "level9": "Deals 848 physical damage to enemies within 6 meters and stuns them for 5 seconds.",
            "level10": "Deals 952 physical damage to enemies within 6 meters and stuns them for 5 seconds."
        }
    ],
    "Lionheart": [
        {
            "level1": "Once triggered when Berserk(LVL 1 and up) is activated, it cancels one debuff, recovers 2% of Max HP per sec for 10 seconds, and increases a chance of resisting Movement Speed decrease and Immobilization by 23%.",
            "level2": "Once triggered when Berserk(LVL 2 and up) is activated, it cancels one debuff, recovers 2% of Max HP per sec for 10 seconds, and increases a chance of resisting Movement Speed decrease and Immobilization by 26%.",
            "level3": "Once triggered when Berserk(LVL 3 and up) is activated, it cancels one debuff, recovers 2% of Max HP per sec for 10 seconds, and increases a chance of resisting Movement Speed decrease and Immobilization by 29%.",
            "level4": "Once triggered when Berserk(LVL 4 and up) is activated, it cancels one debuff, recovers 2% of Max HP per sec for 10 seconds, and increases a chance of resisting Movement Speed decrease and Immobilization by 32%.",
            "level5": "Once triggered when Berserk(LVL 5 and up) is activated, it cancels one debuff, recovers 3% of Max HP per sec for 10 seconds, and increases a chance of resisting Movement Speed decrease and Immobilization by 35%.",
            "level6": "Once triggered when Berserk(LVL 6 and up) is activated, it cancels one debuff, recovers 3% of Max HP per sec for 10 seconds, and increases a chance of resisting Movement Speed decrease and Immobilization by 38%.",
            "level7": "Once triggered when Berserk(LVL 7 and up) is activated, it cancels one debuff, recovers 3% of Max HP per sec for 10 seconds, and increases a chance of resisting Movement Speed decrease and Immobilization by 41%.",
            "level8": "Once triggered when Berserk(LVL 8 and up) is activated, it cancels one debuff, recovers 3% of Max HP per sec for 10 seconds, and increases a chance of resisting Movement Speed decrease and Immobilization by 44%.",
            "level9": "Once triggered when Berserk(LVL 9 and up) is activated, it cancels one debuff, recovers 4% of Max HP per sec for 10 seconds, and increases a chance of resisting Movement Speed decrease and Immobilization by 47%.",
            "level10":"Once triggered when Berserk(LVL 10) is activated, it cancels one debuff, recovers 4% of Max HP per sec for 10 seconds, and increases a chance of resisting Movement Speed decrease and Immobilization by 50%."
        }
    ],
    "Gash": [
        {
            "level1": "By making an enemy bleed, inflicts 114 physical damage per sec for 6 seconds and decreases regeneration by 60%.",
            "level2": "By making an enemy bleed, inflicts 138 physical damage per sec for 6 seconds and decreases regeneration by 62%.",
            "level3": "By making an enemy bleed, inflicts 166 physical damage per sec for 6 seconds and decreases regeneration by 64%.",
            "level4": "By making an enemy bleed, inflicts 202 physical damage per sec for 6 seconds and decreases regeneration by 66%.",
            "level5": "By making an enemy bleed, inflicts 244 physical damage per sec for 6 seconds and decreases regeneration by 68%.",
            "level6": "By making an enemy bleed, inflicts 292 physical damage per sec for 6 seconds and decreases regeneration by 70%.",
            "level7": "By making an enemy bleed, inflicts 344 physical damage per sec for 6 seconds and decreases regeneration by 72%.",
            "level8": "By making an enemy bleed, inflicts 406 physical damage per sec for 6 seconds and decreases regeneration by 74%.",
            "level9": "By making an enemy bleed, inflicts 470 physical damage per sec for 6 seconds and decreases regeneration by 76%.",
            "level10": "By making an enemy bleed, cancels one buff; inflicts 544 physical damage per sec for 6 seconds and decreases regeneration by 78%.",
            "level11": "By making an enemy bleed, cancels one buff; inflicts 620 physical damage per sec for 6 seconds and decreases regeneration by 80%.",
            "level12": "By making an enemy bleed, cancels one buff; inflicts 698 physical damage per sec for 6 seconds and decreases regeneration by 82%.",
            "level13": "By making an enemy bleed, cancels one buff; inflicts 786 physical damage per sec for 6 seconds and decreases regeneration by 84%.",
            "level14": "By making an enemy bleed, cancels one buff; inflicts 884 physical damage per sec for 6 seconds and decreases regeneration by 86%.",
            "level15": "By making an enemy bleed, cancels one buff; inflicts 984 physical damage per sec for 6 seconds and decreases regeneration by 88%.",
            "level16": "By making an enemy bleed, cancels two buffs; inflicts 1092 physical damage per sec for 6 seconds and decreases regeneration by 90%."
        }
    ],
    "Howl of Fortitude": [
        {
            "level1": "Increases your party's physical defense by 131 and magic defense by 99. Also increases abnormal status resistance by 2 for 10 minutes.",
            "level2": "Increases your party's physical defense by 155 and magic defense by 117. Also increases abnormal status resistance by 2 for 10 minutes.",
            "level3": "Increases your party's physical defense by 183 and magic defense by 138. Also increases abnormal status resistance by 3 for 10 minutes.",
            "level4": "Increases your party's physical defense by 219 and magic defense by 165. Also increases abnormal status resistance by 3 for 10 minutes.",
            "level5": "Increases your party's physical defense by 259 and magic defense by 196. Also increases abnormal status resistance by 4 for 10 minutes.",
            "level6": "Increases your party's physical defense by 300 and magic defense by 228. Also increases abnormal status resistance by 4 for 10 minutes.",
            "level7": "Increases your party's physical defense by 343 and magic defense by 260. Also increases abnormal status resistance by 5 for 10 minutes.",
            "level8": "Increases your party's physical defense by 386 and magic defense by 295. Also increases abnormal status resistance by 5 for 10 minutes.",
            "level9": "Increases your party's physical defense by 433 and magic defense by 331. Also increases abnormal status resistance by 6 for 10 minutes.",
            "level10": "Increases your party's physical defense by 487 and magic defense by 373. Also increases abnormal status resistance by 6 for 10 minutes.",
            "level11": "Increases your party's physical defense by 550 and magic defense by 422. Also increases abnormal status resistance by 7 for 10 minutes.",
            "level12": "Increases your party's physical defense by 620 and magic defense by 476. Also increases abnormal status resistance by 7 for 10 minutes.",
            "level13": "Increases your party's physical defense by 701 and magic defense by 541. Also increases abnormal status resistance by 8 for 10 minutes.",
            "level14": "Increases your party's physical defense by 791 and magic defense by 611. Also increases abnormal status resistance by 8 for 10 minutes.",
            "level15": "Increases your party's physical defense by 892 and magic defense by 689. Also increases abnormal status resistance by 9 for 10 minutes.",
            "level16": "Increases your party's physical defense by 1007 and magic defense by 782. Also increases abnormal status resistance by 10 for 10 minutes."
        }
    ],
    "Dragon Strike": [
        {
            "level1": "Deals 513 physical damage and silences the target for 6 seconds.",
            "level2": "Deals 607 physical damage and silences the target for 6 seconds.",
            "level3": "Deals 715 physical damage and silences the target for 6 seconds.",
            "level4": "Deals 829 physical damage and silences the target for 7 seconds.",
            "level5": "Deals 961 physical damage and silences the target for 7 seconds.",
            "level6": "Deals 1098 physical damage and silences the target for 7 seconds.",
            "level7": "Deals 1242 physical damage and silences the target for 8 seconds.",
            "level8": "Deals 1395 physical damage and silences the target for 8 seconds.",
            "level9": "Deals 1570 physical damage and silences the target for 8 seconds.",
            "level10": "Deals 1755 physical damage and silences the target for 9 seconds.",
            "level11": "Deals 1948 physical damage and silences the target for 9 seconds.",
            "level12": "Deals 2165 physical damage and silences the target for 9 seconds.",
            "level13": "Deals 2406 physical damage and silences the target for 10 seconds.",
            "level14": "Deals 2649 physical damage and silences the target for 10 seconds.",
            "level15": "Deals 2915 physical damage and silences the target for 10 seconds.",
            "level16": "Deals 3208 physical damage and silences the target for 10 seconds."
        }
    ],
    "Shockwave": [
        {
            "level1": "Jumps to the selected area and deals 700 physical damage to all enemies within 5 meters.",
            "level2": "Jumps to the selected area and deals 828 physical damage to all enemies within 5 meters.",
            "level3": "Jumps to the selected area and deals 976 physical damage to all enemies within 5 meters.",
            "level4": "Jumps to the selected area and deals 1132 physical damage to all enemies within 5 meters.",
            "level5": "Jumps to the selected area and deals 1312 physical damage to all enemies within 5 meters.",
            "level6": "Jumps to the selected area and deals 1500 physical damage to all enemies within 5 meters.",
            "level7": "Jumps to the selected area and deals 1696 physical damage to all enemies within 5 meters.",
            "level8": "Jumps to the selected area and deals 1904 physical damage to all enemies within 5 meters.",
            "level9": "Jumps to the selected area and deals 2144 physical damage to all enemies within 5 meters.",
            "level10": "Jumps to the selected area and deals 2396 physical damage to all enemies within 5 meters.",
            "level11": "Jumps to the selected area and deals 2660 physical damage to all enemies within 5 meters.",
            "level12": "Jumps to the selected area and deals 2956 physical damage to all enemies within 5 meters.",
            "level13": "Jumps to the selected area and deals 3284 physical damage to all enemies within 5 meters.",
            "level14": "Jumps to the selected area and deals 3616 physical damage to all enemies within 5 meters.",
            "level15": "Jumps to the selected area and deals 3980 physical damage to all enemies within 5 meters.",
            "level16": "Jumps to the selected area and deals 4380 physical damage to all enemies within 5 meters."
        }
    ],
    "Howl of Dread": [
        {
            "level1": "A fearsome war cry instills Fear within surrounding enemies on a 6m radius for 5 seconds. If the enemy is attacked, there is a 95% chance to dispel the Fear status and reduce their move speed for 6 seconds.",
            "level2": "A fearsome war cry instills Fear within surrounding enemies on a 6m radius for 5 seconds. If the enemy is attacked, there is a 90% chance to dispel the Fear status and reduce their move speed for 6 seconds.",
            "level3": "A fearsome war cry instills Fear within surrounding enemies on a 6m radius for 5 seconds. If the enemy is attacked, there is a 85% chance to dispel the Fear status and reduce their move speed for 6 seconds.",
            "level4": "A fearsome war cry instills Fear within surrounding enemies on a 6m radius for 5 seconds. If the enemy is attacked, there is a 80% chance to dispel the Fear status and reduce their move speed for 6 seconds.",
            "level5": "A fearsome war cry instills Fear within surrounding enemies on a 6m radius for 5 seconds. If the enemy is attacked, there is a 75% chance to dispel the Fear status and reduce their move speed for 6 seconds.",
            "level6": "A fearsome war cry instills Fear within surrounding enemies on a 6m radius for 5 seconds. If the enemy is attacked, there is a 70% chance to dispel the Fear status and reduce their move speed for 6 seconds.",
            "level7": "A fearsome war cry instills Fear within surrounding enemies on a 6m radius for 5 seconds. If the enemy is attacked, there is a 65% chance to dispel the Fear status and reduce their move speed for 6 seconds.",
            "level8": "A fearsome war cry instills Fear within surrounding enemies on a 6m radius for 5 seconds. If the enemy is attacked, there is a 60% chance to dispel the Fear status and reduce their move speed for 6 seconds.",
            "level9": "A fearsome war cry instills Fear within surrounding enemies on a 6m radius for 5 seconds. If the enemy is attacked, there is a 55% chance to dispel the Fear status and reduce their move speed for 6 seconds.",
            "level10": "A fearsome war cry instills Fear within surrounding enemies on a 6m radius for 5 seconds. If the enemy is attacked, there is a 50% chance to dispel the Fear status and reduce their move speed for 6 seconds."
        }
    ],
    "Battle inspiration": [
        {
            "level1": "Your relentless energy decreases the cool-down time of all skills by 2%",
            "level2": "Your relentless energy decreases the cool-down time of all skills by 4%",
            "level3": "Your relentless energy decreases the cool-down time of all skills by 6%",
            "level4": "Your relentless energy decreases the cool-down time of all skills by 8%",
            "level5": "Your relentless energy decreases the cool-down time of all skills by 10%",
            "level6": "Your relentless energy decreases the cool-down time of all skills by 12%",
            "level7": "Your relentless energy decreases the cool-down time of all skills by 14%",
            "level8": "Your relentless energy decreases the cool-down time of all skills by 16%",
            "level9": "Your relentless energy decreases the cool-down time of all skills by 18%",
            "level10": "Your relentless energy decreases the cool-down time of all skills by 20%"
        }
    ],
    "Dragon Rage": [
        {
            "level1": "Channels righteous anger to deal 2342 physical damage to your target and enemies within 6 meters.",
            "level2": "Channels righteous anger to deal 2637 physical damage to your target and enemies within 6 meters.",
            "level3": "Channels righteous anger to deal 2963 physical damage to your target and enemies within 6 meters.",
            "level4": "Channels righteous anger to deal 3328 physical damage to your target and enemies within 6 meters.",
            "level5": "Channels righteous anger to deal 3731 physical damage to your target and enemies within 6 meters.",
            "level6": "Channels righteous anger to deal 4147 physical damage to your target and enemies within 6 meters.",
            "level7": "Channels righteous anger to deal 4608 physical damage to your target and enemies within 6 meters.",
            "level8": "Channels righteous anger to deal 5120 physical damage to your target and enemies within 6 meters.",
            "level9": "Channels righteous anger to deal 5683 physical damage to your target and enemies within 6 meters.",
            "level10": "Channels righteous anger to deal 6310 physical damage to your target and enemies within 6 meters.",
            "level11": "Channels righteous anger to deal 7008 physical damage to your target and enemies within 6 meters."
        }
    ],
    "Deadly Charge": [
        {
            "level1": "Viciously charges target within 12 meters dealing 931 physical damage. Decreases move speed by 20 and critical resistance by 5 for 6 seconds.",
            "level2": "Viciously charges target within 12 meters dealing 1046 physical damage. Decreases move speed by 22 and critical resistance by 7 for 6 seconds.",
            "level3": "Viciously charges target within 12 meters dealing 1178 physical damage. Decreases move speed by 24 and critical resistance by 9 for 6 seconds.",
            "level4": "Viciously charges target within 12 meters dealing 1325 physical damage. Decreases move speed by 26 and critical resistance by 11 for 6 seconds.",
            "level5": "Viciously charges target within 12 meters dealing 1476 physical damage. Decreases move speed by 28 and critical resistance by 13 for 6 seconds.",
            "level6": "Viciously charges target within 12 meters dealing 1639 physical damage. Decreases move speed by 30 and critical resistance by 15 for 6 seconds.",
            "level7": "Viciously charges target within 12 meters dealing 1819 physical damage. Decreases move speed by 32 and critical resistance by 17 for 6 seconds.",
            "level8": "Viciously charges target within 12 meters dealing 2021 physical damage. Decreases move speed by 34 and critical resistance by 19 for 6 seconds.",
            "level9": "Viciously charges target within 12 meters dealing 2244 physical damage. Decreases move speed by 36 and critical resistance by 21 for 6 seconds.",
            "level10": "Viciously charges target within 12 meters dealing 2494 physical damage. Decreases move speed by 38 and critical resistance by 25 for 6 seconds."
        }
    ],
    "Battle Instinct": [
        {
            "level1": "Combat awarness decreases damage taken from area attacks by 30% and increases critical attack rate by 1.",
            "level2": "Combat awarness decreases damage taken from area attacks by 32% and increases critical attack rate by 2.",
            "level3": "Combat awarness decreases damage taken from area attacks by 34% and increases critical attack rate by 3.",
            "level4": "Combat awarness decreases damage taken from area attacks by 36% and increases critical attack rate by 4.",
            "level5": "Combat awarness decreases damage taken from area attacks by 38% and increases critical attack rate by 5.",
            "level6": "Combat awarness decreases damage taken from area attacks by 40% and increases critical attack rate by 6.",
            "level7": "Combat awarness decreases damage taken from area attacks by 42% and increases critical attack rate by 7.",
            "level8": "Combat awarness decreases damage taken from area attacks by 48% and increases critical attack rate by 8.",
            "level9": "Combat awarness decreases damage taken from area attacks by 50% and increases critical attack rate by 9.",
            "level10": "Combat awarness decreases damage taken from area attacks by 50% and increases critical attack rate by 10."
        }
    ],
    "Master of Blades": [
        {
            "level1": "By concentrating on wielding a sword, ignores enemy's Physical DEF by 50% and increases critical damage by 30%. However, the Auto Mana Regen stops and mana is deacreased by 10 per sec. Once all Mana is exhausted, the effects are cancelled.",
            "level2": "By concentrating on wielding a sword, ignores enemy's Physical DEF by 52% and increases critical damage by 33%. However, the Auto Mana Regen stops and mana is deacreased by 11 per sec. Once all Mana is exhausted, the effects are cancelled.",
            "level3": "By concentrating on wielding a sword, ignores enemy's Physical DEF by 54% and increases critical damage by 36%. However, the Auto Mana Regen stops and mana is deacreased by 12 per sec. Once all Mana is exhausted, the effects are cancelled.",
            "level4": "By concentrating on wielding a sword, ignores enemy's Physical DEF by 56% and increases critical damage by 39%. However, the Auto Mana Regen stops and mana is deacreased by 13 per sec. Once all Mana is exhausted, the effects are cancelled.",
            "level5": "By concentrating on wielding a sword, ignores enemy's Physical DEF by 58% and increases critical damage by 42%. However, the Auto Mana Regen stops and mana is deacreased by 14 per sec. Once all Mana is exhausted, the effects are cancelled.",
            "level6": "By concentrating on wielding a sword, ignores enemy's Physical DEF by 60% and increases critical damage by 45%. However, the Auto Mana Regen stops and mana is deacreased by 15 per sec. Once all Mana is exhausted, the effects are cancelled.",
            "level7": "By concentrating on wielding a sword, ignores enemy's Physical DEF by 62% and increases critical damage by 48%. However, the Auto Mana Regen stops and mana is deacreased by 16 per sec. Once all Mana is exhausted, the effects are cancelled.",
            "level8": "By concentrating on wielding a sword, ignores enemy's Physical DEF by 64% and increases critical damage by 51%. However, the Auto Mana Regen stops and mana is deacreased by 17 per sec. Once all Mana is exhausted, the effects are cancelled.",
            "level9": "By concentrating on wielding a sword, ignores enemy's Physical DEF by 70% and increases critical damage by 55%. However, the Auto Mana Regen stops and mana is deacreased by 18 per sec. Once all Mana is exhausted, the effects are cancelled."
        }
    ],
    "Blood Strike": [
        {
            "level1": "Inflicts 780 physical damage and adds extra damage equivalent to 9% of user's current HP.",
            "level2": "Inflicts 875 physical damage and adds extra damage equivalent to 10% of user's current HP.",
            "level3": "Inflicts 972 physical damage and adds extra damage equivalent to 11% of user's current HP.",
            "level4": "Inflicts 1080 physical damage and adds extra damage equivalent to 12% of user's current HP.",
            "level5": "Inflicts 1200 physical damage and adds extra damage equivalent to 13% of user's current HP.",
            "level6": "Inflicts 1332 physical damage and adds extra damage equivalent to 14% of user's current HP.",
            "level7": "Inflicts 1479 physical damage and adds extra damage equivalent to 15% of user's current HP.",
            "level8": "Inflicts 1643 physical damage and adds extra damage equivalent to 16% of user's current HP."
        }
    ],
    "Howl of Freedom": [
        {
            "level1": "By crying for freedom, this lifts all cancelable debuffs on the user and party members while increasing abnormal states RES by 40 and Movement Speed by 15 for 10 seconds. The user becomes immune to abnormal states for 10 seconds.",
            "level2": "By crying for freedom, this lifts all cancelable debuffs on the user and party members while increasing abnormal states RES by 42 and Movement Speed by 17 for 10 seconds. The user becomes immune to abnormal states for 12 seconds.",
            "level3": "By crying for freedom, this lifts all cancelable debuffs on the user and party members while increasing abnormal states RES by 44 and Movement Speed by 19 for 10 seconds. The user becomes immune to abnormal states for 14 seconds.",
            "level4": "By crying for freedom, this lifts all cancelable debuffs on the user and party members while increasing abnormal states RES by 46 and Movement Speed by 21 for 10 seconds. The user becomes immune to abnormal states for 16 seconds.",
            "level5": "By crying for freedom, this lifts all cancelable debuffs on the user and party members while increasing abnormal states RES by 48 and Movement Speed by 23 for 10 seconds. The user becomes immune to abnormal states for 18 seconds.",
            "level6": "By crying for freedom, this lifts all cancelable debuffs on the user and party members while increasing abnormal states RES by 50 and Movement Speed by 25 for 10 seconds. The user becomes immune to abnormal states for 20 seconds.",
            "level7": "By crying for freedom, this lifts all cancelable debuffs on the user and party members while increasing abnormal states RES by 52 and Movement Speed by 27 for 10 seconds. The user becomes immune to abnormal states for 22 seconds."
        }
    ],
    "Howl of Blood": [
        {
            "level1": "Recovers HP and MP equivalent to 50% and 25% of damage done to enemies by party members for 40 secs.",
            "level2": "Recovers HP and MP equivalent to 60% and 30% of damage done to enemies by party members for 40 secs.",
            "level3": "Recovers HP and MP equivalent to 70% and 35% of damage done to enemies by party members for 40 secs.",
            "level4": "Recovers HP and MP equivalent to 80% and 40% of damage done to enemies by party members for 40 secs.",
            "level5": "Recovers HP and MP equivalent to 90% and 45% of damage done to enemies by party members for 40 secs.",
            "level6": "Recovers HP and MP equivalent to 100% and 50% of damage done to enemies by party members for 40 secs."
        }
    ],
    "Masochism": [
        {
            "level1": "Increases Physical ATK by 140, skill ATK by 683, and Critical rate by 20. This skill consumes 170% of HP instead of MP.",
            "level2": "Increases Physical ATK by 152, skill ATK by 739, and Critical rate by 21. This skill consumes 170% of HP instead of MP.",
            "level3": "Increases Physical ATK by 164, skill ATK by 814, and Critical rate by 22. This skill consumes 170% of HP instead of MP.",
            "level4": "Increases Physical ATK by 176, skill ATK by 898 and Critical rate by 23. This skill consumes 170% of HP instead of MP.",
            "level5": "Increases Physical ATK by 188, skill ATK by 991 and Critical rate by 24. This skill consumes 170% of HP instead of MP.",
            "level6": "Increases Physical ATK by 200, skill ATK by 1095 and Critical rate by 25. This skill consumes 170% of HP instead of MP."
        }
    ],
    "Power Stark": [
        {
            "level1": "Deals 1516 physical damage to target and enemies and knocks them back.",
            "level2": "Deals 1684 physical damage to target and enemies and knocks them back.",
            "level3": "Deals 1870 physical damage to target and enemies and knocks them back.",
            "level4": "Deals 2078 physical damage to target and enemies and knocks them back.",
            "level5": "Deals 2190 physical damage to target and enemies and knocks them back."
        }
    ],
    "Brutal Edge": [
        {
            "level1": "Brandish your sword to deal 2054 physical damage on enemies within range and cause bleeding for 5 sec. Bleeding enemies regenration rates decrease by 85%.",
            "level2": "Brandish your sword to deal 2281 physical damage on enemies within range and cause bleeding for 5 sec. Bleeding enemies regenration rates decrease by 90%.",
            "level3": "Brandish your sword to deal 2535 physical damage on enemies within range and cause bleeding for 5 sec. Bleeding enemies regenration rates decrease by 95%.",
            "level4": "Brandish your sword to deal 2672 physical damage on enemies within range and cause bleeding for 5 sec. Bleeding enemies regenration rates decrease by 99%."
        }
    ],
    "Last Stand": [
        {
            "level1": "With outburst of bloody rage, inflicts 947 physical damage on enemies within 6m and adds extra damage depending on the user's lost HP. Once Last Stand is activated, damage and regen are highly decreased for 6 seconds.",
            "level2": "With outburst of bloody rage, inflicts 1051 physical damage on enemies within 6m and adds extra damage depending on the user's lost HP. Once Last Stand is activated, damage and regen are highly decreased for 6 seconds."
        }
    ],
    "Shield Smash": [
        {
            "level1": "Deals 26 physical damage. Stuns for 3 seconds.",
            "level2": "Deals 32 physical damage. Stuns for 3 seconds.",
            "level3": "Deals 44 physical damage. Stuns for 3 seconds.",
            "level4": "Deals 56 physical damage. Stuns for 3 seconds.",
            "level5": "Deals 69 physical damage. Stuns for 3 seconds.",
            "level6": "Deals 86 physical damage. Stuns for 3 seconds.",
            "level7": "Deals 104 physical damage. Stuns for 3 seconds.",
            "level8": "Deals 126 physical damage. Stuns for 3 seconds.",
            "level9": "Deals 153 physical damage. Stuns for 4 seconds.",
            "level10": "Deals 185 physical damage. Stuns for 4 seconds.",
            "level11": "Deals 224 physical damage. Stuns for 4 seconds.",
            "level12": "Deals 263 physical damage. Stuns for 4 seconds.",
            "level13": "Deals 311 physical damage. Stuns for 4 seconds.",
            "level14": "Deals 360 physical damage. Stuns for 4 seconds.",
            "level15": "Deals 417 physical damage. Stuns for 4 seconds.",
            "level16": "Deals 480 physical damage. Stuns for 4 seconds."
        }
    ],
    "Recover": [
        {
            "level1": "Regenerates 233 HP of the user or an ally and heals extra HP equivalent to 6% of lost HP.",
            "level2": "Regenerates 310 HP of the user or an ally and heals extra HP equivalent to 6% of lost HP.",
            "level3": "Regenerates 388 HP of the user or an ally and heals extra HP equivalent to 6% of lost HP.",
            "level4": "Regenerates 475 HP of the user or an ally and heals extra HP equivalent to 6% of lost HP.",
            "level5": "Regenerates 587 HP of the user or an ally and heals extra HP equivalent to 7% of lost HP.",
            "level6": "Regenerates 700 HP of the user or an ally and heals extra HP equivalent to 7% of lost HP.",
            "level7": "Regenerates 843 HP of the user or an ally and heals extra HP equivalent to 7% of lost HP.",
            "level8": "Regenerates 1010 HP of the user or an ally and heals extra HP equivalent to 7% of lost HP.",
            "level9": "Regenerates 1210 HP of the user or an ally and heals extra HP equivalent to 8% of lost HP.",
            "level10": "Regenerates 1448 HP of the user or an ally and heals extra HP equivalent to 8% of lost HP.",
            "level11": "Regenerates 1690 HP of the user or an ally and heals extra HP equivalent to 8% of lost HP.",
            "level12": "Regenerates 1973 HP of the user or an ally and heals extra HP equivalent to 8% of lost HP.",
            "level13": "Regenerates 2268 HP of the user or an ally and heals extra HP equivalent to 9% of lost HP.",
            "level14": "Regenerates 2598 HP of the user or an ally and heals extra HP equivalent to 9% of lost HP.",
            "level15": "Regenerates 2933 HP of the user or an ally and heals extra HP equivalent to 9% of lost HP.",
            "level16": "Regenerates 3290 HP of the user or an ally and heals extra HP equivalent to 10% of lost HP."
        }
    ],
    "Divine Strike": [
        {
            "level1": "Inflicts 80 physical damage and decreases Movement Speed by 15 for 5 seconds. Inflicts 150% damage on Demon and Undead.",
            "level2": "Inflicts 102 physical damage and decreases Movement Speed by 16 for 5 seconds. Inflicts 150% damage on Demon and Undead.",
            "level3": "Inflicts 131 physical damage and decreases Movement Speed by 17 for 5 seconds. Inflicts 150% damage on Demon and Undead.",
            "level4": "Inflicts 162 physical damage and decreases Movement Speed by 18 for 5 seconds. Inflicts 150% damage on Demon and Undead.",
            "level5": "Inflicts 201 physical damage and decreases Movement Speed by 19 for 5 seconds. Inflicts 150% damage on Demon and Undead.",
            "level6": "Inflicts 242 physical damage and decreases Movement Speed by 20 for 5 seconds. Inflicts 150% damage on Demon and Undead.",
            "level7": "Inflicts 293 physical damage and decreases Movement Speed by 21 for 5 seconds. Inflicts 150% damage on Demon and Undead.",
            "level8": "Inflicts 357 physical damage and decreases Movement Speed by 22 for 5 seconds. Inflicts 150% damage on Demon and Undead.",
            "level9": "Inflicts 430 physical damage and decreases Movement Speed by 23 for 5 seconds. Inflicts 150% damage on Demon and Undead.",
            "level10": "Inflicts 513 physical damage and decreases Movement Speed by 24 for 5 seconds. Inflicts 150% damage on Demon and Undead.",
            "level11": "Inflicts 605 physical damage and decreases Movement Speed by 25 for 5 seconds. Inflicts 150% damage on Demon and Undead.",
            "level12": "Inflicts 714 physical damage and decreases Movement Speed by 26 for 5 seconds. Inflicts 150% damage on Demon and Undead.",
            "level13": "Inflicts 825 physical damage and decreases Movement Speed by 27 for 5 seconds. Inflicts 150% damage on Demon and Undead.",
            "level14": "Inflicts 952 physical damage and decreases Movement Speed by 28 for 5 seconds. Inflicts 150% damage on Demon and Undead.",
            "level15": "Inflicts 1082 physical damage and decreases Movement Speed by 29 for 5 seconds. Inflicts 150% damage on Demon and Undead.",
            "level16": "Inflicts 1217 physical damage and decreases Movement Speed by 30 for 5 seconds. Inflicts 150% damage on Demon and Undead."
        }
    ],
    "Provoke": [
        {
            "level1": "Increases threat level by 1. Affects enemies within 4 meters.",
            "level2": "Increases threat level by 2. Affects enemies within 4 meters.",
            "level3": "Increases threat level by 3. Affects enemies within 4 meters.",
            "level4": "Increases threat level by 4. Affects enemies within 4 meters.",
            "level5": "Increases threat level by 5. Affects enemies within 4 meters.",
            "level6": "Increases threat level by 6. Affects enemies within 4 meters.",
            "level7": "Increases threat level by 7. Affects enemies within 4 meters.",
            "level8": "Increases threat level by 8. Affects enemies within 4 meters.",
            "level9": "Increases threat level by 9. Affects enemies within 4 meters.",
            "level10": "Increases threat level by 10. Affects enemies within 4 meters.",
            "level11": "Increases threat level by 11. Affects enemies within 4 meters.",
            "level12": "Increases threat level by 11. Affects enemies within 4 meters.",
            "level13": "Increases threat level by 13. Affects enemies within 4 meters.",
            "level14": "Increases threat level by 14. Affects enemies within 4 meters.",
            "level15": "Increases threat level by 15. Affects enemies within 4 meters.",
            "level16": "Increases threat level by 16. Affects enemies within 4 meters."
        }
    ],
    "Vanguard": [
        {
            "level1": "For 10 minutes, damage from Demon and Undead are decreased by 20%, however, this decreases Evasion by 5 at the same time.",
            "level2": "For 10 minutes, damage from Demon and Undead are decreased by 21%, however, this decreases Evasion by 5 at the same time.",
            "level3": "For 10 minutes, damage from Demon and Undead are decreased by 22%, however, this decreases Evasion by 5 at the same time.",
            "level4": "For 10 minutes, damage from Demon and Undead are decreased by 23%, however, this decreases Evasion by 6 at the same time.",
            "level5": "For 10 minutes, damage from Demon and Undead are decreased by 24%, however, this decreases Evasion by 6 at the same time.",
            "level6": "For 10 minutes, damage from Demon and Undead are decreased by 25%, however, this decreases Evasion by 6 at the same time.",
            "level7": "For 10 minutes, damage from Demon and Undead are decreased by 26%, however, this decreases Evasion by 7 at the same time.",
            "level8": "For 10 minutes, damage from Demon and Undead are decreased by 27%, however, this decreases Evasion by 7 at the same time.",
            "level9": "For 10 minutes, damage from Demon and Undead are decreased by 28%, however, this decreases Evasion by 7 at the same time.",
            "level10": "For 10 minutes, damage from Demon and Undead are decreased by 29%, however, this decreases Evasion by 8 at the same time.",
            "level11": "For 10 minutes, damage from Demon and Undead are decreased by 30%, however, this decreases Evasion by 8 at the same time.",
            "level12": "For 10 minutes, damage from Demon and Undead are decreased by 31%, however, this decreases Evasion by 8 at the same time.",
            "level13": "For 10 minutes, damage from Demon and Undead are decreased by 32%, however, this decreases Evasion by 9 at the same time.",
            "level14": "For 10 minutes, damage from Demon and Undead are decreased by 33%, however, this decreases Evasion by 9 at the same time.",
            "level15": "For 10 minutes, damage from Demon and Undead are decreased by 34%, however, this decreases Evasion by 9 at the same time.",
            "level16": "For 10 minutes, damage from Demon and Undead are decreased by 35%, however, this decreases Evasion by 10 at the same time."
        }
    ],
    "Transference": [
        {
            "level1": "Adds 50% Life leech for 20 seconds.",
            "level2": "Adds 55% Life leech for 22 seconds.",
            "level3": "Adds 60% Life leech for 24 seconds.",
            "level4": "Adds 65% Life leech for 26 seconds.",
            "level5": "Adds 70% Life leech for 28 seconds.",
            "level6": "Adds 75% Life leech for 30 seconds.",
            "level7": "Adds 80% Life leech for 32 seconds.",
            "level8": "Adds 85% Life leech for 34 seconds.",
            "level9": "Adds 90% Life leech for 36 seconds.",
            "level10": "Adds 100% Life leech for 40 seconds."
        }
    ],
    "Challenge": [
        {
            "level1": "Deals 74 physical damage. Enemy focuses on player for 3 seconds.",
            "level2": "Deals 90 physical damage. Enemy focuses on player for 3 seconds.",
            "level3": "Deals 108 physical damage. Enemy focuses on player for 3 seconds.",
            "level4": "Deals 132 physical damage. Enemy focuses on player for 3 seconds.",
            "level5": "Deals 161 physical damage. Enemy focuses on player for 4 seconds.",
            "level6": "Deals 195 physical damage. Enemy focuses on player for 4 seconds.",
            "level7": "Deals 231 physical damage. Enemy focuses on player for 4 seconds.",
            "level8": "Deals 273 physical damage. Enemy focuses on player for 4 seconds.",
            "level9": "Deals 323 physical damage. Enemy focuses on player for 5 seconds.",
            "level10": "Deals 374 physical damage. Enemy focuses on player for 5 seconds.",
            "level11": "Deals 434 physical damage. Enemy focuses on player for 5 seconds.",
            "level12": "Deals 494 physical damage. Enemy focuses on player for 5 seconds.",
            "level13": "Deals 557 physical damage. Enemy focuses on player for 6 seconds.",
            "level14": "Deals 626 physical damage. Enemy focuses on player for 6 seconds.",
            "level15": "Deals 704 physical damage. Enemy focuses on player for 6 seconds.",
            "level16": "Deals 783 physical damage. Enemy focuses on player for 6 seconds."
        }
    ],
    "Perseverance": [
        {
            "level1": "Focuses for 12 seconds. Blocks 30% of damage for 3 attack.",
            "level2": "Focuses for 12 seconds. Blocks 33% of damage for 3 attack.",
            "level3": "Focuses for 12 seconds. Blocks 36% of damage for 3 attack.",
            "level4": "Focuses for 12 seconds. Blocks 39% of damage for 3 attack.",
            "level5": "Focuses for 12 seconds. Blocks 42% of damage for 3 attack.",
            "level6": "Focuses for 12 seconds. Blocks 45% of damage for 3 attack.",
            "level7": "Focuses for 12 seconds. Blocks 48% of damage for 3 attack.",
            "level8": "Focuses for 12 seconds. Blocks 51% of damage for 3 attack.",
            "level9": "Focuses for 12 seconds. Blocks 54% of damage for 3 attack.",
            "level10": "Focuses for 12 seconds. Blocks 57% of damage for 3 attack.",
            "level11": "Focuses for 12 seconds. Blocks 60% of damage for 3 attack.",
            "level12": "Focuses for 12 seconds. Blocks 63% of damage for 3 attack.",
            "level13": "Focuses for 12 seconds. Blocks 66% of damage for 3 attack.",
            "level14": "Focuses for 12 seconds. Blocks 69% of damage for 3 attack.",
            "level15": "Focuses for 12 seconds. Blocks 72% of damage for 3 attack.",
            "level16": "Focuses for 12 seconds. Blocks 75% of damage for 3 attack."
        }
    ],
    "Enrage": [
        {
            "level1": "Generates 8 threat points per action.",
            "level2": "Generates 16 threat points per action.",
            "level3": "Generates 24 threat points per action.",
            "level4": "Generates 32 threat points per action.",
            "level5": "Generates 40 threat points per action.",
            "level6": "Generates 48 threat points per action.",
            "level7": "Generates 56 threat points per action.",
            "level8": "Generates 64 threat points per action.",
            "level9": "Generates 72 threat points per action.",
            "level10": "Generates 80 threat points per action."
        }
    ],
    "Benediction": [
        {
            "level1": "Increases healing amount by 120 and healing received by 3% while decreasing MP consumption for healing skills by 10%",
            "level2": "Increases healing amount by 240 and healing received by 4% while decreasing MP consumption for healing skills by 12%",
            "level3": "Increases healing amount by 360 and healing received by 4% while decreasing MP consumption for healing skills by 14%",
            "level4": "Increases healing amount by 480 and healing received by 5% while decreasing MP consumption for healing skills by 16%",
            "level5": "Increases healing amount by 600 and healing received by 5% while decreasing MP consumption for healing skills by 18%",
            "level6": "Increases healing amount by 720 and healing received by 6% while decreasing MP consumption for healing skills by 20%",
            "level7": "Increases healing amount by 840 and healing received by 6% while decreasing MP consumption for healing skills by 22%",
            "level8": "Increases healing amount by 960 and healing received by 7% while decreasing MP consumption for healing skills by 24%",
            "level9": "Increases healing amount by 1080 and healing received by 7% while decreasing MP consumption for healing skills by 26%",
            "level10": "Increases healing amount by 1200 and healing received by 8% while decreasing MP consumption for healing skills by 30%"
        }
    ],
    "Martyr": [
        {
            "level1": "For 3 minutes, this lets the skill user share 30% damage of a targeted party member while increasing abnormal states RES by 16. Up to 2680 damage can be transferred and only one member can be targeted at a time.",
            "level2": "For 3 minutes, this lets the skill user share 32% damage of a targeted party member while increasing abnormal states RES by 19. Up to 3216 damage can be transferred and only one member can be targeted at a time.",
            "level3": "For 3 minutes, this lets the skill user share 34% damage of a targeted party member while increasing abnormal states RES by 22. Up to 3870 damage can be transferred and only one member can be targeted at a time.",
            "level4": "For 3 minutes, this lets the skill user share 36% damage of a targeted party member while increasing abnormal states RES by 25. Up to 4638 damage can be transferred and only one member can be targeted at a time.",
            "level5": "For 3 minutes, this lets the skill user share 38% damage of a targeted party member while increasing abnormal states RES by 28. Up to 5476 damage can be transferred and only one member can be targeted at a time.",
            "level6": "For 3 minutes, this lets the skill user share 40% damage of a targeted party member while increasing abnormal states RES by 31. Up to 6400 damage can be transferred and only one member can be targeted at a time.",
            "level7": "For 3 minutes, this lets the skill user share 42% damage of a targeted party member while increasing abnormal states RES by 34. Up to 7646 damage can be transferred and only one member can be targeted at a time.",
            "level8": "For 3 minutes, this lets the skill user share 44% damage of a targeted party member while increasing abnormal states RES by 37. Up to 8554 damage can be transferred and only one member can be targeted at a time.",
            "level9": "For 3 minutes, this lets the skill user share 46% damage of a targeted party member while increasing abnormal states RES by 40. Up to 9802 damage can be transferred and only one member can be targeted at a time.",
            "level10": "For 3 minutes, this lets the skill user share 48% damage of a targeted party member while increasing abnormal states RES by 43. Up to 11058 damage can be transferred and only one member can be targeted at a time.",
            "level11": "For 3 minutes, this lets the skill user share 50% damage of a targeted party member while increasing abnormal states RES by 47. Up to 12322 damage can be transferred and only one member can be targeted at a time.",
            "level12": "For 3 minutes, this lets the skill user share 52% damage of a targeted party member while increasing abnormal states RES by 50. Up to 13720 damage can be transferred and only one member can be targeted at a time.",
            "level13": "For 3 minutes, this lets the skill user share 54% damage of a targeted party member while increasing abnormal states RES by 53. Up to 15258 damage can be transferred and only one member can be targeted at a time.",
            "level14": "For 3 minutes, this lets the skill user share 56% damage of a targeted party member while increasing abnormal states RES by 56. Up to 16818 damage can be transferred and only one member can be targeted at a time.",
            "level15": "For 3 minutes, this lets the skill user share 58% damage of a targeted party member while increasing abnormal states RES by 59. Up to 18476 damage can be transferred and only one member can be targeted at a time.",
            "level16": "For 3 minutes, this lets the skill user share 60% damage of a targeted party member while increasing abnormal states RES by 62. Up to ~20000 damage can be transferred and only one member can be targeted at a time."
        }
    ],
    "Divine Ward": [
        {
            "level1": "While activated for 5 minutes, creates a shield that completely blocks offensive skills twice. The number of defence decreases to 1 after transferring nations when Divine Ward is activated.",
            "level2": "While activated for 5 minutes, creates a shield that completely blocks offensive skills 3 times. The number of defence decreases to 1 after transferring nations when Divine Ward is activated.",
            "level3": "While activated for 5 minutes, creates a shield that completely blocks offensive skills 4 times. The number of defence decreases to 1 after transferring nations when Divine Ward is activated.",
            "level4": "While activated for 5 minutes, creates a shield that completely blocks offensive skills 5 times. The number of defence decreases to 1 after transferring nations when Divine Ward is activated.",
            "level5": "While activated for 5 minutes, creates a shield that completely blocks offensive skills 6 times. The number of defence decreases to 1 after transferring nations when Divine Ward is activated.",
            "level6": "While activated for 5 minutes, creates a shield that completely blocks offensive skills 7 times. The number of defence decreases to 1 after transferring nations when Divine Ward is activated.",
            "level7": "While activated for 5 minutes, creates a shield that completely blocks offensive skills 8 times. The number of defence decreases to 1 after transferring nations when Divine Ward is activated.",
            "level8": "While activated for 5 minutes, creates a shield that completely blocks offensive skills 9 times. The number of defence decreases to 1 after transferring nations when Divine Ward is activated.",
            "level9": "While activated for 5 minutes, creates a shield that completely blocks offensive skills 10 times. The number of defence decreases to 1 after transferring nations when Divine Ward is activated.",
            "level10": "While activated for 5 minutes, creates a shield that completely blocks offensive skills 12 times. The number of defence decreases to 1 after transferring nations when Divine Ward is activated."
        }
    ],
    "Judgment": [
        {
            "level1": "Deals 306 physical damage and silences all enemies within 4 meters for 3 seconds. Deals 150% damage to demons and undead.",
            "level2": "Deals 369 physical damage and silences all enemies within 4 meters for 3 seconds. Deals 150% damage to demons and undead.",
            "level3": "Deals 447 physical damage and silences all enemies within 4 meters for 3 seconds. Deals 150% damage to demons and undead.",
            "level4": "Deals 525 physical damage and silences all enemies within 4 meters for 3 seconds. Deals 150% damage to demons and undead.",
            "level5": "Deals 621 physical damage and silences all enemies within 4 meters for 3 seconds. Deals 150% damage to demons and undead.",
            "level6": "Deals 720 physical damage and silences all enemies within 4 meters for 3 seconds. Deals 150% damage to demons and undead.",
            "level7": "Deals 834 physical damage and silences all enemies within 4 meters for 3 seconds. Deals 150% damage to demons and undead.",
            "level8": "Deals 954 physical damage and silences all enemies within 4 meters for 3 seconds. Deals 150% damage to demons and undead.",
            "level9": "Deals 1080 physical damage and silences all enemies within 4 meters for 3 seconds. Deals 150% damage to demons and undead.",
            "level10": "Deals 1212 physical damage and silences all enemies within 4 meters for 3 seconds. Deals 150% damage to demons and undead.",
            "level11": "Deals 1365 physical damage and silences all enemies within 4 meters for 3 seconds. Deals 150% damage to demons and undead.",
            "level12": "Deals 1524 physical damage and silences all enemies within 4 meters for 3 seconds. Deals 150% damage to demons and undead.",
            "level13": "Deals 1695 physical damage and silences all enemies within 4 meters for 3 seconds. Deals 150% damage to demons and undead.",
            "level14": "Deals 1881 physical damage and silences all enemies within 4 meters for 3 seconds. Deals 150% damage to demons and undead.",
            "level15": "Deals 2091 physical damage and silences all enemies within 4 meters for 3 seconds. Deals 150% damage to demons and undead.",
            "level16": "Deals 2322 physical damage and silences all enemies within 4 meters for 3 seconds. Deals 150% damage to demons and undead."
        }
    ],
    "Reflect Blow": [
        {
            "level1": "The skill user sends back 50% of damage from all attacks for 3 seconds.",
            "level2": "The skill user sends back 55% of damage from all attacks for 3 seconds.",
            "level3": "The skill user sends back 60% of damage from all attacks for 3 seconds.",
            "level4": "The skill user sends back 65% of damage from all attacks for 3 seconds.",
            "level5": "The skill user sends back 70% of damage from all attacks for 3 seconds.",
            "level6": "The skill user sends back 75% of damage from all attacks for 3 seconds.",
            "level7": "The skill user sends back 80% of damage from all attacks for 3 seconds.",
            "level8": "The skill user sends back 85% of damage from all attacks for 3 seconds.",
            "level9": "The skill user sends back 90% of damage from all attacks for 3 seconds.",
            "level10": "The skill user sends back 95% of damage from all attacks for 3 seconds."
        }
    ],
    "Deliverance": [
        {
            "level1": "Switches all Mana into healing amplified by 150% to recover a target's HP and lifts all cancelable debuffs.",
            "level2": "Switches all Mana into healing amplified by 160% to recover a target's HP and lifts all cancelable debuffs.",
            "level3": "Switches all Mana into healing amplified by 170% to recover a target's HP and lifts all cancelable debuffs.",
            "level4": "Switches all Mana into healing amplified by 180% to recover a target's HP and lifts all cancelable debuffs.",
            "level5": "Switches all Mana into healing amplified by 190% to recover a target's HP and lifts all cancelable debuffs.",
            "level6": "Switches all Mana into healing amplified by 200% to recover a target's HP and lifts all cancelable debuffs.",
            "level7": "Switches all Mana into healing amplified by 210% to recover a target's HP and lifts all cancelable debuffs.",
            "level8": "Switches all Mana into healing amplified by 220% to recover a target's HP and lifts all cancelable debuffs.",
            "level9": "Switches all Mana into healing amplified by 230% to recover a target's HP and lifts all cancelable debuffs.",
            "level10": "Switches all Mana into healing amplified by 250% to recover a target's HP and lifts all cancelable debuffs."
        }
    ],
    "Defiance": [
        {
            "level1": "Increases the skill user's abnormal states RES by 37 and Threat by 50% for 30 seconds.",
            "level2": "Increases the skill user's abnormal states RES by 41 and Threat by 55% for 30 seconds.",
            "level3": "Increases the skill user's abnormal states RES by 45 and Threat by 60% for 30 seconds.",
            "level4": "Increases the skill user's abnormal states RES by 50 and Threat by 65% for 30 seconds.",
            "level5": "Increases the skill user's abnormal states RES by 56 and Threat by 70% for 30 seconds.",
            "level6": "Increases the skill user's abnormal states RES by 62 and Threat by 75% for 30 seconds.",
            "level7": "Increases the skill user's abnormal states RES by 68 and Threat by 80% for 30 seconds.",
            "level8": "Increases the skill user's abnormal states RES by 74 and Threat by 85% for 30 seconds.",
            "level9": "Increases the skill user's abnormal states RES by 81 and Threat by 90% for 30 seconds.",
            "level10": "The skill user becomes immune to abnormal states and Threat increases by 100% for 30 seconds."
        }
    ],
    "Onslaught": [
        {
            "level1": "Increases the skill user's Physical ATK by 68, Movement Speed by 10, and Double ATK by 3 for 40 seconds. Normal attacks deal splash damage equivalent to 60% of Physical ATK.",
            "level2": "Increases the skill user's Physical ATK by 78, Movement Speed by 10, and Double ATK by 3 for 40 seconds. Normal attacks deal splash damage equivalent to 62% of Physical ATK.",
            "level3": "Increases the skill user's Physical ATK by 90, Movement Speed by 10, and Double ATK by 3 for 40 seconds. Normal attacks deal splash damage equivalent to 64% of Physical ATK.",
            "level4": "Increases the skill user's Physical ATK by 104, Movement Speed by 10, and Double ATK by 4 for 40 seconds. Normal attacks deal splash damage equivalent to 66% of Physical ATK.",
            "level5": "Increases the skill user's Physical ATK by 118, Movement Speed by 10, and Double ATK by 4 for 40 seconds. Normal attacks deal splash damage equivalent to 68% of Physical ATK.",
            "level6": "Increases the skill user's Physical ATK by 134, Movement Speed by 10, and Double ATK by 4 for 40 seconds. Normal attacks deal splash damage equivalent to 70% of Physical ATK.",
            "level7": "Increases the skill user's Physical ATK by 150, Movement Speed by 10, and Double ATK by 5 for 40 seconds. Normal attacks deal splash damage equivalent to 72% of Physical ATK.",
            "level8": "Increases the skill user's Physical ATK by 166, Movement Speed by 10, and Double ATK by 5 for 40 seconds. Normal attacks deal splash damage equivalent to 74% of Physical ATK.",
            "level9": "Increases the skill user's Physical ATK by 186, Movement Speed by 10, and Double ATK by 5 for 40 seconds. Normal attacks deal splash damage equivalent to 76% of Physical ATK.",
            "level10": "Increases the skill user's Physical ATK by 208, Movement Speed by 10, and Double ATK by 6 for 40 seconds. Normal attacks deal splash damage equivalent to 78% of Physical ATK.",
            "level11": "Increases the skill user's Physical ATK by 232, Movement Speed by 10, and Double ATK by 6 for 40 seconds. Normal attacks deal splash damage equivalent to 80% of Physical ATK.",
            "level12": "Increases the skill user's Physical ATK by 258, Movement Speed by 10, and Double ATK by 6 for 40 seconds. Normal attacks deal splash damage equivalent to 82% of Physical ATK.",
            "level13": "Increases the skill user's Physical ATK by 292, Movement Speed by 10, and Double ATK by 7 for 40 seconds. Normal attacks deal splash damage equivalent to 84% of Physical ATK.",
            "level14": "Increases the skill user's Physical ATK by 334, Movement Speed by 10, and Double ATK by 7 for 40 seconds. Normal attacks deal splash damage equivalent to 86% of Physical ATK.",
            "level15": "Increases the skill user's Physical ATK by 380, Movement Speed by 10, and Double ATK by 7 for 40 seconds. Normal attacks deal splash damage equivalent to 88% of Physical ATK.",
            "level16": "Increases the skill user's Physical ATK by 456, Movement Speed by 10, and Double ATK by 8 for 40 seconds. Normal attacks deal splash damage equivalent to 90% of Physical ATK."
        }
    ],
    "Aegis": [
        {
            "level1": "Increases the skill user's Physical DEF by 893, Magic DEF by 703, and regenerates 73 HP every 2 seconds for 40 seconds.",
            "level2": "Increases the skill user's Physical DEF by 1054, Magic DEF by 830, and regenerates 86 HP every 2 seconds for 40 seconds.",
            "level3": "Increases the skill user's Physical DEF by 1243, Magic DEF by 977, and regenerates 100 HP every 2 seconds for 40 seconds.",
            "level4": "Increases the skill user's Physical DEF by 1483, Magic DEF by 1169, and regenerates 115 HP every 2 seconds for 40 seconds.",
            "level5": "Increases the skill user's Physical DEF by 1735, Magic DEF by 1370, and regenerates 132 HP every 2 seconds for 40 seconds.",
            "level6": "Increases the skill user's Physical DEF by 1997, Magic DEF by 1579, and regenerates 149 HP every 2 seconds for 40 seconds.",
            "level7": "Increases the skill user's Physical DEF by 2269, Magic DEF by 1801, and regenerates 167 HP every 2 seconds for 40 seconds.",
            "level8": "Increases the skill user's Physical DEF by 2550, Magic DEF by 2030, and regenerates 185 HP every 2 seconds for 40 seconds.",
            "level9": "Increases the skill user's Physical DEF by 2869, Magic DEF by 2284, and regenerates 206 HP every 2 seconds for 40 seconds.",
            "level10": "Increases the skill user's Physical DEF by 3243, Magic DEF by 2583, and regenerates 228 HP every 2 seconds for 40 seconds.",
            "level11": "Increases the skill user's Physical DEF by 3656, Magic DEF by 2916, and regenerates 251 HP every 2 seconds for 40 seconds.",
            "level12": "Increases the skill user's Physical DEF by 4117, Magic DEF by 3285, and regenerates 275 HP every 2 seconds for 40 seconds.",
            "level13": "Increases the skill user's Physical DEF by 4604, Magic DEF by 3678, and regenerates 301 HP every 2 seconds for 40 seconds.",
            "level14": "Increases the skill user's Physical DEF by 5101, Magic DEF by 4097, and regenerates 329 HP every 2 seconds for 40 seconds.",
            "level15": "Increases the skill user's Physical DEF by 5694, Magic DEF by 4577, and regenerates 358 HP every 2 seconds for 40 seconds.",
            "level16": "Increases the skill user's Physical DEF by 6451, Magic DEF by 5216, and regenerates 391 HP every 2 seconds for 40 seconds."
        }
    ],
    "Repetence": [
        {
            "level1": "Draws a target within 10 meters towards the player and forces it to repent for misdeeds and immoblizes it for 3 seconds.",
            "level2": "Draws a target within 10 meters towards the player and forces it to repent for misdeeds and immoblizes it for 4 seconds.",
            "level3": "Draws a target within 11 meters towards the player and forces it to repent for misdeeds and immoblizes it for 5 seconds.",
            "level4": "Draws a target within 11 meters towards the player and forces it to repent for misdeeds and immoblizes it for 6 seconds.",
            "level5": "Draws a target within 12 meters towards the player and forces it to repent for misdeeds and immoblizes it for 7 seconds.",
            "level6": "Draws a target within 12 meters towards the player and forces it to repent for misdeeds and immoblizes it for 8 seconds.",
            "level7": "Draws a target within 13 meters towards the player and forces it to repent for misdeeds and immoblizes it for 9 seconds.",
            "level8": "Draws a target within 13 meters towards the player and forces it to repent for misdeeds and immoblizes it for 10 seconds.",
            "level9": "Draws a target within 14 meters towards the player and forces it to repent for misdeeds and immoblizes it for 11 seconds.",
            "level10": "Draws a target within 15 meters towards the player and forces it to repent for misdeeds and immoblizes it for 12 seconds."
        }
    ],
    "Stronghold": [
        {
            "level1": "Fortifies your stance and grants a 5% chance to reduce all damage by 10%",
            "level2": "Fortifies your stance and grants a 6% chance to reduce all damage by 12%",
            "level3": "Fortifies your stance and grants a 7% chance to reduce all damage by 14%",
            "level4": "Fortifies your stance and grants a 8% chance to reduce all damage by 16%",
            "level5": "Fortifies your stance and grants a 9% chance to reduce all damage by 18%",
            "level6": "Fortifies your stance and grants a 10% chance to reduce all damage by 20%",
            "level7": "Fortifies your stance and grants a 11% chance to reduce all damage by 22%",
            "level8": "Fortifies your stance and grants a 12% chance to reduce all damage by 24%",
            "level9": "Fortifies your stance and grants a 13% chance to reduce all damage by 26%",
            "level10": "Fortifies your stance and grants a 15% chance to reduce all damage by 30%"
        }
    ],
    "Blades of Aika": [
        {
            "level1": "Summons an ancient relic to deal damage equivalent to 70% of weapon damage to enemies within 3 meters every second for 20 seconds. Deals 150% damage to demons and undead.",
            "level2": "Summons an ancient relic to deal damage equivalent to 73% of weapon damage to enemies within 3 meters every second for 21 seconds. Deals 150% damage to demons and undead.",
            "level3": "Summons an ancient relic to deal damage equivalent to 76% of weapon damage to enemies within 3 meters every second for 22 seconds. Deals 150% damage to demons and undead.",
            "level4": "Summons an ancient relic to deal damage equivalent to 79% of weapon damage to enemies within 3 meters every second for 23 seconds. Deals 150% damage to demons and undead.",
            "level5": "Summons an ancient relic to deal damage equivalent to 82% of weapon damage to enemies within 3 meters every second for 24 seconds. Deals 150% damage to demons and undead.",
            "level6": "Summons an ancient relic to deal damage equivalent to 85% of weapon damage to enemies within 3 meters every second for 25 seconds. Deals 150% damage to demons and undead.",
            "level7": "Summons an ancient relic to deal damage equivalent to 88% of weapon damage to enemies within 3 meters every second for 26 seconds. Deals 150% damage to demons and undead.",
            "level8": "Summons an ancient relic to deal damage equivalent to 91% of weapon damage to enemies within 3 meters every second for 27 seconds. Deals 150% damage to demons and undead.",
            "level9": "Summons an ancient relic to deal damage equivalent to 93% of weapon damage to enemies within 3 meters every second for 28 seconds. Deals 150% damage to demons and undead.",
            "level10": "Summons an ancient relic to deal damage equivalent to 97% of weapon damage to enemies within 3 meters every second for 29 seconds. Deals 150% damage to demons and undead.",
            "level11": "Summons an ancient relic to deal damage equivalent to 100% of weapon damage to enemies within 3 meters every second for 30 seconds. Deals 150% damage to demons and undead."
        }
    ],
    "Sanctuary": [
        {
            "level1": "Deals 1316 physical damage instantly by consercrating a 6 meter area. This will deactiavte 1 beneficial skill and make enemies sensitive to holy magic for 20 seconds. Deals 150% damage instantly to evil and undead.",
            "level2": "Deals 1484 physical damage instantly by consercrating a 6 meter area. This will deactiavte 1 beneficial skill and make enemies sensitive to holy magic for 22 seconds. Deals 150% damage instantly to evil and undead.",
            "level3": "Deals 1668 physical damage instantly by consercrating a 6 meter area. This will deactiavte 1 beneficial skill and make enemies sensitive to holy magic for 24 seconds. Deals 150% damage instantly to evil and undead.",
            "level4": "Deals 1876 physical damage instantly by consercrating a 6 meter area. This will deactiavte 1 beneficial skill and make enemies sensitive to holy magic for 26 seconds. Deals 150% damage instantly to evil and undead.",
            "level5": "Deals 2088 physical damage instantly by consercrating a 6 meter area. This will deactiavte 1 beneficial skill and make enemies sensitive to holy magic for 28 seconds. Deals 150% damage instantly to evil and undead.",
            "level6": "Deals 2320 physical damage instantly by consercrating a 6 meter area. This will deactiavte 1 beneficial skill and make enemies sensitive to holy magic for 30 seconds. Deals 150% damage instantly to evil and undead.",
            "level7": "Deals 2576 physical damage instantly by consercrating a 6 meter area. This will deactiavte 1 beneficial skill and make enemies sensitive to holy magic for 32 seconds. Deals 150% damage instantly to evil and undead.",
            "level8": "Deals 2864 physical damage instantly by consercrating a 6 meter area. This will deactiavte 1 beneficial skill and make enemies sensitive to holy magic for 34 seconds. Deals 150% damage instantly to evil and undead.",
            "level9": "Deals 3180 physical damage instantly by consercrating a 6 meter area. This will deactiavte 1 beneficial skill and make enemies sensitive to holy magic for 36 seconds. Deals 150% damage instantly to evil and undead.",
            "level10": "Deals 3532 physical damage instantly by consercrating a 6 meter area. This will deactiavte 1 beneficial skill and make enemies sensitive to holy magic for 38 seconds. Deals 150% damage instantly to evil and undead.",
            "level11": "Deals 3724 physical damage instantly by consercrating a 6 meter area. This will deactiavte 1 beneficial skill and make enemies sensitive to holy magic for 40 seconds. Deals 150% damage instantly to evil and undead."
        }
    ],
    "Judgement": [
        {
            "level1": "Divine righteousness increases physical attack by 12 and critical rate by 1.",
            "level2": "Divine righteousness increases physical attack by 16 and critical rate by 2.",
            "level3": "Divine righteousness increases physical attack by 20 and critical rate by 3.",
            "level4": "Divine righteousness increases physical attack by 24 and critical rate by 4.",
            "level5": "Divine righteousness increases physical attack by 28 and critical rate by 5.",
            "level6": "Divine righteousness increases physical attack by 32 and critical rate by 6.",
            "level7": "Divine righteousness increases physical attack by 36 and critical rate by 7.",
            "level8": "Divine righteousness increases physical attack by 40 and critical rate by 8.",
            "level9": "Divine righteousness increases physical attack by 44 and critical rate by 9.",
            "level10": "Divine righteousness increases physical attack by 48 and critical rate by 10."
        }
    ],
    "Immortal Faith": [
        {
            "level1": "A shield of faith increases HP by 2515 and increases HP recovery for 60 seconds.",
            "level2": "A shield of faith increases HP by 2797 and increases HP recovery for 60 seconds.",
            "level3": "A shield of faith increases HP by 3083 and increases HP recovery for 60 seconds.",
            "level4": "A shield of faith increases HP by 3387 and increases HP recovery for 60 seconds.",
            "level5": "A shield of faith increases HP by 3721 and increases HP recovery for 60 seconds.",
            "level6": "A shield of faith increases HP by 4087 and increases HP recovery for 60 seconds.",
            "level7": "A shield of faith increases HP by 4488 and increases HP recovery for 60 seconds.",
            "level8": "A shield of faith increases HP by 4929 and increases HP recovery for 60 seconds.",
            "level9": "A shield of faith increases HP by 5166 and increases HP recovery for 60 seconds."
        }
    ],
    "Divine Cross": [
        {
            "level1": "Emits strong energy in form of a great cross and deals 1326 Physical Attack to all enemies in the path.",
            "level2": "Emits strong energy in form of a great cross and deals 1485 Physical Attack to all enemies in the path.",
            "level3": "Emits strong energy in form of a great cross and deals 1650 Physical Attack to all enemies in the path.",
            "level4": "Emits strong energy in form of a great cross and deals 1833 Physical Attack to all enemies in the path.",
            "level5": "Emits strong energy in form of a great cross and deals 2037 Physical Attack to all enemies in the path.",
            "level6": "Emits strong energy in form of a great cross and deals 2262 Physical Attack to all enemies in the path.",
            "level7": "Emits strong energy in form of a great cross and deals 2511 Physical Attack to all enemies in the path.",
            "level8": "Emits strong energy in form of a great cross and deals 2793 Physical Attack to all enemies in the path."
        }
    ],
    "Aika's Affection": [
        {
            "level1": "Recovers 30 HP and 30 Constitution value for 10 mins. And increases healing effect by 6%",
            "level2": "Recovers 33 HP and 33 Constitution value for 10 mins. And increases healing effect by 7%",
            "level3": "Recovers 36 HP and 36 Constitution value for 10 mins. And increases healing effect by 8%",
            "level4": "Recovers 39 HP and 39 Constitution value for 10 mins. And increases healing effect by 9%",
            "level5": "Recovers 42 HP and 42 Constitution value for 10 mins. And increases healing effect by 10%",
            "level6": "Recovers 45 HP and 45 Constitution value for 10 mins. And increases healing effect by 11%",
            "level7": "Recovers 48 HP and 48 Constitution value for 10 mins. And increases healing effect by 12%"
        }
    ],
    "Divine Charge": [
        {
            "level1": "Charges to a target within 9 meters and deals 1100 Physical damage and decreases Physical/Madic Attack of the target by 25% for 6 secs.",
            "level2": "Charges to a target within 9 meters and deals 1222 Physical damage and decreases Physical/Madic Attack of the target by 28% for 6 secs.",
            "level3": "Charges to a target within 9 meters and deals 1358 Physical damage and decreases Physical/Madic Attack of the target by 31% for 6 secs.",
            "level4": "Charges to a target within 9 meters and deals 1508 Physical damage and decreases Physical/Madic Attack of the target by 34% for 6 secs.",
            "level5": "Charges to a target within 9 meters and deals 1674 Physical damage and decreases Physical/Madic Attack of the target by 37% for 6 secs.",
            "level6": "Charges to a target within 9 meters and deals 1862 Physical damage and decreases Physical/Madic Attack of the target by 40% for 6 secs."
        }
    ],
    "Heavenly Shield": [
        {
            "level1": "Increases PDEF by 1281, MDEF by 1028, and decreases damage received by 15% at a 10% chance. This skill stacks with [Stronghold] but not [Vanguard].",
            "level2": "Increases PDEF by 1423, MDEF by 1142, and decreases damage received by 18% at a 12% chance. This skill stacks with [Stronghold] but not [Vanguard].",
            "level3": "Increases PDEF by 1580, MDEF by 1268, and decreases damage received by 21% at a 14% chance. This skill stacks with [Stronghold] but not [Vanguard].",
            "level4": "Increases PDEF by 1784, MDEF by 1432, and decreases damage received by 24% at a 16% chance. This skill stacks with [Stronghold] but not [Vanguard].",
            "level5": "Increases PDEF by 2042, MDEF by 1650, and decreases damage received by 27% at a 18% chance. This skill stacks with [Stronghold] but not [Vanguard].",
            "level6": "Increases PDEF by 2152, MDEF by 1739, and decreases damage received by 30% at a 20% chance. This skill stacks with [Stronghold] but not [Vanguard]."
        }
    ],
    "Iron Forge": [
        {
            "level1": "Increase Physical and Magical defence of the party by 50% and increases Critical and Double Resistance by 5 for 12 seconds.",
            "level2": "Increase Physical and Magical defence of the party by 55% and increases Critical and Double Resistance by 8 for 14 seconds.",
            "level3": "Increase Physical and Magical defence of the party by 60% and increases Critical and Double Resistance by 10 for 16 seconds.",
            "level4": "Increase Physical and Magical defence of the party by 65% and increases Critical and Double Resistance by 12 for 18 seconds.",
            "level5": "Increase Physical and Magical defence of the party by 70% and increases Critical and Double Resistance by 15 for 20 seconds."
        }
    ],
    "Reckless Savior": [
        {
            "level1": "Arrive with a dynamic entry and apply a shield that absorbs 20460 physical damage to the user and nearby party members. Adds a Quick Ward buff if Divine Ward is not activated.",
            "level2": "Arrive with a dynamic entry and apply a shield that absorbs 22720 physical damage to the user and nearby party members. Adds a Quick Ward buff if Divine Ward is not activated.",
            "level3": "Arrive with a dynamic entry and apply a shield that absorbs 25240 physical damage to the user and nearby party members. Adds a Quick Ward buff if Divine Ward is not activated.",
            "level4": "Arrive with a dynamic entry and apply a shield that absorbs 26600 physical damage to the user and nearby party members. Adds a Quick Ward buff if Divine Ward is not activated."
        }
    ],
    "Avenger's Shield": [
        {
            "level1": "Using the divine power of revenge, inflicts 2930 physical damage on enemies within 5m and makes them sensitive to holy spells for 1 minute. The skill user reflects all damage and sends it back for 5 seconds.",
            "level2": "Using the divine power of revenge, inflicts 3259 physical damage on enemies within 5m and makes them sensitive to holy spells for 1 minute. The skill user reflects all damage and sends it back for 5 seconds."
        }
    ],
    "FireBall": [
        {
            "level1": "Deals 75 fire magic damage and gives fire debuff for 3 seconds. Base critical rate of 25.",
            "level2": "Deals 94 fire magic damage and gives fire debuff for 3 seconds. Base critical rate of 27.",
            "level3": "Deals 127 fire magic damage and gives fire debuff for 3 seconds. Base critical rate of 29.",
            "level4": "Deals 161 fire magic damage and gives fire debuff for 3 seconds. Base critical rate of 31.",
            "level5": "Deals 199 fire magic damage and gives fire debuff for 3 seconds. Base critical rate of 33.",
            "level6": "Deals 246 fire magic damage and gives fire debuff for 3 seconds. Base critical rate of 35.",
            "level7": "Deals 299 fire magic damage and gives fire debuff for 3 seconds. Base critical rate of 37.",
            "level8": "Deals 362 fire magic damage and gives fire debuff for 3 seconds. Base critical rate of 39.",
            "level9": "Deals 439 fire magic damage and gives fire debuff for 3 seconds. Base critical rate of 41.",
            "level10": "Deals 531 fire magic damage and gives fire debuff for 3 seconds. Base critical rate of 43.",
            "level11": "Deals 640 fire magic damage and gives fire debuff for 3 seconds. Base critical rate of 45.",
            "level12": "Deals 756 fire magic damage and gives fire debuff for 3 seconds. Base critical rate of 47.",
            "level13": "Deals 892 fire magic damage and gives fire debuff for 3 seconds. Base critical rate of 49.",
            "level14": "Deals 1037 fire magic damage and gives fire debuff for 3 seconds. Base critical rate of 51.",
            "level15": "Deals 1199 fire magic damage and gives fire debuff for 3 seconds. Base critical rate of 53.",
            "level16": "Deals 1380 fire magic damage and gives fire debuff for 3 seconds. Base critical rate of 55."
        }
    ],
    "Enervate": [
        {
            "level1": "Deals 44 magic damage per second for 6 seconds and gives dark debuff.",
            "level2": "Deals 59 magic damage per second for 6 seconds and gives dark debuff.",
            "level3": "Deals 75 magic damage per second for 6 seconds and gives dark debuff.",
            "level4": "Deals 93 magic damage per second for 6 seconds and gives dark debuff.",
            "level5": "Deals 115 magic damage per second for 6 seconds and gives dark debuff.",
            "level6": "Deals 140 magic damage per second for 6 seconds and gives dark debuff.",
            "level7": "Deals 169 magic damage per second for 6 seconds and gives dark debuff.",
            "level8": "Deals 205 magic damage per second for 6 seconds and gives dark debuff.",
            "level9": "Deals 248 magic damage per second for 6 seconds and gives dark debuff.",
            "level10": "Deals 299 magic damage per second for 6 seconds and gives dark debuff.",
            "level11": "Deals 353 magic damage per second for 6 seconds and gives dark debuff.",
            "level12": "Deals 417 magic damage per second for 6 seconds and gives dark debuff.",
            "level13": "Deals 485 magic damage per second for 6 seconds and gives dark debuff.",
            "level14": "Deals 561 magic damage per second for 6 seconds and gives dark debuff.",
            "level15": "Deals 641 magic damage per second for 6 seconds and gives dark debuff.",
            "level16": "Deals 725 magic damage per second for 6 seconds and gives dark debuff."
        }
    ],
    "Polymorph": [
        {
            "level1": "Turns the target into a cute defenseless bunny and decreases move speed by 20 for 20 seconds. Can only polymorph one target and cannot be auto cast.",
            "level2": "Turns the target into a cute defenseless bunny and decreases move speed by 22 for 22 seconds. Can only polymorph one target and cannot be auto cast.",
            "level3": "Turns the target into a cute defenseless bunny and decreases move speed by 24 for 24 seconds. Can only polymorph one target and cannot be auto cast.",
            "level4": "Turns the target into a cute defenseless bunny and decreases move speed by 26 for 26 seconds. Can only polymorph one target and cannot be auto cast.",
            "level5": "Turns the target into a cute defenseless bunny and decreases move speed by 28 for 28 seconds. Can only polymorph one target and cannot be auto cast.",
            "level6": "Turns the target into a cute defenseless bunny and decreases move speed by 30 for 30 seconds. Can only polymorph one target and cannot be auto cast.",
            "level7": "Turns the target into a cute defenseless bunny and decreases move speed by 32 for 32 seconds. Can only polymorph one target and cannot be auto cast.",
            "level8": "Turns the target into a cute defenseless bunny and decreases move speed by 34 for 34 seconds. Can only polymorph one target and cannot be auto cast.",
            "level9": "Turns the target into a cute defenseless bunny and decreases move speed by 36 for 36 seconds. Can only polymorph one target and cannot be auto cast.",
            "level10": "Turns the target into a cute defenseless bunny and decreases move speed by 40 for 38 seconds. Can only polymorph one target and cannot be auto cast."
        }
    ],
    "Lighting Orb": [
        {
            "level1": "Deals 94 magic damage and decreases move speed by 15 for 3 seconds. Gives lighting debuff.",
            "level2": "Deals 118 magic damage and decreases move speed by 16 for 3 seconds. Gives lighting debuff.",
            "level3": "Deals 147 magic damage and decreases move speed by 17 for 3 seconds. Gives lighting debuff.",
            "level4": "Deals 181 magic damage and decreases move speed by 18 for 3 seconds. Gives lighting debuff.",
            "level5": "Deals 220 magic damage and decreases move speed by 19 for 3 seconds. Gives lighting debuff.",
            "level6": "Deals 267 magic damage and decreases move speed by 20 for 3 seconds. Gives lighting debuff.",
            "level7": "Deals 324 magic damage and decreases move speed by 21 for 3 seconds. Gives lighting debuff.",
            "level8": "Deals 391 magic damage and decreases move speed by 22 for 3 seconds. Gives lighting debuff.",
            "level9": "Deals 472 magic damage and decreases move speed by 23 for 3 seconds. Gives lighting debuff.",
            "level10": "Deals 557 magic damage and decreases move speed by 24 for 3 seconds. Gives lighting debuff.",
            "level11": "Deals 658 magic damage and decreases move speed by 25 for 3 seconds. Gives lighting debuff.",
            "level12": "Deals 764 magic damage and decreases move speed by 26 for 3 seconds. Gives lighting debuff.",
            "level13": "Deals 884 magic damage and decreases move speed by 27 for 3 seconds. Gives lighting debuff.",
            "level14": "Deals 1010 magic damage and decreases move speed by 28 for 3 seconds. Gives lighting debuff.",
            "level15": "Deals 1143 magic damage and decreases move speed by 29 for 3 seconds. Gives lighting debuff.",
            "level16": "Deals 1283 magic damage and decreases move speed by 30 for 3 seconds. Gives lighting debuff."
        }
    ],
    "Mana Shield": [
        {
            "level1": "Reduces 30% of damage taken at a cost of 2.25 times the mana instead",
            "level2": "Reduces 32% of damage taken at a cost of 2.2 times the mana instead",
            "level3": "Reduces 34% of damage taken at a cost of 2.15 times the mana instead",
            "level4": "Reduces 36% of damage taken at a cost of 2.1 times the mana instead",
            "level5": "Reduces 38% of damage taken at a cost of 2.05 times the mana instead",
            "level6": "Reduces 40% of damage taken at a cost of 2 times the mana instead",
            "level7": "Reduces 42% of damage taken at a cost of 1.95 times the mana instead",
            "level8": "Reduces 44% of damage taken at a cost of 1.9 times the mana instead",
            "level9": "Reduces 46% of damage taken at a cost of 1.85 times the mana instead",
            "level10": "Reduces 48% of damage taken at a cost of 1.8 times the mana instead",
            "level11": "Reduces 50% of damage taken at a cost of 1.75 times the mana instead",
            "level12": "Reduces 52% of damage taken at a cost of 1.7 times the mana instead",
            "level13": "Reduces 54% of damage taken at a cost of 1.65 times the mana instead",
            "level14": "Reduces 56% of damage taken at a cost of 1.6 times the mana instead",
            "level15": "Reduces 58% of damage taken at a cost of 1.55 times the mana instead",
            "level16": "Reduces 60% of damage taken at a cost of 1.5 times the mana instead"
        }
    ],
    "Hellfire": [
        {
            "level1": "Deals 213 magic damage and stuns for 3 seconds. Deals additional 107 magic damage to fire debuffed targets.",
            "level2": "Deals 265 magic damage and stuns for 3 seconds. Deals additional 133 magic damage to fire debuffed targets.",
            "level3": "Deals 327 magic damage and stuns for 3 seconds. Deals additional 164 magic damage to fire debuffed targets.",
            "level4": "Deals 397 magic damage and stuns for 3 seconds. Deals additional 199 magic damage to fire debuffed targets.",
            "level5": "Deals 481 magic damage and stuns for 3 seconds. Deals additional 241 magic damage to fire debuffed targets.",
            "level6": "Deals 583 magic damage and stuns for 3 seconds. Deals additional 292 magic damage to fire debuffed targets.",
            "level7": "Deals 705 magic damage and stuns for 3 seconds. Deals additional 353 magic damage to fire debuffed targets.",
            "level8": "Deals 851 magic damage and stuns for 3 seconds. Deals additional 426 magic damage to fire debuffed targets.",
            "level9": "Deals 1004 magic damage and stuns for 3 seconds. Deals additional 502 magic damage to fire debuffed targets.",
            "level10": "Deals 1185 magic damage and stuns for 3 seconds. Deals additional 593 magic damage to fire debuffed targets.",
            "level11": "Deals 1377 magic damage and stuns for 3 seconds. Deals additional 689 magic damage to fire debuffed targets.",
            "level12": "Deals 1593 magic damage and stuns for 3 seconds. Deals additional 797 magic damage to fire debuffed targets.",
            "level13": "Deals 1820 magic damage and stuns for 3 seconds. Deals additional 910 magic damage to fire debuffed targets.",
            "level14": "Deals 2060 magic damage and stuns for 3 seconds. Deals additional 1030 magic damage to fire debuffed targets.",
            "level15": "Deals 2314 magic damage and stuns for 3 seconds. Deals additional 1157 magic damage to fire debuffed targets.",
            "level16": "Deals 2603 magic damage and stuns for 3 seconds. Deals additional 1302 magic damage to fire debuffed targets."
        }
    ],
    "Aetheric Shackles": [
        {
            "level1": "Deals 104 magic damage and silences for 3 seconds. Silence duration doubles if target is casting. Deals additional 21 magic damage to dark debuffed targets.",
            "level2": "Deals 128 magic damage and silences for 4 seconds. Silence duration doubles if target is casting. Deals additional 26 magic damage to dark debuffed targets.",
            "level3": "Deals 154 magic damage and silences for 5 seconds. Silence duration doubles if target is casting. Deals additional 31 magic damage to dark debuffed targets.",
            "level4": "Deals 187 magic damage and silences for 6 seconds. Silence duration doubles if target is casting. Deals additional 37 magic damage to dark debuffed targets.",
            "level5": "Deals 227 magic damage and silences for 7 seconds. Silence duration doubles if target is casting. Deals additional 45 magic damage to dark debuffed targets.",
            "level6": "Deals 275 magic damage and silences for 8 seconds. Silence duration doubles if target is casting. Deals additional 55 magic damage to dark debuffed targets.",
            "level7": "Deals 328 magic damage and silences for 9 seconds. Silence duration doubles if target is casting. Deals additional 66 magic damage to dark debuffed targets.",
            "level8": "Deals 387 magic damage and silences for 10 seconds. Silence duration doubles if target is casting. Deals additional 77 magic damage to dark debuffed targets.",
            "level9": "Deals 457 magic damage and silences for 11 seconds. Silence duration doubles if target is casting. Deals additional 91 magic damage to dark debuffed targets.",
            "level10": "Deals 529 magic damage and silences for 12 seconds. Silence duration doubles if target is casting. Deals additional 106 magic damage to dark debuffed targets."
        }
    ],
    "Black Harvest": [
        {
            "level1": "By brandishing a scythe of darkness at enemies nearby, inflicts 173 magic damage, absorbs 100% of the the damage as HP and decreases Physical ATK by 30% for 6 seconds. Furthermore, to enemies with active dark debuff, adds 9 magic damage per level.",
            "level2": "By brandishing a scythe of darkness at enemies nearby, inflicts 210 magic damage, absorbs 105% of the the damage as HP and decreases Physical ATK by 33% for 6 seconds. Furthermore, to enemies with active dark debuff, adds 11 magic damage per level.",
            "level3": "By brandishing a scythe of darkness at enemies nearby, inflicts 255 magic damage, absorbs 110% of the the damage as HP and decreases Physical ATK by 36% for 6 seconds. Furthermore, to enemies with active dark debuff, adds 13 magic damage per level.",
            "level4": "By brandishing a scythe of darkness at enemies nearby, inflicts 309 magic damage, absorbs 115% of the the damage as HP and decreases Physical ATK by 39% for 6 seconds. Furthermore, to enemies with active dark debuff, adds 15 magic damage per level.",
            "level5": "By brandishing a scythe of darkness at enemies nearby, inflicts 375 magic damage, absorbs 120% of the the damage as HP and decreases Physical ATK by 42% for 6 seconds. Furthermore, to enemies with active dark debuff, adds 19 magic damage per level.",
            "level6": "By brandishing a scythe of darkness at enemies nearby, inflicts 453 magic damage, absorbs 125% of the the damage as HP and decreases Physical ATK by 45% for 6 seconds. Furthermore, to enemies with active dark debuff, adds 23 magic damage per level.",
            "level7": "By brandishing a scythe of darkness at enemies nearby, inflicts 536 magic damage, absorbs 130% of the the damage as HP and decreases Physical ATK by 48% for 6 seconds. Furthermore, to enemies with active dark debuff, adds 27 magic damage per level.",
            "level8": "By brandishing a scythe of darkness at enemies nearby, inflicts 633 magic damage, absorbs 135% of the the damage as HP and decreases Physical ATK by 51% for 6 seconds. Furthermore, to enemies with active dark debuff, adds 32 magic damage per level.",
            "level9": "By brandishing a scythe of darkness at enemies nearby, inflicts 738 magic damage, absorbs 140% of the the damage as HP and decreases Physical ATK by 54% for 6 seconds. Furthermore, to enemies with active dark debuff, adds 37 magic damage per level.",
            "level10": "By brandishing a scythe of darkness at enemies nearby, inflicts 854 magic damage, absorbs 145% of the the damage as HP and decreases Physical ATK by 57% for 6 seconds. Furthermore, to enemies with active dark debuff, adds 43 magic damage per level.",
            "level11": "By brandishing a scythe of darkness at enemies nearby, inflicts 980 magic damage, absorbs 150% of the the damage as HP and decreases Physical ATK by 60% for 6 seconds. Furthermore, to enemies with active dark debuff, adds 49 magic damage per level.",
            "level12": "By brandishing a scythe of darkness at enemies nearby, inflicts 1113 magic damage, absorbs 155% of the the damage as HP and decreases Physical ATK by 63% for 6 seconds. Furthermore, to enemies with active dark debuff, adds 56 magic damage per level.",
            "level13": "By brandishing a scythe of darkness at enemies nearby, inflicts 1250 magic damage, absorbs 160% of the the damage as HP and decreases Physical ATK by 66% for 6 seconds. Furthermore, to enemies with active dark debuff, adds 63 magic damage per level.",
            "level14": "By brandishing a scythe of darkness at enemies nearby, inflicts 1406 magic damage, absorbs 165% of the the damage as HP and decreases Physical ATK by 69% for 6 seconds. Furthermore, to enemies with active dark debuff, adds 70 magic damage per level.",
            "level15": "By brandishing a scythe of darkness at enemies nearby, inflicts 1575 magic damage, absorbs 170% of the the damage as HP and decreases Physical ATK by 72% for 6 seconds. Furthermore, to enemies with active dark debuff, adds 79 magic damage per level.",
            "level16": "By brandishing a scythe of darkness at enemies nearby, inflicts 1749 magic damage, absorbs 175% of the the damage as HP and decreases Physical ATK by 75% for 6 seconds. Furthermore, to enemies with active dark debuff, adds 87 magic damage per level."
        }
    ],
    "Mana Torrent": [
        {
            "level1": "Overlaps Mana, increases Magic ATK by 5. An attack ignores 2% of Magic DEF buy consumes 3 extra MP.",
            "level2": "Overlaps Mana, increases Magic ATK by 10. An attack ignores 3% of Magic DEF buy consumes 6 extra MP.",
            "level3": "Overlaps Mana, increases Magic ATK by 15. An attack ignores 3% of Magic DEF buy consumes 9 extra MP.",
            "level4": "Overlaps Mana, increases Magic ATK by 20. An attack ignores 4% of Magic DEF buy consumes 12 extra MP.",
            "level5": "Overlaps Mana, increases Magic ATK by 25. An attack ignores 4% of Magic DEF buy consumes 15 extra MP.",
            "level6": "Overlaps Mana, increases Magic ATK by 30. An attack ignores 5% of Magic DEF buy consumes 18 extra MP.",
            "level7": "Overlaps Mana, increases Magic ATK by 35. An attack ignores 5% of Magic DEF buy consumes 21 extra MP.",
            "level8": "Overlaps Mana, increases Magic ATK by 40. An attack ignores 6% of Magic DEF buy consumes 24 extra MP.",
            "level9": "Overlaps Mana, increases Magic ATK by 45. An attack ignores 6% of Magic DEF buy consumes 27 extra MP.",
            "level10": "Overlaps Mana, increases Magic ATK by 50. An attack ignores 7% of Magic DEF buy consumes 30 extra MP."
        }
    ],
    "Meditate": [
        {
            "level1": "Harmonizes Mana, adds 6% of Max MP to max HP. The Max MP increase from buff is excluded from the effect",
            "level2": "Harmonizes Mana, adds 7% of Max MP to max HP. The Max MP increase from buff is excluded from the effect",
            "level3": "Harmonizes Mana, adds 8% of Max MP to max HP. The Max MP increase from buff is excluded from the effect",
            "level4": "Harmonizes Mana, adds 9% of Max MP to max HP. The Max MP increase from buff is excluded from the effect",
            "level5": "Harmonizes Mana, adds 10% of Max MP to max HP. The Max MP increase from buff is excluded from the effect",
            "level6": "Harmonizes Mana, adds 11% of Max MP to max HP. The Max MP increase from buff is excluded from the effect",
            "level7": "Harmonizes Mana, adds 12% of Max MP to max HP. The Max MP increase from buff is excluded from the effect",
            "level8": "Harmonizes Mana, adds 13% of Max MP to max HP. The Max MP increase from buff is excluded from the effect",
            "level9": "Harmonizes Mana, adds 14% of Max MP to max HP. The Max MP increase from buff is excluded from the effect",
            "level10": "Harmonizes Mana, adds 15% of Max MP to max HP. The Max MP increase from buff is excluded from the effect"
        }
    ],
    "Shadow Fall": [
        {
            "level1": "Deals 68 magic damage per second for 10 seconds to targets in range. Deals additional 7 magic damage to dark debuffed targets.",
            "level2": "Deals 82 magic damage per second for 10 seconds to targets in range. Deals additional 8 magic damage to dark debuffed targets.",
            "level3": "Deals 100 magic damage per second for 10 seconds to targets in range. Deals additional 10 magic damage to dark debuffed targets.",
            "level4": "Deals 121 magic damage per second for 10 seconds to targets in range. Deals additional 12 magic damage to dark debuffed targets.",
            "level5": "Deals 144 magic damage per second for 10 seconds to targets in range. Deals additional 14 magic damage to dark debuffed targets.",
            "level6": "Deals 170 magic damage per second for 10 seconds to targets in range. Deals additional 17 magic damage to dark debuffed targets.",
            "level7": "Deals 201 magic damage per second for 10 seconds to targets in range. Deals additional 20 magic damage to dark debuffed targets.",
            "level8": "Deals 233 magic damage per second for 10 seconds to targets in range. Deals additional 23 magic damage to dark debuffed targets.",
            "level9": "Deals 270 magic damage per second for 10 seconds to targets in range. Deals additional 27 magic damage to dark debuffed targets.",
            "level10": "Deals 308 magic damage per second for 10 seconds to targets in range. Deals additional 31 magic damage to dark debuffed targets."
        }
    ],
    "Soul Trap": [
        {
            "level1": "Explodes if target's HP drops below 50% or after 20 seconds. Deals 389 magic damage to all enemies in a 4 meter radius. Deals 38 additional magic damage to targets under dark debuff.",
            "level2": "Explodes if target's HP drops below 50% or after 20 seconds. Deals 471 magic damage to all enemies in a 4 meter radius. Deals 47 additional magic damage to targets under dark debuff.",
            "level3": "Explodes if target's HP drops below 50% or after 20 seconds. Deals 572 magic damage to all enemies in a 4 meter radius. Deals 57 additional magic damage to targets under dark debuff.",
            "level4": "Explodes if target's HP drops below 50% or after 20 seconds. Deals 691 magic damage to all enemies in a 4 meter radius. Deals 69 additional magic damage to targets under dark debuff.",
            "level5": "Explodes if target's HP drops below 50% or after 20 seconds. Deals 817 magic damage to all enemies in a 4 meter radius. Deals 81 additional magic damage to targets under dark debuff.",
            "level6": "Explodes if target's HP drops below 50% or after 20 seconds. Deals 966 magic damage to all enemies in a 4 meter radius. Deals 96 additional magic damage to targets under dark debuff.",
            "level7": "Explodes if target's HP drops below 50% or after 20 seconds. Deals 1126 magic damage to all enemies in a 4 meter radius. Deals 112 additional magic damage to targets under dark debuff.",
            "level8": "Explodes if target's HP drops below 50% or after 20 seconds. Deals 1302 magic damage to all enemies in a 4 meter radius. Deals 130 additional magic damage to targets under dark debuff.",
            "level9": "Explodes if target's HP drops below 50% or after 20 seconds. Deals 1494 magic damage to all enemies in a 4 meter radius. Deals 149 additional magic damage to targets under dark debuff.",
            "level10": "Explodes if target's HP drops below 50% or after 20 seconds. Deals 1698 magic damage to all enemies in a 4 meter radius. Deals 169 additional magic damage to targets under dark debuff.",
            "level11": "Explodes if target's HP drops below 50% or after 20 seconds. Deals 1906 magic damage to all enemies in a 4 meter radius. Deals 190 additional magic damage to targets under dark debuff.",
            "level12": "Explodes if target's HP drops below 50% or after 20 seconds. Deals 2144 magic damage to all enemies in a 4 meter radius. Deals 214 additional magic damage to targets under dark debuff.",
            "level13": "Explodes if target's HP drops below 50% or after 20 seconds. Deals 2402 magic damage to all enemies in a 4 meter radius. Deals 240 additional magic damage to targets under dark debuff.",
            "level14": "Explodes if target's HP drops below 50% or after 20 seconds. Deals 2668 magic damage to all enemies in a 4 meter radius. Deals 266 additional magic damage to targets under dark debuff.",
            "level15": "Explodes if target's HP drops below 50% or after 20 seconds. Deals 2965 magic damage to all enemies in a 4 meter radius. Deals 296 additional magic damage to targets under dark debuff.",
            "level16": "Explodes if target's HP drops below 50% or after 20 seconds. Deals 3292 magic damage to all enemies in a 4 meter radius. Deals 329 additional magic damage to targets under dark debuff."
        }
    ],
    "Aether Flare": [
        {
            "level1": "Deals 378 magic damage and vanishes defense skills a maximum of 2 times. Deals additional 132 damage to lighting debuffed targets.",
            "level2": "Deals 456 magic damage and vanishes defense skills a maximum of 2 times. Deals additional 160 damage to lighting debuffed targets.",
            "level3": "Deals 551 magic damage and vanishes defense skills a maximum of 2 times. Deals additional 193 damage to lighting debuffed targets.",
            "level4": "Deals 651 magic damage and vanishes defense skills a maximum of 2 times. Deals additional 228 damage to lighting debuffed targets.",
            "level5": "Deals 768 magic damage and vanishes defense skills a maximum of 2 times. Deals additional 269 damage to lighting debuffed targets.",
            "level6": "Deals 893 magic damage and vanishes defense skills a maximum of 2 times. Deals additional 313 damage to lighting debuffed targets.",
            "level7": "Deals 1033 magic damage and vanishes defense skills a maximum of 2 times. Deals additional 362 damage to lighting debuffed targets.",
            "level8": "Deals 1180 magic damage and vanishes defense skills a maximum of 2 times. Deals additional 413 damage to lighting debuffed targets.",
            "level9": "Deals 1335 magic damage and vanishes defense skills a maximum of 2 times. Deals additional 467 damage to lighting debuffed targets.",
            "level10": "Deals 1500 magic damage and vanishes defense skills a maximum of 2 times. Deals additional 526 damage to lighting debuffed targets.",
            "level11": "Deals 1687 magic damage and vanishes defense skills a maximum of 2 times. Deals additional 590 damage to lighting debuffed targets.",
            "level12": "Deals 1887 magic damage and vanishes defense skills a maximum of 2 times. Deals additional 660 damage to lighting debuffed targets.",
            "level13": "Deals 2095 magic damage and vanishes defense skills a maximum of 2 times. Deals additional 733 damage to lighting debuffed targets.",
            "level14": "Deals 2328 magic damage and vanishes defense skills a maximum of 2 times. Deals additional 815 damage to lighting debuffed targets.",
            "level15": "Deals 2586 magic damage and vanishes defense skills a maximum of 2 times. Deals additional 905 damage to lighting debuffed targets.",
            "level16": "Deals 2872 magic damage and vanishes defense skills a maximum of 2 times. Deals additional 1005 damage to lighting debuffed targets."
        }
    ],
    "Inferno": [
        {
            "level1": "Deals 476 magic damage to enemies in range. Decreases move speed by 20 for 8 seconds. Deals additional 119 magic damage to fire debuffed targets.",
            "level2": "Deals 576 magic damage to enemies in range. Decreases move speed by 22 for 8 seconds. Deals additional 144 magic damage to fire debuffed targets.",
            "level3": "Deals 684 magic damage to enemies in range. Decreases move speed by 24 for 8 seconds. Deals additional 171 magic damage to fire debuffed targets.",
            "level4": "Deals 804 magic damage to enemies in range. Decreases move speed by 26 for 8 seconds. Deals additional 202 magic damage to fire debuffed targets.",
            "level5": "Deals 948 magic damage to enemies in range. Decreases move speed by 28 for 8 seconds. Deals additional 237 magic damage to fire debuffed targets.",
            "level6": "Deals 1096 magic damage to enemies in range. Decreases move speed by 30 for 8 seconds. Deals additional 274 magic damage to fire debuffed targets.",
            "level7": "Deals 1264 magic damage to enemies in range. Decreases move speed by 32 for 8 seconds. Deals additional 316 magic damage to fire debuffed targets.",
            "level8": "Deals 1440 magic damage to enemies in range. Decreases move speed by 34 for 8 seconds. Deals additional 360 magic damage to fire debuffed targets.",
            "level9": "Deals 1618 magic damage to enemies in range. Decreases move speed by 36 for 8 seconds. Deals additional 405 magic damage to fire debuffed targets.",
            "level10": "Deals 1818 magic damage to enemies in range. Decreases move speed by 38 for 8 seconds. Deals additional 455 magic damage to fire debuffed targets.",
            "level11": "Deals 2044 magic damage to enemies in range. Decreases move speed by 40 for 8 seconds. Deals additional 511 magic damage to fire debuffed targets.",
            "level12": "Deals 2272 magic damage to enemies in range. Decreases move speed by 42 for 8 seconds. Deals additional 568 magic damage to fire debuffed targets.",
            "level13": "Deals 2524 magic damage to enemies in range. Decreases move speed by 44 for 8 seconds. Deals additional 631 magic damage to fire debuffed targets.",
            "level14": "Deals 2804 magic damage to enemies in range. Decreases move speed by 46 for 8 seconds. Deals additional 701 magic damage to fire debuffed targets.",
            "level15": "Deals 3112 magic damage to enemies in range. Decreases move speed by 48 for 8 seconds. Deals additional 778 magic damage to fire debuffed targets.",
            "level16": "Deals 3458 magic damage to enemies in range. Decreases move speed by 50 for 8 seconds. Deals additional 865 magic damage to fire debuffed targets."
        }
    ],
    "Nightmare": [
        {
            "level1": "Puts enemies within 5 meters to sleep for 4 seconds. This skill cannot be automatically recast.",
            "level2": "Puts enemies within 5 meters to sleep for 8 seconds. This skill cannot be automatically recast.",
            "level3": "Puts enemies within 5 meters to sleep for 12 seconds. This skill cannot be automatically recast.",
            "level4": "Puts enemies within 5 meters to sleep for 16 seconds. This skill cannot be automatically recast.",
            "level5": "Puts enemies within 5 meters to sleep for 20 seconds. This skill cannot be automatically recast.",
            "level6": "Puts enemies within 5 meters to sleep for 24 seconds. This skill cannot be automatically recast.",
            "level7": "Puts enemies within 5 meters to sleep for 28 seconds. This skill cannot be automatically recast.",
            "level8": "Puts enemies within 5 meters to sleep for 32 seconds. This skill cannot be automatically recast.",
            "level9": "Puts enemies within 5 meters to sleep for 36 seconds. This skill cannot be automatically recast.",
            "level10": "Puts enemies within 5 meters to sleep for 40 seconds. This skill cannot be automatically recast."
        }
    ],
    "Rend Soul": [
        {
            "level1": "The dark hand decreases Magic DEF by 6% and inflicts fire, dark, lighting debuff LVL 1 for 10 seconds.",
            "level2": "The dark hand decreases Magic DEF by 7% and inflicts fire, dark, lighting debuff LVL 2 for 11 seconds.",
            "level3": "The dark hand decreases Magic DEF by 8% and inflicts fire, dark, lighting debuff LVL 3 for 12 seconds.",
            "level4": "The dark hand decreases Magic DEF by 9% and inflicts fire, dark, lighting debuff LVL 4 for 13 seconds.",
            "level5": "The dark hand decreases Magic DEF by 10% and inflicts fire, dark, lighting debuff LVL 5 for 14 seconds.",
            "level6": "The dark hand decreases Magic DEF by 11% and inflicts fire, dark, lighting debuff LVL 6 for 15 seconds.",
            "level7": "The dark hand decreases Magic DEF by 12% and inflicts fire, dark, lighting debuff LVL 7 for 16 seconds.",
            "level8": "The dark hand decreases Magic DEF by 13% and inflicts fire, dark, lighting debuff LVL 8 for 17 seconds.",
            "level9": "The dark hand decreases Magic DEF by 14% and inflicts fire, dark, lighting debuff LVL 9 for 18 seconds.",
            "level10": "The dark hand decreases Magic DEF by 15% and inflicts fire, dark, lighting debuff LVL 10 for 20 seconds."
        }
    ],
    "Mass Teleport": [
        {
            "level1": "Teleports to the saved location with all party members who are within 10 meters. Maximum of 1 locations can be saved.",
            "level2": "Teleports to the saved location with all party members who are within 10 meters. Maximum of 2 locations can be saved.",
            "level3": "Teleports to the saved location with all party members who are within 10 meters. Maximum of 3 locations can be saved.",
            "level4": "Teleports to the saved location with all party members who are within 10 meters. Maximum of 4 locations can be saved.",
            "level5": "Teleports to the saved location with all party members who are within 10 meters. Maximum of 5 locations can be saved.",
            "level6": "Teleports to the saved location with all party members who are within 10 meters. Maximum of 5 locations can be saved.",
            "level7": "Teleports to the saved location with all party members who are within 10 meters. Maximum of 5 locations can be saved.",
            "level8": "Teleports to the saved location with all party members who are within 10 meters. Maximum of 5 locations can be saved.",
            "level9": "Teleports to the saved location with all party members who are within 10 meters. Maximum of 5 locations can be saved.",
            "level10": "Teleports to the saved location with all party members who are within 10 meters. Maximum of 5 locations can be saved."
        }
    ],
    "Meteor": [
        {
            "level1": "Deals 2399 magic damage to all enemies in a 6 meter radius and stuns for 5 seconds. Deals 239 additional magic damage to targets under dark debuff.",
            "level2": "Deals 2833 magic damage to all enemies in a 6 meter radius and stuns for 5 seconds. Deals 283 additional magic damage to targets under dark debuff.",
            "level3": "Deals 3343 magic damage to all enemies in a 6 meter radius and stuns for 5 seconds. Deals 334 additional magic damage to targets under dark debuff.",
            "level4": "Deals 3884 magic damage to all enemies in a 6 meter radius and stuns for 5 seconds. Deals 388 additional magic damage to targets under dark debuff.",
            "level5": "Deals 4493 magic damage to all enemies in a 6 meter radius and stuns for 5 seconds. Deals 449 additional magic damage to targets under dark debuff.",
            "level6": "Deals 5133 magic damage to all enemies in a 6 meter radius and stuns for 5 seconds. Deals 513 additional magic damage to targets under dark debuff.",
            "level7": "Deals 5811 magic damage to all enemies in a 6 meter radius and stuns for 5 seconds. Deals 581 additional magic damage to targets under dark debuff.",
            "level8": "Deals 6527 magic damage to all enemies in a 6 meter radius and stuns for 5 seconds. Deals 652 additional magic damage to targets under dark debuff.",
            "level9": "Deals 7342 magic damage to all enemies in a 6 meter radius and stuns for 5 seconds. Deals 734 additional magic damage to targets under dark debuff.",
            "level10": "Deals 8210 magic damage to all enemies in a 6 meter radius and stuns for 5 seconds. Deals 821 additional magic damage to targets under dark debuff.",
            "level11": "Deals 9116 magic damage to all enemies in a 6 meter radius and stuns for 5 seconds. Deals 911 additional magic damage to targets under dark debuff.",
            "level12": "Deals 10129 magic damage to all enemies in a 6 meter radius and stuns for 5 seconds. Deals 1012 additional magic damage to targets under dark debuff.",
            "level13": "Deals 11249 magic damage to all enemies in a 6 meter radius and stuns for 5 seconds. Deals 1124 additional magic damage to targets under dark debuff.",
            "level14": "Deals 12384 magic damage to all enemies in a 6 meter radius and stuns for 5 seconds. Deals 1238 additional magic damage to targets under dark debuff.",
            "level15": "Deals 13633 magic damage to all enemies in a 6 meter radius and stuns for 5 seconds. Deals 1363 additional magic damage to targets under dark debuff.",
            "level16": "Deals 15011 magic damage to all enemies in a 6 meter radius and stuns for 5 seconds. Deals 1501 additional magic damage to targets under dark debuff."
        }
    ],
    "Mirrored Agony": [
        {
            "level1": "Deals 984 magic damage to target and 75% of inflicted damage to caster. Deals additional 197 magic damage to dark debuffed targets.",
            "level2": "Deals 1138 magic damage to target and 73% of inflicted damage to caster. Deals additional 228 magic damage to dark debuffed targets.",
            "level3": "Deals 1304 magic damage to target and 71% of inflicted damage to caster. Deals additional 261 magic damage to dark debuffed targets.",
            "level4": "Deals 1484 magic damage to target and 69% of inflicted damage to caster. Deals additional 297 magic damage to dark debuffed targets.",
            "level5": "Deals 1668 magic damage to target and 67% of inflicted damage to caster. Deals additional 334 magic damage to dark debuffed targets.",
            "level6": "Deals 1874 magic damage to target and 65% of inflicted damage to caster. Deals additional 375 magic damage to dark debuffed targets.",
            "level7": "Deals 2102 magic damage to target and 63% of inflicted damage to caster. Deals additional 420 magic damage to dark debuffed targets.",
            "level8": "Deals 2332 magic damage to target and 61% of inflicted damage to caster. Deals additional 466 magic damage to dark debuffed targets.",
            "level9": "Deals 2592 magic damage to target and 59% of inflicted damage to caster. Deals additional 518 magic damage to dark debuffed targets.",
            "level10": "Deals 2880 magic damage to target and 57% of inflicted damage to caster. Deals additional 576 magic damage to dark debuffed targets.",
            "level11": "Deals 3198 magic damage to target and 55% of inflicted damage to caster. Deals additional 640 magic damage to dark debuffed targets.",
            "level12": "Deals 3550 magic damage to target and 53% of inflicted damage to caster. Deals additional 710 magic damage to dark debuffed targets.",
            "level13": "Deals 3944 magic damage to target and 50% of inflicted damage to caster. Deals additional 789 magic damage to dark debuffed targets."
        }
    ],
    "Ahriman's Blessing": [
        {
            "level1": "Increases the probablity of resisting against silence and fear by 5% and 3% respectively.",
            "level2": "Increases the probablity of resisting against silence and fear by 10% and 6% respectively.",
            "level3": "Increases the probablity of resisting against silence and fear by 15% and 9% respectively.",
            "level4": "Increases the probablity of resisting against silence and fear by 20% and 12% respectively.",
            "level5": "Increases the probablity of resisting against silence and fear by 25% and 15% respectively.",
            "level6": "Increases the probablity of resisting against silence and fear by 30% and 18% respectively.",
            "level7": "Increases the probablity of resisting against silence and fear by 35% and 21% respectively.",
            "level8": "Increases the probablity of resisting against silence and fear by 40% and 24% respectively.",
            "level9": "Increases the probablity of resisting against silence and fear by 45% and 27% respectively.",
            "level10": "Increases the probablity of resisting against silence and fear by 50% and 30% respectively."
        }
    ],
    "Calamity": [
        {
            "level1": "Deals 572 magic damage per second to all enemies within target area for 12 seconds and decreases move speed by 10. Deals 57 additional magic damage to targets under dark debuff.",
            "level2": "Deals 646 magic damage per second to all enemies within target area for 12 seconds and decreases move speed by 12. Deals 64 additional magic damage to targets under dark debuff.",
            "level3": "Deals 725 magic damage per second to all enemies within target area for 12 seconds and decreases move speed by 14. Deals 72 additional magic damage to targets under dark debuff.",
            "level4": "Deals 815 magic damage per second to all enemies within target area for 12 seconds and decreases move speed by 16. Deals 81 additional magic damage to targets under dark debuff.",
            "level5": "Deals 914 magic damage per second to all enemies within target area for 12 seconds and decreases move speed by 18. Deals 91 additional magic damage to targets under dark debuff.",
            "level6": "Deals 1014 magic damage per second to all enemies within target area for 12 seconds and decreases move speed by 20. Deals 101 additional magic damage to targets under dark debuff.",
            "level7": "Deals 1128 magic damage per second to all enemies within target area for 12 seconds and decreases move speed by 22. Deals 112 additional magic damage to targets under dark debuff.",
            "level8": "Deals 1252 magic damage per second to all enemies within target area for 12 seconds and decreases move speed by 24. Deals 125 additional magic damage to targets under dark debuff.",
            "level9": "Deals 1390 magic damage per second to all enemies within target area for 12 seconds and decreases move speed by 26. Deals 139 additional magic damage to targets under dark debuff.",
            "level10": "Deals 1544 magic damage per second to all enemies within target area for 12 seconds and decreases move speed by 28. Deals 154 additional magic damage to targets under dark debuff.",
            "level11": "Deals 1715 magic damage per second to all enemies within target area for 12 seconds and decreases move speed by 30. Deals 171 additional magic damage to targets under dark debuff."
        }
    ],
    "Incinerate": [
        {
            "level1": "Summon a blazing flame pillar to deal 1678 magical damage to an enemy and its surroundings within a 4m radius and Shock them for 3sec. Adds additional 553 damage when Shock ends and 420 magical damage to enemies in Flame acceleration state.",
            "level2": "Summon a blazing flame pillar to deal 1886 magical damage to an enemy and its surroundings within a 4m radius and Shock them for 3sec. Adds additional 622 damage when Shock ends and 472 magical damage to enemies in Flame acceleration state.",
            "level3": "Summon a blazing flame pillar to deal 2122 magical damage to an enemy and its surroundings within a 4m radius and Shock them for 3sec. Adds additional 700 damage when Shock ends and 531 magical damage to enemies in Flame acceleration state.",
            "level4": "Summon a blazing flame pillar to deal 2386 magical damage to an enemy and its surroundings within a 4m radius and Shock them for 3sec. Adds additional 787 damage when Shock ends and 597 magical damage to enemies in Flame acceleration state.",
            "level5": "Summon a blazing flame pillar to deal 2657 magical damage to an enemy and its surroundings within a 4m radius and Shock them for 3sec. Adds additional 876 damage when Shock ends and 664 magical damage to enemies in Flame acceleration state.",
            "level6": "Summon a blazing flame pillar to deal 2950 magical damage to an enemy and its surroundings within a 4m radius and Shock them for 3sec. Adds additional 973 damage when Shock ends and 738 magical damage to enemies in Flame acceleration state.",
            "level7": "Summon a blazing flame pillar to deal 3276 magical damage to an enemy and its surroundings within a 4m radius and Shock them for 3sec. Adds additional 1081 damage when Shock ends and 819 magical damage to enemies in Flame acceleration state.",
            "level8": "Summon a blazing flame pillar to deal 3638 magical damage to an enemy and its surroundings within a 4m radius and Shock them for 3sec. Adds additional 1200 damage when Shock ends and 910 magical damage to enemies in Flame acceleration state.",
            "level9": "Summon a blazing flame pillar to deal 4042 magical damage to an enemy and its surroundings within a 4m radius and Shock them for 3sec. Adds additional 1333 damage when Shock ends and 1011 magical damage to enemies in Flame acceleration state.",
            "level10": "Summon a blazing flame pillar to deal 4490 magical damage to an enemy and its surroundings within a 4m radius and Shock them for 3sec. Adds additional 1481 damage when Shock ends and 1123 magical damage to enemies in Flame acceleration state.",
            "level11": "Summon a blazing flame pillar to deal 4730 magical damage to an enemy and its surroundings within a 4m radius and Shock them for 3sec. Adds additional 1560 damage when Shock ends and 1183 magical damage to enemies in Flame acceleration state."
        }
    ],
    "Focus Magic": [
        {
            "level1": "Decreases your chance to be interrupted by any attack by 4% and decreases mana consumption by 5%",
            "level2": "Decreases your chance to be interrupted by any attack by 8% and decreases mana consumption by 6%",
            "level3": "Decreases your chance to be interrupted by any attack by 12% and decreases mana consumption by 7%",
            "level4": "Decreases your chance to be interrupted by any attack by 16% and decreases mana consumption by 8%",
            "level5": "Decreases your chance to be interrupted by any attack by 20% and decreases mana consumption by 9%",
            "level6": "Decreases your chance to be interrupted by any attack by 24% and decreases mana consumption by 10%",
            "level7": "Decreases your chance to be interrupted by any attack by 28% and decreases mana consumption by 11%",
            "level8": "Decreases your chance to be interrupted by any attack by 32% and decreases mana consumption by 12%",
            "level9": "Decreases your chance to be interrupted by any attack by 36% and decreases mana consumption by 13%",
            "level10": "Decreases your chance to be interrupted by any attack by 40% and decreases mana consumption by 15%"
        }
    ],
    "Volt Rain": [
        {
            "level1": "Deals 884 damage to enemies in range 5 times. Decreases move speed and vanishes protect buffs 3 times. Deals additional 159 damage to lighting debuffed targets.",
            "level2": "Deals 994 damage to enemies in range 5 times. Decreases move speed and vanishes protect buffs 3 times. Deals additional 179 damage to lighting debuffed targets.",
            "level3": "Deals 1107 damage to enemies in range 5 times. Decreases move speed and vanishes protect buffs 3 times. Deals additional 199 damage to lighting debuffed targets.",
            "level4": "Deals 1229 damage to enemies in range 5 times. Decreases move speed and vanishes protect buffs 3 times. Deals additional 221 damage to lighting debuffed targets.",
            "level5": "Deals 1365 damage to enemies in range 5 times. Decreases move speed and vanishes protect buffs 3 times. Deals additional 246 damage to lighting debuffed targets.",
            "level6": "Deals 1516 damage to enemies in range 5 times. Decreases move speed and vanishes protect buffs 3 times. Deals additional 273 damage to lighting debuffed targets.",
            "level7": "Deals 1684 damage to enemies in range 5 times. Decreases move speed and vanishes protect buffs 3 times. Deals additional 303 damage to lighting debuffed targets.",
            "level8": "Deals 1871 damage to enemies in range 5 times. Decreases move speed and vanishes protect buffs 3 times. Deals additional 337 damage to lighting debuffed targets.",
            "level9": "Deals 1971 damage to enemies in range 5 times. Decreases move speed and vanishes protect buffs 3 times. Deals additional 355 damage to lighting debuffed targets."
        }
    ],
    "Shadow Mist": [
        {
            "level1": "Absorbs 8848 Physical Attack for 120 secs and increases max skill attack by 890, Critical Rate by 25 and Dodge Rate by 31. Absorbs 25% Physical damage received from a wide range attack. It deactivates if max absorb value is reached.",
            "level2": "Absorbs 9919 Physical Attack for 120 secs and increases max skill attack by 997, Critical Rate by 28 and Dodge Rate by 33. Absorbs 25% Physical damage received from a wide range attack. It deactivates if max absorb value is reached.",
            "level3": "Absorbs 11018 Physical Attack for 120 secs and increases max skill attack by 1107, Critical Rate by 31 and Dodge Rate by 35. Absorbs 25% Physical damage received from a wide range attack. It deactivates if max absorb value is reached.",
            "level4": "Absorbs 12243 Physical Attack for 120 secs and increases max skill attack by 1231, Critical Rate by 34 and Dodge Rate by 37. Absorbs 25% Physical damage received from a wide range attack. It deactivates if max absorb value is reached.",
            "level5": "Absorbs 13601 Physical Attack for 120 secs and increases max skill attack by 1367, Critical Rate by 37 and Dodge Rate by 39. Absorbs 25% Physical damage received from a wide range attack. It deactivates if max absorb value is reached.",
            "level6": "Absorbs 15099 Physical Attack for 120 secs and increases max skill attack by 1518, Critical Rate by 40 and Dodge Rate by 41. Absorbs 25% Physical damage received from a wide range attack. It deactivates if max absorb value is reached.",
            "level7": "Absorbs 16765 Physical Attack for 120 secs and increases max skill attack by 1686, Critical Rate by 43 and Dodge Rate by 43. Absorbs 25% Physical damage received from a wide range attack. It deactivates if max absorb value is reached.",
            "level8": "Absorbs 18620 Physical Attack for 120 secs and increases max skill attack by 1872, Critical Rate by 46 and Dodge Rate by 45. Absorbs 25% Physical damage received from a wide range attack. It deactivates if max absorb value is reached."
        }
    ],
    "Black Hole": [
        {
            "level1": "Causes explosion on the selected area and deals 2940 nagic Attack. Decreases max of 3675 Mana and deals equivalent additional Damage. Deals Additional 661 Magic Attack to targets under dark debuff.",
            "level2": "Causes explosion on the selected area and deals 3265 nagic Attack. Decreases max of 4081 Mana and deals equivalent additional Damage. Deals Additional 734 Magic Attack to targets under dark debuff.",
            "level3": "Causes explosion on the selected area and deals 3629 nagic Attack. Decreases max of 4536 Mana and deals equivalent additional Damage. Deals Additional 816 Magic Attack to targets under dark debuff.",
            "level4": "Causes explosion on the selected area and deals 4029 nagic Attack. Decreases max of 5037 Mana and deals equivalent additional Damage. Deals Additional 906 Magic Attack to targets under dark debuff.",
            "level5": "Causes explosion on the selected area and deals 4474 nagic Attack. Decreases max of 5593 Mana and deals equivalent additional Damage. Deals Additional 1006 Magic Attack to targets under dark debuff.",
            "level6": "Causes explosion on the selected area and deals 4970 nagic Attack. Decreases max of 6213 Mana and deals equivalent additional Damage. Deals Additional 1118 Magic Attack to targets under dark debuff.",
            "level7": "Causes explosion on the selected area and deals 5519 nagic Attack. Decreases max of 6899 Mana and deals equivalent additional Damage. Deals Additional 1241 Magic Attack to targets under dark debuff."
        }
    ],
    "Ruinous Thunder": [
        {
            "level1": "Deals 2099 Magic Attack to target and nearby enemies within 3 M. Increases magic damage received by taget by 20% for 3 secs. Deals additional 378 magic damage to target under electric debuff and removes mult. defense skills 2 times.",
            "level2": "Deals 2333 Magic Attack to target and nearby enemies within 3 M. Increases magic damage received by taget by 22% for 3 secs. Deals additional 420 magic damage to target under electric debuff and removes mult. defense skills 2 times.",
            "level3": "Deals 2590 Magic Attack to target and nearby enemies within 3 M. Increases magic damage received by taget by 24% for 3 secs. Deals additional 466 magic damage to target under electric debuff and removes mult. defense skills 2 times.",
            "level4": "Deals 2876 Magic Attack to target and nearby enemies within 3 M. Increases magic damage received by taget by 26% for 3 secs. Deals additional 518 magic damage to target under electric debuff and removes mult. defense skills 2 times.",
            "level5": "Deals 3195 Magic Attack to target and nearby enemies within 3 M. Increases magic damage received by taget by 28% for 3 secs. Deals additional 575 magic damage to target under electric debuff and removes mult. defense skills 2 times.",
            "level6": "Deals 3548 Magic Attack to target and nearby enemies within 3 M. Increases magic damage received by taget by 30% for 3 secs. Deals additional 639 magic damage to target under electric debuff and removes mult. defense skills 2 times."
        }
    ],
    "Mana Barbs": [
        {
            "level1": "Sends crystalized mana into your target, dealing 2151 magical damage plus an additional damage of 5% current mana",
            "level2": "Sends crystalized mana into your target, dealing 2389 magical damage plus an additional damage of 6% current mana",
            "level3": "Sends crystalized mana into your target, dealing 2653 magical damage plus an additional damage of 7% current mana",
            "level4": "Sends crystalized mana into your target, dealing 2947 magical damage plus an additional damage of 8% current mana",
            "level5": "Sends crystalized mana into your target, dealing 3274 magical damage plus an additional damage of 9% current mana"
        }
    ],
    "Blizzard": [
        {
            "level1": "Conjure an icy tornado around the user to deal 2948 magical damage to enemies within a 5m radius and stun them for 3 sec.",
            "level2": "Conjure an icy tornado around the user to deal 3276 magical damage to enemies within a 5m radius and stun them for 4 sec.",
            "level3": "Conjure an icy tornado around the user to deal 3637 magical damage to enemies within a 5m radius and stun them for 5 sec.",
            "level4": "Conjure an icy tornado around the user to deal 4041 magical damage to enemies within a 5m radius and stun them for 6 sec.",
            "level5": "Conjure an icy tornado around the user to deal 4257 magical damage to enemies within a 5m radius and stun them for 7 sec."
        }
    ],
    "Black Twister": [
        {
            "level1": "Summon a shadowy gale to Shock enemies and coat the user with a DEF boosting Black Shroud. When the Shock state ends, enemies receive 6064 damage.",
            "level2": "Summon a shadowy gale to Shock enemies and coat the user with a DEF boosting Black Shroud. When the Shock state ends, enemies receive 6736 damage.",
            "level3": "Summon a shadowy gale to Shock enemies and coat the user with a DEF boosting Black Shroud. When the Shock state ends, enemies receive 7484 damage.",
            "level4": "Summon a shadowy gale to Shock enemies and coat the user with a DEF boosting Black Shroud. When the Shock state ends, enemies receive 7884 damage."
        }
    ],
    "Abyssal Gate": [
        {
            "level1": "The Abyssal Gate opened within 6m radius of a targeted point inflicts 3453 magical damage per seconds for 8 seconds and decreases Movement Speed(can't be cancelled). By responding all debuff states, adds 132 magical damage per debuff level.",
            "level2": "The Abyssal Gate opened within 6m radius of a targeted point inflicts 3834 magical damage per seconds for 8 seconds and decreases Movement Speed(can't be cancelled). By responding all debuff states, adds 158 magical damage per debuff level."
        }
    ],
    "Holy Arrow": [
        {
            "level1": "Deals 63 magic damage. Deals 150% damage to demons and undead.",
            "level2": "Deals 77 magic damage. Deals 150% damage to demons and undead.",
            "level3": "Deals 103 magic damage. Deals 150% damage to demons and undead.",
            "level4": "Deals 132 magic damage. Deals 150% damage to demons and undead.",
            "level5": "Deals 165 magic damage. Deals 150% damage to demons and undead.",
            "level6": "Deals 205 magic damage. Deals 150% damage to demons and undead.",
            "level7": "Deals 248 magic damage. Deals 150% damage to demons and undead.",
            "level8": "Deals 303 magic damage. Deals 150% damage to demons and undead.",
            "level9": "Deals 366 magic damage. Deals 150% damage to demons and undead.",
            "level10": "Deals 443 magic damage. Deals 150% damage to demons and undead.",
            "level11": "Deals 535 magic damage. Deals 150% damage to demons and undead.",
            "level12": "Deals 630 magic damage. Deals 150% damage to demons and undead.",
            "level13": "Deals 744 magic damage. Deals 150% damage to demons and undead.",
            "level14": "Deals 862 magic damage. Deals 150% damage to demons and undead.",
            "level15": "Deals 1000 magic damage. Deals 150% damage to demons and undead.",
            "level16": "Deals 1149 magic damage. Deals 150% damage to demons and undead."
        }
    ],
    "Cure": [
        {
            "level1": "Heals the target for 93.",
            "level2": "Heals the target for 124.",
            "level3": "Heals the target for 155.",
            "level4": "Heals the target for 190.",
            "level5": "Heals the target for 235.",
            "level6": "Heals the target for 280.",
            "level7": "Heals the target for 337.",
            "level8": "Heals the target for 404.",
            "level9": "Heals the target for 484.",
            "level10": "Heals the target for 579.",
            "level11": "Heals the target for 676.",
            "level12": "Heals the target for 789.",
            "level13": "Heals the target for 907.",
            "level14": "Heals the target for 1039.",
            "level15": "Heals the target for 1173.",
            "level16": "Heals the target for 1316."
        }
    ],
    "Angelic Armor": [
        {
            "level1": "Absorbs 438 physical damage for a maximum of 60 seconds. Reduces area physical damage by 25% and absorbs the rest.",
            "level2": "Absorbs 570 physical damage for a maximum of 64 seconds. Reduces area physical damage by 25% and absorbs the rest.",
            "level3": "Absorbs 714 physical damage for a maximum of 68 seconds. Reduces area physical damage by 25% and absorbs the rest.",
            "level4": "Absorbs 882 physical damage for a maximum of 72 seconds. Reduces area physical damage by 25% and absorbs the rest.",
            "level5": "Absorbs 1086 physical damage for a maximum of 76 seconds. Reduces area physical damage by 25% and absorbs the rest.",
            "level6": "Absorbs 1314 physical damage for a maximum of 80 seconds. Reduces area physical damage by 25% and absorbs the rest.",
            "level7": "Absorbs 1590 physical damage for a maximum of 84 seconds. Reduces area physical damage by 25% and absorbs the rest.",
            "level8": "Absorbs 1926 physical damage for a maximum of 88 seconds. Reduces area physical damage by 25% and absorbs the rest.",
            "level9": "Absorbs 2334 physical damage for a maximum of 92 seconds. Reduces area physical damage by 25% and absorbs the rest.",
            "level10": "Absorbs 2772 physical damage for a maximum of 96 seconds. Reduces area physical damage by 25% and absorbs the rest.",
            "level11": "Absorbs 3270 physical damage for a maximum of 100 seconds. Reduces area physical damage by 25% and absorbs the rest.",
            "level12": "Absorbs 3840 physical damage for a maximum of 104 seconds. Reduces area physical damage by 25% and absorbs the rest.",
            "level13": "Absorbs 4446 physical damage for a maximum of 108 seconds. Reduces area physical damage by 25% and absorbs the rest.",
            "level14": "Absorbs 5130 physical damage for a maximum of 112 seconds. Reduces area physical damage by 25% and absorbs the rest.",
            "level15": "Absorbs 5832 physical damage for a maximum of 116 seconds. Reduces area physical damage by 25% and absorbs the rest.",
            "level16": "Absorbs 6558 physical damage for a maximum of 120 seconds. Reduces area physical damage by 25% and absorbs the rest."
        }
    ],
    "Bless": [
        {
            "level1": "Increases physical attack by 13 and magic attack by 17 for 10 minutes",
            "level2": "Increases physical attack by 16 and magic attack by 21 for 10 minutes",
            "level3": "Increases physical attack by 20 and magic attack by 25 for 10 minutes",
            "level4": "Increases physical attack by 24 and magic attack by 31 for 10 minutes",
            "level5": "Increases physical attack by 28 and magic attack by 37 for 10 minutes",
            "level6": "Increases physical attack by 34 and magic attack by 44 for 10 minutes",
            "level7": "Increases physical attack by 40 and magic attack by 52 for 10 minutes",
            "level8": "Increases physical attack by 48 and magic attack by 61 for 10 minutes",
            "level9": "Increases physical attack by 56 and magic attack by 72 for 10 minutes",
            "level10": "Increases physical attack by 64 and magic attack by 83 for 10 minutes",
            "level11": "Increases physical attack by 74 and magic attack by 96 for 10 minutes",
            "level12": "Increases physical attack by 86 and magic attack by 111 for 10 minutes",
            "level13": "Increases physical attack by 98 and magic attack by 127 for 10 minutes",
            "level14": "Increases physical attack by 111 and magic attack by 143 for 10 minutes",
            "level15": "Increases physical attack by 124 and magic attack by 160 for 10 minutes",
            "level16": "Increases physical attack by 145 and magic attack by 187 for 10 minutes within 20 meter radius of the target. (Mass Bless)"
        }
    ],
    "Rejuvenate": [
        {
            "level1": "Heals self or a friendly target for 79 every 2 seconds. Lasts for 10 seconds",
            "level2": "Heals self or a friendly target for 98 every 2 seconds. Lasts for 10 seconds",
            "level3": "Heals self or a friendly target for 120 every 2 seconds. Lasts for 10 seconds",
            "level4": "Heals self or a friendly target for 146 every 2 seconds. Lasts for 10 seconds",
            "level5": "Heals self or a friendly target for 176 every 2 seconds. Lasts for 10 seconds",
            "level6": "Heals self or a friendly target for 210 every 2 seconds. Lasts for 10 seconds",
            "level7": "Heals self or a friendly target for 252 every 2 seconds. Lasts for 10 seconds",
            "level8": "Heals self or a friendly target for 303 every 2 seconds. Lasts for 10 seconds",
            "level9": "Heals self or a friendly target for 356 every 2 seconds. Lasts for 10 seconds",
            "level10": "Heals self or a friendly target for 416 every 2 seconds. Lasts for 10 seconds",
            "level12": "Heals self or a friendly target for 483 every 2 seconds. Lasts for 10 seconds",
            "level13": "Heals self or a friendly target for 553 every 2 seconds. Lasts for 10 seconds",
            "level14": "Heals self or a friendly target for 630 every 2 seconds. Lasts for 10 seconds",
            "level15": "Heals self or a friendly target for 711 every 2 seconds. Lasts for 10 seconds",
            "level16": "Heals self or a friendly target for 792 every 2 seconds. Lasts for 10 seconds",
            "level17": "Heals self or a friendly target for 880 every 2 seconds. Lasts for 10 seconds"
        }
    ],
    "Resurrect": [
        {
            "level1": "Resurrects a party member with 10% of his/her HP and MP.",
            "level2": "Resurrects a party member with 20% of his/her HP and MP.",
            "level3": "Resurrects a party member with 30% of his/her HP and MP.",
            "level4": "Resurrects a party member with 40% of his/her HP and MP.",
            "level5": "Resurrects a party member with 50% of his/her HP and MP.",
            "level6": "Resurrects a party member with 60% of his/her HP and MP.",
            "level7": "Resurrects a party member with 70% of his/her HP and MP.",
            "level8": "Resurrects a party member with 80% of his/her HP and MP.",
            "level9": "Resurrects a party member with 90% of his/her HP and MP.",
            "level10": "Resurrects a party member with 100% of his/her HP and MP."
        }
    ],
    "Haste": [
        {
            "level1": "Increase target's move speed by 5 for 10 minutes",
            "level2": "Increase target's move speed by 6 for 10 minutes",
            "level3": "Increase target's move speed by 7 for 10 minutes",
            "level4": "Increase target's move speed by 8 for 10 minutes",
            "level5": "Increase target's move speed by 9 for 10 minutes",
            "level6": "Increase target's move speed by 10 for 10 minutes",
            "level7": "Increase target's move speed by 11 for 10 minutes",
            "level8": "Increase target's move speed by 12 for 10 minutes",
            "level9": "Increase target's move speed by 13 for 10 minutes",
            "level10": "Increase target's move speed by 15 for 10 minutes within 20 meter radius of the target. (Mass Haste)"
        }
    ],
    "Holy signet": [
        {
            "level1": "Deals 84 magic damage every 2 seconds to all enemies within 4 meter radius for 12 seconds and causes vulnerbility to holy magic.",
            "level2": "Deals 102 magic damage every 2 seconds to all enemies within 4 meter radius for 12 seconds and causes vulnerbility to holy magic.",
            "level3": "Deals 124 magic damage every 2 seconds to all enemies within 4 meter radius for 12 seconds and causes vulnerbility to holy magic.",
            "level4": "Deals 150 magic damage every 2 seconds to all enemies within 4 meter radius for 12 seconds and causes vulnerbility to holy magic.",
            "level5": "Deals 181 magic damage every 2 seconds to all enemies within 4 meter radius for 12 seconds and causes vulnerbility to holy magic.",
            "level6": "Deals 219 magic damage every 2 seconds to all enemies within 4 meter radius for 12 seconds and causes vulnerbility to holy magic.",
            "level7": "Deals 259 magic damage every 2 seconds to all enemies within 4 meter radius for 12 seconds and causes vulnerbility to holy magic.",
            "level8": "Deals 305 magic damage every 2 seconds to all enemies within 4 meter radius for 12 seconds and causes vulnerbility to holy magic.",
            "level9": "Deals 357 magic damage every 2 seconds to all enemies within 4 meter radius for 12 seconds and causes vulnerbility to holy magic.",
            "level10": "Deals 412 magic damage every 2 seconds to all enemies within 4 meter radius for 12 seconds and causes vulnerbility to holy magic.",
            "level11": "Deals 473 magic damage every 2 seconds to all enemies within 4 meter radius for 12 seconds and causes vulnerbility to holy magic.",
            "level12": "Deals 538 magic damage every 2 seconds to all enemies within 4 meter radius for 12 seconds and causes vulnerbility to holy magic.",
            "level13": "Deals 605 magic damage every 2 seconds to all enemies within 4 meter radius for 12 seconds and causes vulnerbility to holy magic.",
            "level14": "Deals 679 magic damage every 2 seconds to all enemies within 4 meter radius for 12 seconds and causes vulnerbility to holy magic.",
            "level15": "Deals 761 magic damage every 2 seconds to all enemies within 4 meter radius for 12 seconds and causes vulnerbility to holy magic.",
            "level16": "Deals 846 magic damage every 2 seconds to all enemies within 4 meter radius for 12 seconds and causes vulnerbility to holy magic."
        }
    ],
    "Exalt": [
        {
            "level1": "Increases heal amount by 120 and decreases MP required for healing by 10%",
            "level2": "Increases heal amount by 240 and decreases MP required for healing by 12%",
            "level3": "Increases heal amount by 360 and decreases MP required for healing by 14%",
            "level4": "Increases heal amount by 480 and decreases MP required for healing by 16%",
            "level5": "Increases heal amount by 600 and decreases MP required for healing by 18%",
            "level6": "Increases heal amount by 720 and decreases MP required for healing by 20%",
            "level7": "Increases heal amount by 840 and decreases MP required for healing by 22%",
            "level8": "Increases heal amount by 960 and decreases MP required for healing by 24%",
            "level9": "Increases heal amount by 1080 and decreases MP required for healing by 26%",
            "level10": "Increases heal amount by 1200 and decreases MP required for healing by 30%"
        } 
    ],
    "Shroud of Turin": [
        {
            "level1": "Increases buff duration by 2 minutes and decreases the MP required to cast the skill by 10%.",
            "level2": "Increases buff duration by 4 minutes and decreases the MP required to cast the skill by 12%.",
            "level3": "Increases buff duration by 6 minutes and decreases the MP required to cast the skill by 14%.",
            "level4": "Increases buff duration by 8 minutes and decreases the MP required to cast the skill by 16%.",
            "level5": "Increases buff duration by 10 minutes and decreases the MP required to cast the skill by 18%.",
            "level6": "Increases buff duration by 12 minutes and decreases the MP required to cast the skill by 20%.",
            "level7": "Increases buff duration by 14 minutes and decreases the MP required to cast the skill by 22%.",
            "level8": "Increases buff duration by 16 minutes and decreases the MP required to cast the skill by 24%.",
            "level9": "Increases buff duration by 18 minutes and decreases the MP required to cast the skill by 26%.",
            "level10": "Increases buff duration by 20 minutes and decreases the MP required to cast the skill by 30%."
        }
    ],
    "Healing Corona": [
        {
            "level1": "Recovers 441 HP of all party members within 6m radius and creates a shield that absorbs 331 physical damage for 60 seconds.",
            "level2": "Recovers 530 HP of all party members within 6m radius and creates a shield that absorbs 398 physical damage for 60 seconds.",
            "level3": "Recovers 638 HP of all party members within 6m radius and creates a shield that absorbs 479 physical damage for 60 seconds.",
            "level4": "Recovers 764 HP of all party members within 6m radius and creates a shield that absorbs 573 physical damage for 60 seconds.",
            "level5": "Recovers 900 HP of all party members within 6m radius and creates a shield that absorbs 675 physical damage for 60 seconds.",
            "level6": "Recovers 1053 HP of all party members within 6m radius and creates a shield that absorbs 790 physical damage for 60 seconds.",
            "level7": "Recovers 1229 HP of all party members within 6m radius and creates a shield that absorbs 922 physical damage for 60 seconds.",
            "level8": "Recovers 1407 HP of all party members within 6m radius and creates a shield that absorbs 1055 physical damage for 60 seconds.",
            "level9": "Recovers 1613 HP of all party members within 6m radius and creates a shield that absorbs 1209 physical damage for 60 seconds.",
            "level10": "Recovers 1820 HP of all party members within 6m radius and creates a shield that absorbs 1364 physical damage for 60 seconds.",
            "level11": "Recovers 2027 HP of all party members within 6m radius and creates a shield that absorbs 1520 physical damage for 60 seconds.",
            "level12": "Recovers 2256 HP of all party members within 6m radius and creates a shield that absorbs 1692 physical damage for 60 seconds.",
            "level13": "Recovers 2510 HP of all party members within 6m radius and creates a shield that absorbs 1883 physical damage for 60 seconds.",
            "level14": "Recovers 2766 HP of all party members within 6m radius and creates a shield that absorbs 2075 physical damage for 60 seconds.",
            "level15": "Recovers 3039 HP of all party members within 6m radius and creates a shield that absorbs 2279 physical damage for 60 seconds.",
            "level16": "Recovers 3339 HP of all party members within 6m radius and creates a shield that absorbs 2504 physical damage for 60 seconds."
        }
    ],
    "Holy Tempest": [
        {
            "level1": "Inflicts 284 magic damage on all enemies within 4 meters of the target. Deals 150% damage to demons and undead.",
            "level2": "Inflicts 334 magic damage on all enemies within 4 meters of the target. Deals 150% damage to demons and undead.",
            "level3": "Inflicts 416 magic damage on all enemies within 4 meters of the target. Deals 150% damage to demons and undead.",
            "level4": "Inflicts 504 magic damage on all enemies within 4 meters of the target. Deals 150% damage to demons and undead.",
            "level5": "Inflicts 596 magic damage on all enemies within 4 meters of the target. Deals 150% damage to demons and undead.",
            "level6": "Inflicts 702 magic damage on all enemies within 4 meters of the target. Deals 150% damage to demons and undead.",
            "level7": "Inflicts 820 magic damage on all enemies within 4 meters of the target. Deals 150% damage to demons and undead.",
            "level8": "Inflicts 948 magic damage on all enemies within 4 meters of the target. Deals 150% damage to demons and undead.",
            "level9": "Inflicts 1088 magic damage on all enemies within 4 meters of the target. Deals 150% damage to demons and undead.",
            "level10": "Inflicts 1236 magic damage on all enemies within 4 meters of the target. Deals 150% damage to demons and undead.",
            "level11": "Inflicts 1390 magic damage on all enemies within 4 meters of the target. Deals 150% damage to demons and undead.",
            "level12": "Inflicts 1562 magic damage on all enemies within 4 meters of the target. Deals 150% damage to demons and undead.",
            "level13": "Inflicts 1750 magic damage on all enemies within 4 meters of the target. Deals 150% damage to demons and undead.",
            "level14": "Inflicts 1944 magic damage on all enemies within 4 meters of the target. Deals 150% damage to demons and undead.",
            "level15": "Inflicts 2160 magic damage on all enemies within 4 meters of the target. Deals 150% damage to demons and undead.",
            "level16": "Inflicts 2398 magic damage on all enemies within 4 meters of the target. Deals 150% damage to demons and undead."
        }
    ],
    "Rapture": [
        {
            "level1": "Recovers the mana of all party members in a 6 meters radius by 217 per second for 10 seconds.",
            "level2": "Recovers the mana of all party members in a 6 meters radius by 260 per second for 10 seconds.",
            "level3": "Recovers the mana of all party members in a 6 meters radius by 316 per second for 10 seconds.",
            "level4": "Recovers the mana of all party members in a 6 meters radius by 380 per second for 10 seconds.",
            "level5": "Recovers the mana of all party members in a 6 meters radius by 450 per second for 10 seconds.",
            "level6": "Recovers the mana of all party members in a 6 meters radius by 530 per second for 10 seconds.",
            "level7": "Recovers the mana of all party members in a 6 meters radius by 613 per second for 10 seconds.",
            "level8": "Recovers the mana of all party members in a 6 meters radius by 704 per second for 10 seconds.",
            "level9": "Recovers the mana of all party members in a 6 meters radius by 802 per second for 10 seconds.",
            "level10": "Recovers the mana of all party members in a 6 meters radius by 905 per second for 10 seconds.",
            "level11": "Recovers the mana of all party members in a 6 meters radius by 1012 per second for 10 seconds.",
            "level12": "Recovers the mana of all party members in a 6 meters radius by 1125 per second for 10 seconds.",
            "level13": "Recovers the mana of all party members in a 6 meters radius by 1250 per second for 10 seconds.",
            "level14": "Recovers the mana of all party members in a 6 meters radius by 1386 per second for 10 seconds.",
            "level15": "Recovers the mana of all party members in a 6 meters radius by 1524 per second for 10 seconds.",
            "level16": "Recovers the mana of all party members in a 6 meters radius by 1763 per second for 10 seconds."
        }
    ],
    "Holy Intervention": [
        {
            "level1": "Activates when the caster's HP drops below 50% or after 1 minute to recover HP by 663.",
            "level2": "Activates when the caster's HP drops below 50% or after 1 minute to recover HP by 797.",
            "level3": "Activates when the caster's HP drops below 50% or after 1 minute to recover HP by 936.",
            "level4": "Activates when the caster's HP drops below 50% or after 1 minute to recover HP by 1094.",
            "level5": "Activates when the caster's HP drops below 50% or after 1 minute to recover HP by 1272.",
            "level6": "Activates when the caster's HP drops below 50% or after 1 minute to recover HP by 1457.",
            "level7": "Activates when the caster's HP drops below 50% or after 1 minute to recover HP by 1659.",
            "level8": "Activates when the caster's HP drops below 50% or after 1 minute to recover HP by 1871.",
            "level9": "Activates when the caster's HP drops below 50% or after 1 minute to recover HP by 2084.",
            "level10": "Activates when the caster's HP drops below 50% or after 1 minute to recover HP by 2315.",
            "level11": "Activates when the caster's HP drops below 50% or after 1 minute to recover HP by 2570.",
            "level12": "Activates when the caster's HP drops below 50% or after 1 minute to recover HP by 2831.",
            "level13": "Activates when the caster's HP drops below 50% or after 1 minute to recover HP by 3111.",
            "level14": "Activates when the caster's HP drops below 50% or after 1 minute to recover HP by 3419.",
            "level15": "Activates when the caster's HP drops below 50% or after 1 minute to recover HP by 3755.",
            "level16": "Activates when the caster's HP drops below 50% or after 1 minute to recover HP by 4124."
        }
    ],
    "Desperate Prayer": [
        {
            "level1": "Immune to all attacks for 3 seconds but cannot use skills.",
            "level2": "Immune to all attacks for 3 seconds but cannot use skills.",
            "level3": "Immune to all attacks for 3 seconds but cannot use skills.",
            "level4": "Immune to all attacks for 4 seconds but cannot use skills.",
            "level5": "Immune to all attacks for 4 seconds but cannot use skills.",
            "level6": "Immune to all attacks for 4 seconds but cannot use skills.",
            "level7": "Immune to all attacks for 5 seconds but cannot use skills.",
            "level8": "Immune to all attacks for 5 seconds but cannot use skills.",
            "level9": "Immune to all attacks for 5 seconds but cannot use skills.",
            "level10": "Immune to all attacks for 6 seconds but cannot use skills."
        }
    ],
    "Castigation": [
        {
            "level1": "Cancels enemy's helpful spells up to 2 and each cancelled spell inflicts 360 magic damage.",
            "level2": "Cancels enemy's helpful spells up to 2 and each cancelled spell inflicts 428 magic damage.",
            "level3": "Cancels enemy's helpful spells up to 2 and each cancelled spell inflicts 511 magic damage.",
            "level4": "Cancels enemy's helpful spells up to 3 and each cancelled spell inflicts 593 magic damage.",
            "level5": "Cancels enemy's helpful spells up to 3 and each cancelled spell inflicts 825 magic damage.",
            "level6": "Cancels enemy's helpful spells up to 3 and each cancelled spell inflicts 1056 magic damage.",
            "level7": "Cancels enemy's helpful spells up to 4 and each cancelled spell inflicts 1160 magic damage.",
            "level8": "Cancels enemy's helpful spells up to 4 and each cancelled spell inflicts 1264 magic damage.",
            "level9": "Cancels enemy's helpful spells up to 4 and each cancelled spell inflicts 1399 magic damage.",
            "level10": "Cancels enemy's helpful spells up to 5 and each cancelled spell inflicts 1534 magic damage."
        }
    ],
    "Archangel's Light": [
        {
            "level1": "Charges weapon to deal 10% additional damage for 10 min to demons and undead.",
            "level2": "Charges weapon to deal 12% additional damage for 10 min to demons and undead.",
            "level3": "Charges weapon to deal 14% additional damage for 10 min to demons and undead.",
            "level4": "Charges weapon to deal 16% additional damage for 10 min to demons and undead.",
            "level5": "Charges weapon to deal 18% additional damage for 10 min to demons and undead.",
            "level6": "Charges weapon to deal 20% additional damage for 10 min to demons and undead.",
            "level7": "Charges weapon to deal 22% additional damage for 10 min to demons and undead.",
            "level8": "Charges weapon to deal 24% additional damage for 10 min to demons and undead.",
            "level9": "Charges weapon to deal 26% additional damage for 10 min to demons and undead.",
            "level10": "Charges target's weapon within 20 meter radius to deal 30% additional damage for 10 min to demons and undead (Mass Archangel's Light)."
        }
    ],
    "Revelation": [
        {
            "level1": "Recovers 1737 HP of the skill user or any ally while cancelling all cursed spell diseases.",
            "level2": "Recovers 2028 HP of the skill user or any ally while cancelling all cursed spell diseases.",
            "level3": "Recovers 2367 HP of the skill user or any ally while cancelling all cursed spell diseases.",
            "level4": "Recovers 2721 HP of the skill user or any ally while cancelling all cursed spell diseases.",
            "level5": "Recovers 3117 HP of the skill user or any ally while cancelling all cursed spell diseases.",
            "level6": "Recovers 3519 HP of the skill user or any ally while cancelling all cursed spell diseases.",
            "level7": "Recovers 3948 HP of the skill user or any ally while cancelling all cursed spell diseases.",
            "level8": "Recovers 4389 HP of the skill user or any ally while cancelling all cursed spell diseases.",
            "level9": "Recovers 4887 HP of the skill user or any ally while cancelling all cursed spell diseases.",
            "level10": "Recovers 5403 HP of the skill user or any ally while cancelling all cursed spell diseases.",
            "level12": "Recovers 5937 HP of the skill user or any ally while cancelling all cursed spell diseases.",
            "level13": "Recovers 6522 HP of the skill user or any ally while cancelling all cursed spell diseases.",
            "level14": "Recovers 7149 HP of the skill user or any ally while cancelling all cursed spell diseases.",
            "level15": "Recovers 7791 HP of the skill user or any ally while cancelling all cursed spell diseases.",
            "level16": "Recovers 8499 HP of the skill user or any ally while cancelling all cursed spell diseases.",
            "level17": "Recovers 9210 HP of the skill user or any ally while cancelling all cursed spell diseases."
        }
    ],
    "Archangel's Blade": [
        {
            "level1": "Increases target's critical rate by 2 and critical damage by 10% for 10 minutes.",
            "level2": "Increases target's critical rate by 4 and critical damage by 12% for 10 minutes.",
            "level3": "Increases target's critical rate by 6 and critical damage by 14% for 10 minutes.",
            "level4": "Increases target's critical rate by 8 and critical damage by 16% for 10 minutes.",
            "level5": "Increases target's critical rate by 10 and critical damage by 18% for 10 minutes.",
            "level6": "Increases target's critical rate by 12 and critical damage by 20% for 10 minutes.",
            "level7": "Increases target's critical rate by 14 and critical damage by 22% for 10 minutes.",
            "level8": "Increases target's critical rate by 16 and critical damage by 24% for 10 minutes.",
            "level9": "Increases target's critical rate by 18 and critical damage by 26% for 10 minutes.",
            "level10": "Increases critical rate of targets in range by 20 and critical damage by 30% for 10 minutes. (Mass Archangel's Blade)"
        }
    ],
    "Iron Will": [
        {
            "level1": "Increases chance to resist stun and shock effects by 5% and 3% respectively",
            "level2": "Increases chance to resist stun and shock effects by 10% and 6% respectively",
            "level3": "Increases chance to resist stun and shock effects by 15% and 9% respectively",
            "level4": "Increases chance to resist stun and shock effects by 20% and 12% respectively",
            "level5": "Increases chance to resist stun and shock effects by 25% and 15% respectively",
            "level6": "Increases chance to resist stun and shock effects by 30% and 18% respectively",
            "level7": "Increases chance to resist stun and shock effects by 35% and 21% respectively",
            "level8": "Increases chance to resist stun and shock effects by 40% and 24% respectively",
            "level9": "Increases chance to resist stun and shock effects by 45% and 27% respectively",
            "level10": "Increases chance to resist stun and shock effects by 50% and 30% respectively"
        }
    ],
    "Aika's Grace": [
        {
            "level1": "Recovers the HP and MP of the target by 5750 and makes the target immune to all attacks for 5 seconds",
            "level2": "Recovers the HP and MP of the target by 6410 and makes the target immune to all attacks for 5 seconds",
            "level3": "Recovers the HP and MP of the target by 7130 and makes the target immune to all attacks for 6 seconds",
            "level4": "Recovers the HP and MP of the target by 7930 and makes the target immune to all attacks for 6 seconds",
            "level5": "Recovers the HP and MP of the target by 8795 and makes the target immune to all attacks for 7 seconds",
            "level6": "Recovers the HP and MP of the target by 9660 and makes the target immune to all attacks for 7 seconds",
            "level7": "Recovers the HP and MP of the target by 10620 and makes the target immune to all attacks for 8 seconds",
            "level8": "Recovers the HP and MP of the target by 11670 and makes the target immune to all attacks for 8 seconds",
            "level9": "Recovers the HP and MP of the target by 12815 and makes the target immune to all attacks for 9 seconds",
            "level10": "Recovers the HP and MP of the target by 14070 and makes the target immune to all attacks for 9 seconds",
            "level11": "Recovers the HP and MP of the target by 15450 and makes the target immune to all attacks for 10 seconds"
        }
    ],
    "Holy Shield": [
        {
            "level1": "Absorbs 4194 magic damage and reduces magical area damage taken by the party by 25%. Lasts 1 minute.",
            "level2": "Absorbs 4716 magic damage and reduces magical area damage taken by the party by 25%. Lasts 1 minute.",
            "level3": "Absorbs 5304 magic damage and reduces magical area damage taken by the party by 25%. Lasts 1 minute.",
            "level4": "Absorbs 5964 magic damage and reduces magical area damage taken by the party by 25%. Lasts 1 minute.",
            "level5": "Absorbs 6642 magic damage and reduces magical area damage taken by the party by 25%. Lasts 1 minute.",
            "level6": "Absorbs 7374 magic damage and reduces magical area damage taken by the party by 25%. Lasts 1 minute.",
            "level7": "Absorbs 8190 magic damage and reduces magical area damage taken by the party by 25%. Lasts 1 minute.",
            "level8": "Absorbs 9096 magic damage and reduces magical area damage taken by the party by 25%. Lasts 1 minute.",
            "level9": "Absorbs 10104 magic damage and reduces magical area damage taken by the party by 25%. Lasts 1 minute.",
            "level10": "Absorbs 11226 magic damage and reduces magical area damage taken by the party by 25%. Lasts 1 minute."
        }
    ],
    "Penance": [
        {
            "level1": "Increases healing done by spells within 1 second or greater cast time by 20%",
            "level2": "Increases healing done by spells within 1 second or greater cast time by 23%",
            "level3": "Increases healing done by spells within 1 second or greater cast time by 26%",
            "level4": "Increases healing done by spells within 1 second or greater cast time by 29%",
            "level5": "Increases healing done by spells within 1 second or greater cast time by 32%",
            "level6": "Increases healing done by spells within 1 second or greater cast time by 35%",
            "level7": "Increases healing done by spells within 1 second or greater cast time by 38%",
            "level8": "Increases healing done by spells within 1 second or greater cast time by 41%",
            "level9": "Increases healing done by spells within 1 second or greater cast time by 44%",
            "level10": "Increases healing done by spells within 1 second or greater cast time by 50%"
        }
    ],
    "Divine Sermon": [
        {
            "level1": "Recovers HP of party members within 10 meter radius by 752 every second for 10 seconds. Also removes one harmful effect.",
            "level2": "Recovers HP of party members within 10 meter radius by 836 every second for 10 seconds. Also removes one harmful effect.",
            "level3": "Recovers HP of party members within 10 meter radius by 922 every second for 10 seconds. Also removes one harmful effect.",
            "level4": "Recovers HP of party members within 10 meter radius by 1013 every second for 10 seconds. Also removes one harmful effect.",
            "level5": "Recovers HP of party members within 10 meter radius by 1113 every second for 10 seconds. Also removes one harmful effect.",
            "level6": "Recovers HP of party members within 10 meter radius by 1222 every second for 10 seconds. Also removes one harmful effect.",
            "level7": "Recovers HP of party members within 10 meter radius by 1342 every second for 10 seconds. Also removes one harmful effect.",
            "level8": "Recovers HP of party members within 10 meter radius by 1474 every second for 10 seconds. Also removes one harmful effect.",
            "level9": "Recovers HP of party members within 10 meter radius by 1545 every second for 10 seconds. Also removes one harmful effect."
        }
    ],
    "Exorcism": [
        {
            "level1": "Deals 1874 Magic Attack and decreases Physical/Magic attack by 28% for 10 secs. Deals Additional 150% damage to demon and undead.",
            "level2": "Deals 2100 Magic Attack and decreases Physical/Magic attack by 31% for 10 secs. Deals Additional 150% damage to demon and undead.",
            "level3": "Deals 2333 Magic Attack and decreases Physical/Magic attack by 34% for 10 secs. Deals Additional 150% damage to demon and undead.",
            "level4": "Deals 2592 Magic Attack and decreases Physical/Magic attack by 37% for 10 secs. Deals Additional 150% damage to demon and undead.",
            "level5": "Deals 2878 Magic Attack and decreases Physical/Magic attack by 40% for 10 secs. Deals Additional 150% damage to demon and undead.",
            "level6": "Deals 3197 Magic Attack and decreases Physical/Magic attack by 43% for 10 secs. Deals Additional 150% damage to demon and undead.",
            "level7": "Deals 3550 Magic Attack and decreases Physical/Magic attack by 46% for 10 secs. Deals Additional 150% damage to demon and undead.",
            "level8": "Deals 3941 Magic Attack and decreases Physical/Magic attack by 50% for 10 secs. Deals Additional 150% damage to demon and undead."
        }
    ],
    "Holy Water": [
        {
            "level1": "Creates LVL 1 Holy Water in the inventory. Only one can be stored.",
            "level2": "Creates LVL 2 Holy Water in the inventory. Only one can be stored.",
            "level3": "Creates LVL 3 Holy Water in the inventory. Only one can be stored.",
            "level4": "Creates LVL 4 Holy Water in the inventory. Only one can be stored.",
            "level5": "Creates LVL 5 Holy Water in the inventory. Only one can be stored.",
            "level6": "Creates LVL 6 Holy Water in the inventory. Only one can be stored.",
            "level7": "Creates LVL 7 Holy Water in the inventory. Only one can be stored."
        }
    ],
    "Glory's Flowers": [
        {
            "level1": "Generates holy flower on all party members within 20 M radius of the selected area and recovers 580 HP for 10 seconds. Increases healing effect by 20%.",
            "level2": "Generates holy flower on all party members within 20 M radius of the selected area and recovers 637 HP for 10 seconds. Increases healing effect by 22%.",
            "level3": "Generates holy flower on all party members within 20 M radius of the selected area and recovers 700 HP for 10 seconds. Increases healing effect by 24%.",
            "level4": "Generates holy flower on all party members within 20 M radius of the selected area and recovers 769 HP for 10 seconds. Increases healing effect by 26%.",
            "level5": "Generates holy flower on all party members within 20 M radius of the selected area and recovers 844 HP for 10 seconds. Increases healing effect by 28%.",
            "level6": "Generates holy flower on all party members within 20 M radius of the selected area and recovers 927 HP for 10 seconds. Increases healing effect by 30%."
        }
    ],
    "Enchanced Cure": [
        {
            "level1": "Recovers 2026 HP of the skill user or an ally.[Cure][Healing Corona][Revelation][Aika's Grace][Divine Sermon], that are applied to a recovered target in 6 seconds, heals extra HP equaivalent to 6% of Max HP.",
            "level2": "Recovers 2226 HP of the skill user or an ally.[Cure][Healing Corona][Revelation][Aika's Grace][Divine Sermon], that are applied to a recovered target in 6 seconds, heals extra HP equaivalent to 7% of Max HP.",
            "level3": "Recovers 2445 HP of the skill user or an ally.[Cure][Healing Corona][Revelation][Aika's Grace][Divine Sermon], that are applied to a recovered target in 6 seconds, heals extra HP equaivalent to 8% of Max HP.",
            "level4": "Recovers 2685 HP of the skill user or an ally.[Cure][Healing Corona][Revelation][Aika's Grace][Divine Sermon], that are applied to a recovered target in 6 seconds, heals extra HP equaivalent to 9% of Max HP.",
            "level5": "Recovers 2949 HP of the skill user or an ally.[Cure][Healing Corona][Revelation][Aika's Grace][Divine Sermon], that are applied to a recovered target in 6 seconds, heals extra HP equaivalent to 10% of Max HP.",
            "level6": "Recovers 3090 HP of the skill user or an ally.[Cure][Healing Corona][Revelation][Aika's Grace][Divine Sermon], that are applied to a recovered target in 6 seconds, heals extra HP equaivalent to 11% of Max HP."
        }
    ],
    "Soul Gem": [
        {
            "level1": "A wish contracts the target's soul into a gem for 300 seconds. A second after death, they are revived with 30% HP and MP and are invulnarable for 5 seconds.",
            "level2": "A wish contracts the target's soul into a gem for 300 seconds. A second after death, they are revived with 35% HP and MP and are invulnarable for 5 seconds.",
            "level3": "A wish contracts the target's soul into a gem for 300 seconds. A second after death, they are revived with 40% HP and MP and are invulnarable for 5 seconds.",
            "level4": "A wish contracts the target's soul into a gem for 300 seconds. A second after death, they are revived with 45% HP and MP and are invulnarable for 5 seconds.",
            "level5": "A wish contracts the target's soul into a gem for 300 seconds. A second after death, they are revived with 50% HP and MP and are invulnarable for 5 seconds."
        }
    ],
    "Mereiful Eden": [
        {
            "level1": "Purify the area with sacred light to mercifully deal 1011 magical damage up to 5 times within a 6m radius. Each hit purifies buffs of enemies and deals 632 damage each by using the power of kidness.",
            "level2": "Purify the area with sacred light to mercifully deal 1122 magical damage up to 5 times within a 6m radius. Each hit purifies buffs of enemies and deals 702 damage each by using the power of kidness.",
            "level3": "Purify the area with sacred light to mercifully deal 1246 magical damage up to 5 times within a 6m radius. Each hit purifies buffs of enemies and deals 779 damage each by using the power of kidness.",
            "level4": "Purify the area with sacred light to mercifully deal 1324 magical damage up to 5 times within a 6m radius. Each hit purifies buffs of enemies and deals 821 damage each by using the power of kidness."
        }
    ],
    "Dixit Dominus": [
        {
            "level1": "With concentrated divine power, inflicts 3550 magical damage on enemies within 4m and stuns them for 1 second. Inflicts 300% damage on Demon and Undead.",
            "level2": "With concentrated divine power, inflicts 3941 magical damage on enemies within 4m and stuns them for 1 second. Inflicts 300% damage on Demon and Undead."
        }
    ],
    "Countdown": [
        {
            "level1": "Shoots a special bullet that explodes in the enemy's body. The bullet inflicts 10 physical damaga and after 3 seconds, adds 51 extra damage to surroundings upon exploding.",
            "level2": "Shoots a special bullet that explodes in the enemy's body. The bullet inflicts 13 physical damaga and after 3 seconds, adds 66 extra damage to surroundings upon exploding.",
            "level3": "Shoots a special bullet that explodes in the enemy's body. The bullet inflicts 17 physical damaga and after 3 seconds, adds 88 extra damage to surroundings upon exploding.",
            "level4": "Shoots a special bullet that explodes in the enemy's body. The bullet inflicts 22 physical damaga and after 3 seconds, adds 111 extra damage to surroundings upon exploding.",
            "level5": "Shoots a special bullet that explodes in the enemy's body. The bullet inflicts 28 physical damaga and after 3 seconds, adds 138 extra damage to surroundings upon exploding.",
            "level6": "Shoots a special bullet that explodes in the enemy's body. The bullet inflicts 35 physical damaga and after 3 seconds, adds 173 extra damage to surroundings upon exploding.",
            "level7": "Shoots a special bullet that explodes in the enemy's body. The bullet inflicts 42 physical damaga and after 3 seconds, adds 210 extra damage to surroundings upon exploding.",
            "level8": "Shoots a special bullet that explodes in the enemy's body. The bullet inflicts 51 physical damaga and after 3 seconds, adds 253 extra damage to surroundings upon exploding.",
            "level9": "Shoots a special bullet that explodes in the enemy's body. The bullet inflicts 62 physical damaga and after 3 seconds, adds 309 extra damage to surroundings upon exploding.",
            "level10": "Shoots a special bullet that explodes in the enemy's body. The bullet inflicts 75 physical damaga and after 3 seconds, adds 375 extra damage to surroundings upon exploding.",
            "level11": "Shoots a special bullet that explodes in the enemy's body. The bullet inflicts 90 physical damaga and after 3 seconds, adds 451 extra damage to surroundings upon exploding.",
            "level12": "Shoots a special bullet that explodes in the enemy's body. The bullet inflicts 107 physical damaga and after 3 seconds, adds 533 extra damage to surroundings upon exploding.",
            "level13": "Shoots a special bullet that explodes in the enemy's body. The bullet inflicts 126 physical damaga and after 3 seconds, adds 628 extra damage to surroundings upon exploding.",
            "level14": "Shoots a special bullet that explodes in the enemy's body. The bullet inflicts 146 physical damaga and after 3 seconds, adds 729 extra damage to surroundings upon exploding.",
            "level15": "Shoots a special bullet that explodes in the enemy's body. The bullet inflicts 169 physical damaga and after 3 seconds, adds 844 extra damage to surroundings upon exploding.",
            "level16": "Shoots a special bullet that explodes in the enemy's body. The bullet inflicts 194 physical damaga and after 3 seconds, adds 969 extra damage to surroundings upon exploding."
        }
    ]
    ,"Rupture": [
        {
            "level1": "Inflicts 47 physical damage on an enemy and by exposing its weaknesses, decreases Physical DEF by 57 and abnormal states RES by 10 for 20 seconds.",
            "level2": "Inflicts 63 physical damage on an enemy and by exposing its weaknesses, decreases Physical DEF by 77 and abnormal states RES by 12 for 20 seconds.",
            "level3": "Inflicts 79 physical damage on an enemy and by exposing its weaknesses, decreases Physical DEF by 98 and abnormal states RES by 14 for 20 seconds.",
            "level4": "Inflicts 98 physical damage on an enemy and by exposing its weaknesses, decreases Physical DEF by 121 and abnormal states RES by 16 for 20 seconds.",
            "level5": "Inflicts 123 physical damage on an enemy and by exposing its weaknesses, decreases Physical DEF by 155 and abnormal states RES by 18 for 20 seconds.",
            "level6": "Inflicts 150 physical damage on an enemy and by exposing its weaknesses, decreases Physical DEF by 193 and abnormal states RES by 20 for 20 seconds.",
            "level7": "Inflicts 181 physical damage on an enemy and by exposing its weaknesses, decreases Physical DEF by 233 and abnormal states RES by 22 for 20 seconds.",
            "level8": "Inflicts 221 physical damage on an enemy and by exposing its weaknesses, decreases Physical DEF by 283 and abnormal states RES by 24 for 20 seconds.",
            "level9": "Inflicts 268 physical damage on an enemy and by exposing its weaknesses, decreases Physical DEF by 343 and abnormal states RES by 26 for 20 seconds.",
            "level10": "Inflicts 322 physical damage on an enemy and by exposing its weaknesses, decreases Physical DEF by 413 and abnormal states RES by 28 for 20 seconds.",
            "level11": "Inflicts 381 physical damage on an enemy and by exposing its weaknesses, decreases Physical DEF by 487 and abnormal states RES by 30 for 20 seconds.",
            "level12": "Inflicts 448 physical damage on an enemy and by exposing its weaknesses, decreases Physical DEF by 575 and abnormal states RES by 32 for 20 seconds.",
            "level13": "Inflicts 520 physical damage on an enemy and by exposing its weaknesses, decreases Physical DEF by 685 and abnormal states RES by 34 for 20 seconds.",
            "level14": "Inflicts 603 physical damage on an enemy and by exposing its weaknesses, decreases Physical DEF by 802 and abnormal states RES by 36 for 20 seconds.",
            "level15": "Inflicts 692 physical damage on an enemy and by exposing its weaknesses, decreases Physical DEF by 923 and abnormal states RES by 38 for 20 seconds.",
            "level16": "Inflicts 778 physical damage on an enemy and by exposing its weaknesses, decreases Physical DEF by 1051 and abnormal states RES by 40 for 20 seconds."
        }
    ],
    "Hollow Point": [
        {
            "level1": "Fires an aimed shot to inflict 154 physical damage. Critical rate increases by 25.",
            "level2": "Fires an aimed shot to inflict 200 physical damage. Critical rate increases by 27.",
            "level3": "Fires an aimed shot to inflict 250 physical damage. Critical rate increases by 29.",
            "level4": "Fires an aimed shot to inflict 313 physical damage. Critical rate increases by 31.",
            "level5": "Fires an aimed shot to inflict 388 physical damage. Critical rate increases by 33.",
            "level6": "Fires an aimed shot to inflict 467 physical damage. Critical rate increases by 35.",
            "level7": "Fires an aimed shot to inflict 567 physical damage. Critical rate increases by 37.",
            "level8": "Fires an aimed shot to inflict 688 physical damage. Critical rate increases by 39.",
            "level9": "Fires an aimed shot to inflict 833 physical damage. Critical rate increases by 41.",
            "level10": "Fires an aimed shot to inflict 992 physical damage. Critical rate increases by 43.",
            "level11": "Fires an aimed shot to inflict 1167 physical damage. Critical rate increases by 45.",
            "level12": "Fires an aimed shot to inflict 1371 physical damage. Critical rate increases by 47.",
            "level13": "Fires an aimed shot to inflict 1588 physical damage. Critical rate increases by 49.",
            "level14": "Fires an aimed shot to inflict 1834 physical damage. Critical rate increases by 51.",
            "level15": "Fires an aimed shot to inflict 2084 physical damage. Critical rate increases by 53.",
            "level16": "Fires an aimed shot to inflict 2342 physical damage. Critical rate increases by 55."
        }
    ]
    ,"Leg Shot": [
        {
            "level1": "Deals 65 Physical damage and reduces target's movement speed by 15 for 10 seconds.",
            "level2": "Deals 81 Physical damage and reduces target's movement speed by 18 for 11 seconds.",
            "level3": "Deals 101 Physical damage and reduces target's movement speed by 21 for 12 seconds.",
            "level4": "Deals 126 Physical damage and reduces target's movement speed by 24 for 13 seconds.",
            "level5": "Deals 153 Physical damage and reduces target's movement speed by 27 for 14 seconds.",
            "level6": "Deals 185 Physical damage and reduces target's movement speed by 30 for 15 seconds.",
            "level7": "Deals 225 Physical damage and reduces target's movement speed by 33 for 16 seconds.",
            "level8": "Deals 273 Physical damage and reduces target's movement speed by 36 for 17 seconds.",
            "level9": "Deals 329 Physical damage and reduces target's movement speed by 39 for 18 seconds.",
            "level10": "Deals 389 Physical damage and reduces target's movement speed by 42 for 20 seconds."
        }
    ]
    ,"riflemanStealth": [
        {
            "level1": "Hides for 30 sec to reset threat rate and decreases move speed by 20.",
            "level2": "Hides for 33 sec to reset threat rate and decreases move speed by 15.",
            "level3": "Hides for 36 sec to reset threat rate and decreases move speed by 10.",
            "level4": "Hides for 39 sec to reset threat rate and decreases move speed by 5.",
            "level5": "Hides for 42 sec to reset threat rate.",
            "level6": "Hides for 45 sec to reset threat rate and increases move speed by 2.",
            "level7": "Hides for 48 sec to reset threat rate and increases move speed by 4.",
            "level8": "Hides for 51 sec to reset threat rate and increases move speed by 6.",
            "level9": "Hides for 54 sec to reset threat rate and increases move speed by 8.",
            "level10": "Hides for 60 sec to reset threat rate and increases move speed by 10."
        }
    ],
    "Hawk Eye": [
        {
            "level1": "Increases skill attack by 57 and skill success rate by 5% for all skills with a cast time of more than once second. Lasts for 10 minutes.",
            "level2": "Increases skill attack by 71 and skill success rate by 8% for all skills with a cast time of more than once second. Lasts for 10 minutes.",
            "level3": "Increases skill attack by 89 and skill success rate by 11% for all skills with a cast time of more than once second. Lasts for 10 minutes.",
            "level4": "Increases skill attack by 109 and skill success rate by 14% for all skills with a cast time of more than once second. Lasts for 10 minutes.",
            "level5": "Increases skill attack by 131 and skill success rate by 17% for all skills with a cast time of more than once second. Lasts for 10 minutes.",
            "level6": "Increases skill attack by 160 and skill success rate by 20% for all skills with a cast time of more than once second. Lasts for 10 minutes6.",
            "level7": "Increases skill attack by 194 and skill success rate by 23% for all skills with a cast time of more than once second. Lasts for 10 minutes.",
            "level8": "Increases skill attack by 233 and skill success rate by 26% for all skills with a cast time of more than once second. Lasts for 10 minutes.",
            "level9": "Increases skill attack by 276 and skill success rate by 29% for all skills with a cast time of more than once second. Lasts for 10 minutes.",
            "level10": "Increases skill attack by 325 and skill success rate by 32% for all skills with a cast time of more than once second. Lasts for 10 minutes.",
            "level11": "Increases skill attack by 377 and skill success rate by 35% for all skills with a cast time of more than once second. Lasts for 10 minutes.",
            "level12": "Increases skill attack by 436 and skill success rate by 38% for all skills with a cast time of more than once second. Lasts for 10 minutes.",
            "level13": "Increases skill attack by 498 and skill success rate by 41% for all skills with a cast time of more than once second. Lasts for 10 minutes.",
            "level14": "Increases skill attack by 563 and skill success rate by 44% for all skills with a cast time of more than once second. Lasts for 10 minutes.",
            "level15": "Increases skill attack by 633 and skill success rate by 47% for all skills with a cast time of more than once second. Lasts for 10 minutes.",
            "level16": "Increases skill attack by 712 and skill success rate by 50% for all skills with a cast time of more than once second. Lasts for 10 minutes."
        }
    ],
    "Crimson Bullet": [
        {
            "level1": "Makes an enemy bleed for 6 seconds, inflicts 66 physical damage per sec and decreases healing ability by 50%.",
            "level2": "Makes an enemy bleed for 6 seconds, inflicts 81 physical damage per sec and decreases healing ability by 52%.",
            "level3": "Makes an enemy bleed for 6 seconds, inflicts 98 physical damage per sec and decreases healing ability by 54%.",
            "level4": "Makes an enemy bleed for 6 seconds, inflicts 120 physical damage per sec and decreases healing ability by 56%.",
            "level5": "Makes an enemy bleed for 6 seconds, inflicts 145 physical damage per sec and decreases healing ability by 58%.",
            "level6": "Makes an enemy bleed for 6 seconds, inflicts 176 physical damage per sec and decreases healing ability by 60%.",
            "level7": "Makes an enemy bleed for 6 seconds, inflicts 210 physical damage per sec and decreases healing ability by 62%.",
            "level8": "Makes an enemy bleed for 6 seconds, inflicts 247 physical damage per sec and decreases healing ability by 64%.",
            "level9": "Makes an enemy bleed for 6 seconds, inflicts 292 physical damage per sec and decreases healing ability by 66%. This skill uses a special bullet that doesen't allow any spell to cancel the effects.",
            "level10": "Makes an enemy bleed for 6 seconds, inflicts 338 physical damage per sec and decreases healing ability by 68%. This skill uses a special bullet that doesen't allow any spell to cancel the effects.",
            "level11": "Makes an enemy bleed for 6 seconds, inflicts 391 physical damage per sec and decreases healing ability by 70%. This skill uses a special bullet that doesen't allow any spell to cancel the effects.",
            "level12": "Makes an enemy bleed for 6 seconds, inflicts 446 physical damage per sec and decreases healing ability by 72%. This skill uses a special bullet that doesen't allow any spell to cancel the effects.",
            "level13": "Makes an enemy bleed for 6 seconds, inflicts 502 physical damage per sec and decreases healing ability by 74%. This skill uses a special bullet that doesen't allow any spell to cancel the effects.",
            "level14": "Makes an enemy bleed for 6 seconds, inflicts 564 physical damage per sec and decreases healing ability by 76%. This skill uses a special bullet that doesen't allow any spell to cancel the effects.",
            "level15": "Makes an enemy bleed for 6 seconds, inflicts 635 physical damage per sec and decreases healing ability by 78%. This skill uses a special bullet that doesen't allow any spell to cancel the effects.",
            "level16": "Makes an enemy bleed for 6 seconds, inflicts 707 physical damage per sec and decreases healing ability by 80%. This skill uses a special bullet that doesen't allow any spell to cancel the effects."
        }
    ],
    "Eagle Eye": [
        {
            "level1": "Increases your Hit Rate by 5 and your Crit Rate by 3 for 1 minute.",
            "level2": "Increases your Hit Rate by 6 and your Crit Rate by 6 for 1 minute.",
            "level3": "Increases your Hit Rate by 7 and your Crit Rate by 9 for 1 minute.",
            "level4": "Increases your Hit Rate by 8 and your Crit Rate by 12 for 1 minute.",
            "level5": "Increases your Hit Rate by 9 and your Crit Rate by 15 for 1 minute.",
            "level6": "Increases your Hit Rate by 10 and your Crit Rate by 18 for 1 minute.",
            "level7": "Increases your Hit Rate by 11 and your Crit Rate by 21 for 1 minute.",
            "level8": "Increases your Hit Rate by 12 and your Crit Rate by 24 for 1 minute.",
            "level9": "Increases your Hit Rate by 13 and your Crit Rate by 27 for 1 minute.",
            "level10": "Increases your Hit Rate by 15 and your Crit Rate by 30 for 1 minute."
        }
    ],
    "Concentration": [
        {
            "level1": "Increasesthe chance to resist casting interruption by 20% and increases hit rate by 2.",
            "level2": "Increasesthe chance to resist casting interruption by 32% and increases hit rate by 4.",
            "level3": "Increasesthe chance to resist casting interruption by 44% and increases hit rate by 6.",
            "level4": "Increasesthe chance to resist casting interruption by 52% and increases hit rate by 8.",
            "level5": "Increasesthe chance to resist casting interruption by 60% and increases hit rate by 10.",
            "level6": "Increasesthe chance to resist casting interruption by 68% and increases hit rate by 12.",
            "level7": "Increasesthe chance to resist casting interruption by 76% and increases hit rate by 14.",
            "level8": "Increasesthe chance to resist casting interruption by 84% and increases hit rate by 16.",
            "level9": "Increasesthe chance to resist casting interruption by 92% and increases hit rate by 18.",
            "level10": "Increasesthe chance to resist casting interruption by 100% and increases hit rate by 20."
        }
    ],
    "Sharpshooter": [
        {
           "level1": "Increasescritical hit damage by 10%.",
           "level2": "Increasescritical hit damage by 15%.",
           "level3": "Increasescritical hit damage by 20%.",
           "level4": "Increasescritical hit damage by 25%.",
           "level5": "Increasescritical hit damage by 30%.",
           "level6": "Increasescritical hit damage by 35%.",
           "level7": "Increasescritical hit damage by 40%.",
           "level8": "Increasescritical hit damage by 45%.",
           "level9": "Increasescritical hit damage by 50%.",
           "level10": "Increasescritical hit damage by 55%."
        }
    ],
    "Incendiary Round": [
        {
            "level1": "Deals 187 physical damage to all enemies within 4 meters and prevents casting for 3 seconds.",
            "level2": "Deals 228 physical damage to all enemies within 4 meters and prevents casting for 3 seconds.",
            "level3": "Deals 277 physical damage to all enemies within 4 meters and prevents casting for 3 seconds.",
            "level4": "Deals 334 physical damage to all enemies within 4 meters and prevents casting for 3 seconds.",
            "level5": "Deals 399 physical damage to all enemies within 4 meters and prevents casting for 3 seconds.",
            "level6": "Deals 471 physical damage to all enemies within 4 meters and prevents casting for 3 seconds.",
            "level7": "Deals 555 physical damage to all enemies within 4 meters and prevents casting for 3 seconds.",
            "level8": "Deals 642 physical damage to all enemies within 4 meters and prevents casting for 3 seconds.",
            "level9": "Deals 744 physical damage to all enemies within 4 meters and prevents casting for 3 seconds.",
            "level10": "Deals 849 physical damage to all enemies within 4 meters and prevents casting for 3 seconds.",
            "level11": "Deals 956 physical damage to all enemies within 4 meters and prevents casting for 3 seconds.",
            "level12": "Deals 1073 physical damage to all enemies within 4 meters and prevents casting for 3 seconds.",
            "level13": "Deals 1208 physical damage to all enemies within 4 meters and prevents casting for 3 seconds.",
            "level14": "Deals 1344 physical damage to all enemies within 4 meters and prevents casting for 3 seconds.",
            "level15": "Deals 1495 physical damage to all enemies within 4 meters and prevents casting for 3 seconds.",
            "level16": "Deals 1659 physical damage to all enemies within 4 meters and prevents casting for 3 seconds."
        }
    ],
    "Ambush": [
        {
            "level1": "Attacks the enemy from stealth to cause 327 physical damage and stun the enemy for 5 seconds.",
            "level2": "Attacks the enemy from stealth to cause 393 physical damage and stun the enemy for 5 seconds.",
            "level3": "Attacks the enemy from stealth to cause 476 physical damage and stun the enemy for 5 seconds.",
            "level4": "Attacks the enemy from stealth to cause 578 physical damage and stun the enemy for 5 seconds.",
            "level5": "Attacks the enemy from stealth to cause 682 physical damage and stun the enemy for 5 seconds.",
            "level6": "Attacks the enemy from stealth to cause 803 physical damage and stun the enemy for 5 seconds.",
            "level7": "Attacks the enemy from stealth to cause 938 physical damage and stun the enemy for 5 seconds.",
            "level8": "Attacks the enemy from stealth to cause 1086 physical damage and stun the enemy for 5 seconds.",
            "level9": "Attacks the enemy from stealth to cause 1245 physical damage and stun the enemy for 5 seconds.",
            "level10": "Attacks the enemy from stealth to cause 1416 physical damage and stun the enemy for 5 seconds.",
            "level11": "Attacks the enemy from stealth to cause 1590 physical damage and stun the enemy for 5 seconds.",
            "level12": "Attacks the enemy from stealth to cause 1790 physical damage and stun the enemy for 5 seconds.",
            "level13": "Attacks the enemy from stealth to cause 2005 physical damage and stun the enemy for 5 seconds.",
            "level14": "Attacks the enemy from stealth to cause 2225 physical damage and stun the enemy for 5 seconds.",
            "level15": "Attacks the enemy from stealth to cause 2475 physical damage and stun the enemy for 5 seconds.",
            "level16": "Attacks the enemy from stealth to cause 2747 physical damage and stun the enemy for 5 seconds."
        }
    ],
    "Terminate": [
        {
            "level1": "Shoots a target whose HP is below 25% for 525 physical damage.",
            "level2": "Shoots a target whose HP is below 25% for 639 physical damage.",
            "level3": "Shoots a target whose HP is below 25% for 767 physical damage.",
            "level4": "Shoots a target whose HP is below 25% for 907 physical damage.",
            "level5": "Shoots a target whose HP is below 25% for 1068 physical damage.",
            "level6": "Shoots a target whose HP is below 25% for 1239 physical damage.",
            "level7": "Shoots a target whose HP is below 25% for 1435 physical damage.",
            "level8": "Shoots a target whose HP is below 25% for 1638 physical damage.",
            "level9": "Shoots a target whose HP is below 25% for 1852 physical damage.",
            "level10": "Shoots a target whose HP is below 25% for 2083 physical damage.",
            "level11": "Shoots a target whose HP is below 25% for 2342 physical damage.",
            "level12": "Shoots a target whose HP is below 25% for 2622 physical damage.",
            "level13": "Shoots a target whose HP is below 25% for 2909 physical damage.",
            "level14": "Shoots a target whose HP is below 25% for 3234 physical damage.",
            "level15": "Shoots a target whose HP is below 25% for 3591 physical damage.",
            "level16": "Shoots a target whose HP is below 25% for 3987 physical damage."
        }
    ],
    "Sonic Blast": [
        {
            "level1": "Deals 618 physical damage to all enemies in 4 meter radius and silences them for 6 seconds. Base critical rate of 25.",
            "level2": "Deals 749 physical damage to all enemies in 4 meter radius and silences them for 6 seconds. Base critical rate of 27.",
            "level3": "Deals 891 physical damage to all enemies in 4 meter radius and silences them for 6 seconds. Base critical rate of 29.",
            "level4": "Deals 1048 physical damage to all enemies in 4 meter radius and silences them for 7 seconds. Base critical rate of 31.",
            "level5": "Deals 1232 physical damage to all enemies in 4 meter radius and silences them for 7 seconds. Base critical rate of 33.",
            "level6": "Deals 1426 physical damage to all enemies in 4 meter radius and silences them for 7 seconds. Base critical rate of 35.",
            "level7": "Deals 1651 physical damage to all enemies in 4 meter radius and silences them for 8 seconds. Base critical rate of 37.",
            "level8": "Deals 1872 physical damage to all enemies in 4 meter radius and silences them for 8 seconds. Base critical rate of 39.",
            "level9": "Deals 2104 physical damage to all enemies in 4 meter radius and silences them for 8 seconds. Base critical rate of 41.",
            "level10": "Deals 2362 physical damage to all enemies in 4 meter radius and silences them for 9 seconds. Base critical rate of 43.",
            "level11": "Deals 2658 physical damage to all enemies in 4 meter radius and silences them for 9 seconds. Base critical rate of 45.",
            "level12": "Deals 2950 physical damage to all enemies in 4 meter radius and silences them for 9 seconds. Base critical rate of 47.",
            "level13": "Deals 3280 physical damage to all enemies in 4 meter radius and silences them for 10 seconds. Base critical rate of 49.",
            "level14": "Deals 3643 physical damage to all enemies in 4 meter radius and silences them for 10 seconds. Base critical rate of 51.",
            "level15": "Deals 4047 physical damage to all enemies in 4 meter radius and silences them for 10 seconds. Base critical rate of 53.",
            "level16": "Deals 4497 physical damage to all enemies in 4 meter radius and silences them for 10 seconds. Base critical rate of 55."
        }
    ],
    "Rifle Smash": [
        {
            "level1": "Deals 182 physical damage breaks the target's concentration for 6 seconds.",
            "level2": "Deals 219 physical damage breaks the target's concentration for 7 seconds.",
            "level3": "Deals 259 physical damage breaks the target's concentration for 8 seconds.",
            "level4": "Deals 305 physical damage breaks the target's concentration for 9 seconds.",
            "level5": "Deals 354 physical damage breaks the target's concentration for 10 seconds.",
            "level6": "Deals 410 physical damage breaks the target's concentration for 11 seconds.",
            "level7": "Deals 468 physical damage breaks the target's concentration for 12 seconds.",
            "level8": "Deals 529 physical damage breaks the target's concentration for 13 seconds.",
            "level9": "Deals 595 physical damage breaks the target's concentration for 14 seconds.",
            "level10": "Deals 669 physical damage breaks the target's concentration for 15 seconds."
        }
    ],
    "Pinpoint Weakness": [ 
        {
            "level1": "Decreases dodge rate and critical hit resistance of target by 5 for 12 seconds, adds 10% to HP treshold for Terminate. Effects one target at a time.",
            "level2": "Decreases dodge rate and critical hit resistance of target by 7 for 12 seconds, adds 12% to HP treshold for Terminate. Effects one target at a time.",
            "level3": "Decreases dodge rate and critical hit resistance of target by 9 for 12 seconds, adds 14% to HP treshold for Terminate. Effects one target at a time.",
            "level4": "Decreases dodge rate and critical hit resistance of target by 11 for 12 seconds, adds 16% to HP treshold for Terminate. Effects one target at a time.",
            "level5": "Decreases dodge rate and critical hit resistance of target by 13 for 12 seconds, adds 18% to HP treshold for Terminate. Effects one target at a time.",
            "level6": "Decreases dodge rate and critical hit resistance of target by 15 for 12 seconds, adds 20% to HP treshold for Terminate. Effects one target at a time.",
            "level7": "Decreases dodge rate and critical hit resistance of target by 17 for 12 seconds, adds 22% to HP treshold for Terminate. Effects one target at a time.",
            "level8": "Decreases dodge rate and critical hit resistance of target by 19 for 12 seconds, adds 23% to HP treshold for Terminate. Effects one target at a time.",
            "level9": "Decreases dodge rate and critical hit resistance of target by 21 for 12 seconds, adds 24% to HP treshold for Terminate. Effects one target at a time.",
            "level10": "Decreases dodge rate and critical hit resistance of target by 25 for 12 seconds, adds 25% to HP treshold for Terminate. Effects one target at a time."
        }
    ],
    "Deploy Turret": [
        {
            "level1": "Installs a fixed turret Level 40 on a selected location and lets it attack enemies within range for 40 seconds.",
            "level2": "Installs a fixed turret Level 44 on a selected location and lets it attack enemies within range for 42 seconds.",
            "level3": "Installs a fixed turret Level 48 on a selected location and lets it attack enemies within range for 44 seconds.",
            "level4": "Installs a fixed turret Level 52 on a selected location and lets it attack enemies within range for 46 seconds.",
            "level5": "Installs a fixed turret Level 56 on a selected location and lets it attack enemies within range for 48 seconds.",
            "level6": "Installs a fixed turret Level 60 on a selected location and lets it attack enemies within range for 50 seconds.",
            "level7": "Installs a fixed turret Level 64 on a selected location and lets it attack enemies within range for 52 seconds.",
            "level8": "Installs a fixed turret Level 68 on a selected location and lets it attack enemies within range for 54 seconds.",
            "level9": "Installs a fixed turret Level 72 on a selected location and lets it attack enemies within range for 56 seconds.",
            "level10": "Installs a fixed turret Level 76 on a selected location and lets it attack enemies within range for 60 seconds."
        }
    ],
    "Headshot": [
        {
            "level1": "By sniping an enemy, inflicts 1409 physical damage, blows off a maximum of 1071 Mana, and adds extra damage as much as Mana loss. Critical Rate increases by 50.",
            "level2": "By sniping an enemy, inflicts 1665 physical damage, blows off a maximum of 1257 Mana, and adds extra damage as much as Mana loss. Critical Rate increases by 52.",
            "level3": "By sniping an enemy, inflicts 1962 physical damage, blows off a maximum of 1475 Mana, and adds extra damage as much as Mana loss. Critical Rate increases by 54.",
            "level4": "By sniping an enemy, inflicts 2277 physical damage, blows off a maximum of 1704 Mana, and adds extra damage as much as Mana loss. Critical Rate increases by 56.",
            "level5": "By sniping an enemy, inflicts 2637 physical damage, blows off a maximum of 1965 Mana, and adds extra damage as much as Mana loss. Critical Rate increases by 58.",
            "level6": "By sniping an enemy, inflicts 3015 physical damage, blows off a maximum of 2249 Mana, and adds extra damage as much as Mana loss. Critical Rate increases by 60.",
            "level7": "By sniping an enemy, inflicts 3407 physical damage, blows off a maximum of 2517 Mana, and adds extra damage as much as Mana loss. Critical Rate increases by 62.",
            "level8": "By sniping an enemy, inflicts 3830 physical damage, blows off a maximum of 2815 Mana, and adds extra damage as much as Mana loss. Critical Rate increases by 64.",
            "level9": "By sniping an enemy, inflicts 4307 physical damage, blows off a maximum of 3152 Mana, and adds extra damage as much as Mana loss. Critical Rate increases by 66.",
            "level10": "By sniping an enemy, inflicts 4815 physical damage, blows off a maximum of 3507 Mana, and adds extra damage as much as Mana loss. Critical Rate increases by 68.",
            "level11": "By sniping an enemy, inflicts 5346 physical damage, blows off a maximum of 3878 Mana, and adds extra damage as much as Mana loss. Critical Rate increases by 70",
            "level12": "By sniping an enemy, inflicts 5940 physical damage, blows off a maximum of 4287 Mana, and adds extra damage as much as Mana loss. Critical Rate increases by 72.",
            "level13": "By sniping an enemy, inflicts 6597 physical damage, blows off a maximum of 4739 Mana, and adds extra damage as much as Mana loss. Critical Rate increases by 74.",
            "level14": "By sniping an enemy, inflicts 7263 physical damage, blows off a maximum of 5240 Mana, and adds extra damage as much as Mana loss. Critical Rate increases by 76.",
            "level15": "By sniping an enemy, inflicts 7992 physical damage, blows off a maximum of 5792 Mana, and adds extra damage as much as Mana loss. Critical Rate increases by 78.",
            "level16": "By sniping an enemy, inflicts 8802 physical damage, blows off a maximum of 6243 Mana, and adds extra damage as much as Mana loss. Critical Rate increases by 80."
        }
    ],
    "Knockout Shot": [
        {
            "level1": "A blow to the head deals 512 physical damage to the target and stund it for 3 seconds.",
            "level2": "A blow to the head deals 593 physical damage to the target and stund it for 3 seconds.",
            "level3": "A blow to the head deals 686 physical damage to the target and stund it for 3 seconds.",
            "level4": "A blow to the head deals 773 physical damage to the target and stund it for 3 seconds.",
            "level5": "A blow to the head deals 867 physical damage to the target and stund it for 3 seconds.",
            "level6": "A blow to the head deals 977 physical damage to the target and stund it for 3 seconds.",
            "level7": "A blow to the head deals 1094 physical damage to the target and stund it for 3 seconds.",
            "level8": "A blow to the head deals 1214 physical damage to the target and stund it for 3 seconds.",
            "level9": "A blow to the head deals 1350 physical damage to the target and stund it for 3 seconds.",
            "level10": "A blow to the head deals 1499 physical damage to the target and stund it for 3 seconds.",
            "level11": "A blow to the head deals 1665 physical damage to the target and stund it for 3 seconds.",
            "level12": "A blow to the head deals 1848 physical damage to the target and stund it for 3 seconds.",
            "level13": "A blow to the head deals 2054 physical damage to the target and stund it for 3 seconds."
        }
    ],
    "Ultimatum": [
        {
            "level1": "Powerful finish incflicts 100 additional damage when attacking enemies whose HP is below 25%.Increases the caster's movespeed by 2.",
            "level2": "Powerful finish incflicts 150 additional damage when attacking enemies whose HP is below 25%.Increases the caster's movespeed by 2.",
            "level3": "Powerful finish incflicts 200 additional damage when attacking enemies whose HP is below 25%.Increases the caster's movespeed by 2.",
            "level4": "Powerful finish incflicts 250 additional damage when attacking enemies whose HP is below 25%.Increases the caster's movespeed by 2.",
            "level5": "Powerful finish incflicts 300 additional damage when attacking enemies whose HP is below 25%.Increases the caster's movespeed by 2.",
            "level6": "Powerful finish incflicts 350 additional damage when attacking enemies whose HP is below 25%.Increases the caster's movespeed by 2.",
            "level7": "Powerful finish incflicts 400 additional damage when attacking enemies whose HP is below 25%.Increases the caster's movespeed by 2.",
            "level8": "Powerful finish incflicts 450 additional damage when attacking enemies whose HP is below 25%.Increases the caster's movespeed by 2.",
            "level9": "Powerful finish incflicts 500 additional damage when attacking enemies whose HP is below 25%.Increases the caster's movespeed by 2.",
            "level10": "Powerful finish incflicts 550 additional damage when attacking enemies whose HP is below 25%.Increases the caster's movespeed by 2."
        }
    ],
    "Predator": [
        {
            "level1": "When triggered in sniping mode, resets cool down of Stealth and lets the skill user attack enemies while hiding for 20 seconds.However, Movement Speed is decreased by 50 and the effect is cancelled after receiving damage.",
            "level2": "When triggered in sniping mode, resets cool down of Stealth and lets the skill user attack enemies while hiding for 21 seconds.However, Movement Speed is decreased by 50 and the effect is cancelled after receiving damage.",
            "level3": "When triggered in sniping mode, resets cool down of Stealth and lets the skill user attack enemies while hiding for 22 seconds.However, Movement Speed is decreased by 50 and the effect is cancelled after receiving damage.",
            "level4": "When triggered in sniping mode, resets cool down of Stealth and lets the skill user attack enemies while hiding for 23 seconds.However, Movement Speed is decreased by 50 and the effect is cancelled after receiving damage.",
            "level5": "When triggered in sniping mode, resets cool down of Stealth and lets the skill user attack enemies while hiding for 24 seconds.However, Movement Speed is decreased by 50 and the effect is cancelled after receiving damage.",
            "level6": "When triggered in sniping mode, resets cool down of Stealth and lets the skill user attack enemies while hiding for 25 seconds.However, Movement Speed is decreased by 50 and the effect is cancelled after receiving damage.",
            "level7": "When triggered in sniping mode, resets cool down of Stealth and lets the skill user attack enemies while hiding for 26 seconds.However, Movement Speed is decreased by 50 and the effect is cancelled after receiving damage.",
            "level8": "When triggered in sniping mode, resets cool down of Stealth and lets the skill user attack enemies while hiding for 27 seconds.However, Movement Speed is decreased by 50 and the effect is cancelled after receiving damage.",
            "level9": "When triggered in sniping mode, resets cool down of Stealth and lets the skill user attack enemies while hiding for 28 seconds.However, Movement Speed is decreased by 50 and the effect is cancelled after receiving damage.",
            "level10": "When triggered in sniping mode, resets cool down of Stealth and lets the skill user attack enemies while hiding for 29 seconds.However, Movement Speed is decreased by 50 and the effect is cancelled after receiving damage.",
            "level11": "When triggered in sniping mode, resets cool down of Stealth and lets the skill user attack enemies while hiding for 30 seconds.However, Movement Speed is decreased by 50 and the effect is cancelled after receiving damage."
        }
    ],
    "Spot Weakness": [
        {
            "level1": "Exposes a weakness in the target's armor 2 times for 2 minutes.",
            "level2": "Exposes a weakness in the target's armor 3 times for 2 minutes.",
            "level3": "Exposes a weakness in the target's armor 4 times for 2 minutes.",
            "level4": "Exposes a weakness in the target's armor 5 times for 2 minutes.",
            "level5": "Exposes a weakness in the target's armor 6 times for 2 minutes.",
            "level6": "Exposes a weakness in the target's armor 7 times for 2 minutes.",
            "level7": "Exposes a weakness in the target's armor 8 times for 2 minutes.",
            "level8": "Exposes a weakness in the target's armor 9 times for 2 minutes.",
            "level9": "Exposes a weakness in the target's armor 10 times for 2 minutes.",
            "level10": "Exposes a weakness in the target's armor 12 times for 2 minutes."
        }
    ],
    "Roll With It": [
        {
            "level1": "Increases critical and double attack resistance by 3.",
            "level2": "Increases critical and double attack resistance by 6.",
            "level3": "Increases critical and double attack resistance by 9.",
            "level4": "Increases critical and double attack resistance by 12.",
            "level5": "Increases critical and double attack resistance by 15.",
            "level6": "Increases critical and double attack resistance by 18.",
            "level7": "Increases critical and double attack resistance by 21.",
            "level8": "Increases critical and double attack resistance by 24.",
            "level9": "Increases critical and double attack resistance by 27.",
            "level10": "Increases critical and double attack resistance by 30."
        }
    ],
    "Go Postal": [
        {
            "level1": "Inflicts 2575 physical damage on enemies within 4m of the target. Each blow adds 490 extra damage for 6 seconds. Critical Rate increases by 25.",
            "level2": "Inflicts 2898 physical damage on enemies within 4m of the target. Each blow adds 552 extra damage for 6 seconds. Critical Rate increases by 27.",
            "level3": "Inflicts 3226 physical damage on enemies within 4m of the target. Each blow adds 614 extra damage for 6 seconds. Critical Rate increases by 29.",
            "level4": "Inflicts 3587 physical damage on enemies within 4m of the target. Each blow adds 683 extra damage for 6 seconds. Critical Rate increases by 31.",
            "level5": "Inflicts 3982 physical damage on enemies within 4m of the target. Each blow adds 758 extra damage for 6 seconds. Critical Rate increases by 33.",
            "level6": "Inflicts 4423 physical damage on enemies within 4m of the target. Each blow adds 842 extra damage for 6 seconds. Critical Rate increases by 35.",
            "level7": "Inflicts 4910 physical damage on enemies within 4m of the target. Each blow adds 935 extra damage for 6 seconds. Critical Rate increases by 37.",
            "level8": "Inflicts 5456 physical damage on enemies within 4m of the target. Each blow adds 1039 extra damage for 6 seconds. Critical Rate increases by 39.",
            "level9": "Inflicts 5750 physical damage on enemies within 4m of the target. Each blow adds 1095 extra damage for 6 seconds. Critical Rate increases by 41."
        }
    ],
    "Bloodlust": [
        {
            "level1": "Deals 1302 Physical Attack and converts 80% of the damage value to own HP. if the target is killed with this skill, recovers additional HP equivalent to 25% of Max HP.",
            "level2": "Deals 1458 Physical Attack and converts 85% of the damage value to own HP. if the target is killed with this skill, recovers additional HP equivalent to 30% of Max HP.",
            "level3": "Deals 1618 Physical Attack and converts 90% of the damage value to own HP. if the target is killed with this skill, recovers additional HP equivalent to 35% of Max HP.",
            "level4": "Deals 1800 Physical Attack and converts 95% of the damage value to own HP. if the target is killed with this skill, recovers additional HP equivalent to 40% of Max HP.",
            "level5": "Deals 1998 Physical Attack and converts 100% of the damage value to own HP. if the target is killed with this skill, recovers additional HP equivalent to 45% of Max HP.",
            "level6": "Deals 2220 Physical Attack and converts 105% of the damage value to own HP. if the target is killed with this skill, recovers additional HP equivalent to 50% of Max HP.",
            "level7": "Deals 2464 Physical Attack and converts 110% of the damage value to own HP. if the target is killed with this skill, recovers additional HP equivalent to 55% of Max HP.",
            "level8": "Deals 2738 Physical Attack and converts 120% of the damage value to own HP. if the target is killed with this skill, recovers additional HP equivalent to 60% of Max HP."
        }
    ],
    "Death Kneell": [
        {
            "level1": "Deals 2552 Physical Attack and instantly kills an elite monster with 39% probability. Deals double damage to a players with 26% probability.",
            "level2": "Deals 2832 Physical Attack and instantly kills an elite monster with 45% probability. Deals double damage to a players with 30% probability.",
            "level3": "Deals 3150 Physical Attack and instantly kills an elite monster with 51% probability. Deals double damage to a players with 34% probability.",
            "level4": "Deals 3497 Physical Attack and instantly kills an elite monster with 57% probability. Deals double damage to a players with 38% probability.",
            "level5": "Deals 3885 Physical Attack and instantly kills an elite monster with 63% probability. Deals double damage to a players with 42% probability.",
            "level6": "Deals 4312 Physical Attack and instantly kills an elite monster with 69% probability. Deals double damage to a players with 46% probability.",
            "level7": "Deals 4792 Physical Attack and instantly kills an elite monster with 75% probability. Deals double damage to a players with 50% probability."
        }
    ],
    "Ghost Stance:": [
        {
            "level1": "Right after inflicting 2225 physical damage, the user goes into Ghost Stance and hides itself for 6 seconds. Movement Speed inceases by 10.",
            "level2": "Right after inflicting 2475 physical damage, the user goes into Ghost Stance and hides itself for 6 seconds. Movement Speed inceases by 10.",
            "level3": "Right after inflicting 2747 physical damage, the user goes into Ghost Stance and hides itself for 6 seconds. Movement Speed inceases by 10.",
            "level4": "Right after inflicting 3053 physical damage, the user goes into Ghost Stance and hides itself for 6 seconds. Movement Speed inceases by 10.",
            "level5": "Right after inflicting 3388 physical damage, the user goes into Ghost Stance and hides itself for 6 seconds. Movement Speed inceases by 10.",
            "level6": "Right after inflicting 3765 physical damage, the user goes into Ghost Stance and hides itself for 6 seconds. Movement Speed inceases by 10."
        }
    ],
    "Napalm Strike": [
        {
            "level1": "Shoots a bullet that heats the ground. It deals 2562 damage to enemies within a 6m radius and the armor of the damaged enemies is melted fo 10 seconds.",
            "level2": "Shoots a bullet that heats the ground. It deals 2844 damage to enemies within a 6m radius and the armor of the damaged enemies is melted fo 12 seconds.",
            "level3": "Shoots a bullet that heats the ground. It deals 3159 damage to enemies within a 6m radius and the armor of the damaged enemies is melted fo 14 seconds.",
            "level4": "Shoots a bullet that heats the ground. It deals 3507 damage to enemies within a 6m radius and the armor of the damaged enemies is melted fo 16 seconds.",
            "level5": "Shoots a bullet that heats the ground. It deals 3897 damage to enemies within a 6m radius and the armor of the damaged enemies is melted fo 18 seconds."
        }
    ],
    "Multi Trap": [
        {
            "level1": "Deals 1896 physical damage to a target and enemies within 6 meters and slow them down by 18 for 4 seconds",
            "level2": "Deals 2106 physical damage to a target and enemies within 6 meters and slow them down by 21 for 5 seconds",
            "level3": "Deals 2338 physical damage to a target and enemies within 6 meters and slow them down by 24 for 6 seconds",
            "level4": "Deals 2598 physical damage to a target and enemies within 6 meters and slow them down by 27 for 7 seconds"
        }
    ],
    "Bullet May Cry": [
        {
            "level1": "Imbue the gun barrel with awesome power for 8 seconds. Increase double attack value by 14, ignores 24% of enemy's physical DEF, and adds splash damage to normal attacks equivalent to 80% of physical ATK.",
            "level2": "Imbue the gun barrel with awesome power for 8 seconds. Increase double attack value by 16, ignores 26% of enemy's physical DEF, and adds splash damage to normal attacks equivalent to 80% of physical ATK.",
            "level3": "Imbue the gun barrel with awesome power for 8 seconds. Increase double attack value by 18, ignores 28% of enemy's physical DEF, and adds splash damage to normal attacks equivalent to 80% of physical ATK.",
            "level4": "Imbue the gun barrel with awesome power for 8 seconds. Increase double attack value by 20, ignores 30% of enemy's physical DEF, and adds splash damage to normal attacks equivalent to 80% of physical ATK."
        }
    ],
    "Destination": [
        {
            "level1": "By shooting an enemy with special bullet, completely ignores its Physical DEF and inflicts 2587 physical damage. Adds 4312 extra damage when using the skill while hiding.",
            "level2": "By shooting an enemy with special bullet, completely ignores its Physical DEF and inflicts 2875 physical damage. Adds 4792 extra damage when using the skill while hiding."
        }
    ],
    "Corrosive Round": [
        {
            "level1": "Deals 11 physical damage on impact and an additional 57 damage after 3 seconds",
            "level2": "Deals 14 physical damage on impact and an additional 69 damage after 3 seconds",
            "level3": "Deals 19 physical damage on impact and an additional 92 damage after 3 seconds",
            "level4": "Deals 24 physical damage on impact and an additional 120 damage after 3 seconds",
            "level5": "Deals 30 physical damage on impact and an additional 150 damage after 3 seconds",
            "level6": "Deals 37 physical damage on impact and an additional 186 damage after 3 seconds",
            "level7": "Deals 45 physical damage on impact and an additional 225 damage after 3 seconds",
            "level8": "Deals 54 physical damage on impact and an additional 272 damage after 3 seconds",
            "level9": "Deals 66 physical damage on impact and an additional 332 damage after 3 seconds",
            "level10": "Deals 80 physical damage on impact and an additional 401 damage after 3 seconds",
            "level11": "Deals 97 physical damage on impact and an additional 484 damage after 3 seconds",
            "level12": "Deals 114 physical damage on impact and an additional 570 damage after 3 seconds",
            "level13": "Deals 135 physical damage on impact and an additional 673 damage after 3 seconds",
            "level14": "Deals 156 physical damage on impact and an additional 782 damage after 3 seconds",
            "level15": "Deals 181 physical damage on impact and an additional 906 damage after 3 seconds",
            "level16": "Deals 208 physical damage on impact and an additional 1040 damage after 3 seconds"
        }
    ],
    "Poison Ivy": [
        {
            "level1": "Creates venomous ivy under enemy's feet to immobilize it for 3 seconds. For the duration, this inflicts 33 physical damage per sec and decreases abnormal states RES by 6.",
            "level2": "Creates venomous ivy under enemy's feet to immobilize it for 3 seconds. For the duration, this inflicts 44 physical damage per sec and decreases abnormal states RES by 7.",
            "level3": "Creates venomous ivy under enemy's feet to immobilize it for 3 seconds. For the duration, this inflicts 58 physical damage per sec and decreases abnormal states RES by 8.",
            "level4": "Creates venomous ivy under enemy's feet to immobilize it for 3 seconds. For the duration, this inflicts 72 physical damage per sec and decreases abnormal states RES by 9.",
            "level5": "Creates venomous ivy under enemy's feet to immobilize it for 4 seconds. For the duration, this inflicts 89 physical damage per sec and decreases abnormal states RES by 10.",
            "level6": "Creates venomous ivy under enemy's feet to immobilize it for 4 seconds. For the duration, this inflicts 108 physical damage per sec and decreases abnormal states RES by 11.",
            "level7": "Creates venomous ivy under enemy's feet to immobilize it for 4 seconds. For the duration, this inflicts 131 physical damage per sec and decreases abnormal states RES by 12.",
            "level8": "Creates venomous ivy under enemy's feet to immobilize it for 4 seconds. For the duration, this inflicts 160 physical damage per sec and decreases abnormal states RES by 13.",
            "level9": "Creates venomous ivy under enemy's feet to immobilize it for 5 seconds. For the duration, this inflicts 193 physical damage per sec and decreases abnormal states RES by 14.",
            "level10": "Creates venomous ivy under enemy's feet to immobilize it for 5 seconds. For the duration, this inflicts 233 physical damage per sec and decreases abnormal states RES by 15.",
            "level11": "Creates venomous ivy under enemy's feet to immobilize it for 5 seconds. For the duration, this inflicts 275 physical damage per sec and decreases abnormal states RES by 16.",
            "level12": "Creates venomous ivy under enemy's feet to immobilize it for 5 seconds. For the duration, this inflicts 324 physical damage per sec and decreases abnormal states RES by 17.",
            "level13": "Creates venomous ivy under enemy's feet to immobilize it for 6 seconds. For the duration, this inflicts 376 physical damage per sec and decreases abnormal states RES by 18.",
            "level14": "Creates venomous ivy under enemy's feet to immobilize it for 6 seconds. For the duration, this inflicts 436 physical damage per sec and decreases abnormal states RES by 19.",
            "level15": "Creates venomous ivy under enemy's feet to immobilize it for 6 seconds. For the duration, this inflicts 498 physical damage per sec and decreases abnormal states RES by 20.",
            "level16": "Creates venomous ivy under enemy's feet to immobilize it for 6 seconds. For the duration, this inflicts 563 physical damage per sec and decreases abnormal states RES by 21."
        }
    ],
    "Quicksilver": [
        {
            "level1": "Increases Movement Speed by 10 and Evasion by 14 for 20 seconds.",
            "level2": "Increases Movement Speed by 10 and Evasion by 16 for 21 seconds.",
            "level3": "Increases Movement Speed by 10 and Evasion by 18 for 22 seconds.",
            "level4": "Increases Movement Speed by 10 and Evasion by 20 for 23 seconds.",
            "level5": "Increases Movement Speed by 10 and Evasion by 22 for 24 seconds.",
            "level6": "Increases Movement Speed by 10 and Evasion by 24 for 25 seconds.",
            "level7": "Increases Movement Speed by 10 and Evasion by 26 for 26 seconds.",
            "level8": "Increases Movement Speed by 10 and Evasion by 28 for 27 seconds.",
            "level9": "Increases Movement Speed by 10 and Evasion by 30 for 28 seconds.",
            "level10": "Increases Movement Speed by 10 and Evasion by 33 for 30 seconds. Applies Quick Step to the user and lets it hide shortly."
        }
    ],
    "Hot Shot": [
        {
            "level1": "By filling dual pistols with magical power, increases physical damage by 10 and skill ATK by 39.",
            "level2": "By filling dual pistols with magical power, increases physical damage by 13 and skill ATK by 49.",
            "level3": "By filling dual pistols with magical power, increases physical damage by 16 and skill ATK by 61.",
            "level4": "By filling dual pistols with magical power, increases physical damage by 19 and skill ATK by 75.",
            "level5": "By filling dual pistols with magical power, increases physical damage by 22 and skill ATK by 91.",
            "level6": "By filling dual pistols with magical power, increases physical damage by 27 and skill ATK by 110.",
            "level7": "By filling dual pistols with magical power, increases physical damage by 32 and skill ATK by 134.",
            "level8": "By filling dual pistols with magical power, increases physical damage by 38 and skill ATK by 162.",
            "level9": "By filling dual pistols with magical power, increases physical damage by 44 and skill ATK by 196.",
            "level10": "By filling dual pistols with magical power, increases physical damage by 51 and skill ATK by 231.",
            "level11": "By filling dual pistols with magical power, increases physical damage by 59 and skill ATK by 273.",
            "level12": "By filling dual pistols with magical power, increases physical damage by 68 and skill ATK by 317.",
            "level13": "By filling dual pistols with magical power, increases physical damage by 78 and skill ATK by 367.",
            "level14": "By filling dual pistols with magical power, increases physical damage by 88 and skill ATK by 422.",
            "level15": "By filling dual pistols with magical power, increases physical damage by 99 and skill ATK by 474.",
            "level16": "By filling dual pistols with magical power, increases physical damage by 116 and skill ATK by 534."
        }
    ],
    "dualStealth": [
        {
            "level1": "While hiding for 20 seconds, Threat is reset and Movement Speed is decreased by 12.",
            "level2": "While hiding for 21 seconds, Threat is reset and Movement Speed is decreased by 6.",
            "level3": "While hiding for 22 seconds, Threat is reset and Movement Speed is decreased by 3.",
            "level4": "While hiding for 23 seconds, Threat is reset.",
            "level5": "While hiding for 24 seconds, Threat is reset and Movement Speed is increased by 3.",
            "level6": "While hiding for 25 seconds, Threat is reset and Movement Speed is increased by 6.",
            "level7": "While hiding for 26 seconds, Threat is reset and Movement Speed is increased by 9.",
            "level8": "While hiding for 27 seconds, Threat is reset and Movement Speed is increased by 12.",
            "level9": "While hiding for 28 seconds, Threat is reset and Movement Speed is increased by 15.",
            "level10": "While hiding for 30 seconds, Threat is reset and Movement Speed is increased by 18."
        }
    ],
    "Full Auto": [
        {
            "level1": "Rapid-fires pistols causing 174 physical damage.",
            "level2": "Rapid-fires pistols causing 217 physical damage.",
            "level3": "Rapid-fires pistols causing 268 physical damage.",
            "level4": "Rapid-fires pistols causing 325 physical damage.",
            "level5": "Rapid-fires pistols causing 393 physical damage.",
            "level6": "Rapid-fires pistols causing 479 physical damage.",
            "level7": "Rapid-fires pistols causing 579 physical damage.",
            "level8": "Rapid-fires pistols causing 698 physical damage.",
            "level9": "Rapid-fires pistols causing 824 physical damage.",
            "level10": "Rapid-fires pistols causing 972 physical damage.",
            "level11": "Rapid-fires pistols causing 1129 physical damage.",
            "level12": "Rapid-fires pistols causing 1308 physical damage.",
            "level13": "Rapid-fires pistols causing 1496 physical damage.",
            "level14": "Rapid-fires pistols causing 1690 physical damage.",
            "level15": "Rapid-fires pistols causing 1901 physical damage.",
            "level16": "Rapid-fires pistols causing 2138 physical damage."
        }
    ],
    "Foxglove": [
        {
            "level1": "Shoots a venomous bullet that decreases Movement Speed by 15 and inflicts 77 physical damage per sec for 8 seconds.",
            "level2": "Shoots a venomous bullet that decreases Movement Speed by 17 and inflicts 94 physical damage per sec for 8 seconds.",
            "level3": "Shoots a venomous bullet that decreases Movement Speed by 19 and inflicts 114 physical damage per sec for 8 seconds.",
            "level4": "Shoots a venomous bullet that decreases Movement Speed by 21 and inflicts 138 physical damage per sec for 8 seconds.",
            "level5": "Shoots a venomous bullet that decreases Movement Speed by 23 and inflicts 168 physical damage per sec for 8 seconds.",
            "level6": "Shoots a venomous bullet that decreases Movement Speed by 25 and inflicts 203 physical damage per sec for 8 seconds.",
            "level7": "Shoots a venomous bullet that decreases Movement Speed by 27 and inflicts 242 physical damage per sec for 8 seconds.",
            "level8": "Shoots a venomous bullet that decreases Movement Speed by 29 and inflicts 286 physical damage per sec for 8 seconds.",
            "level9": "Shoots a venomous bullet that decreases Movement Speed by 31 and inflicts 337 physical damage per sec for 8 seconds.",
            "level10": "Shoots a venomous bullet that decreases Movement Speed by 33 and inflicts 390 physical damage per sec for 8 seconds.",
            "level11": "Shoots a venomous bullet that decreases Movement Speed by 35 and inflicts 452 physical damage per sec for 8 seconds.",
            "level12": "Shoots a venomous bullet that decreases Movement Speed by 37 and inflicts 516 physical damage per sec for 8 seconds.",
            "level13": "Shoots a venomous bullet that decreases Movement Speed by 39 and inflicts 580 physical damage per sec for 8 seconds.",
            "level14": "Shoots a venomous bullet that decreases Movement Speed by 41 and inflicts 653 physical damage per sec for 8 seconds.",
            "level15": "Shoots a venomous bullet that decreases Movement Speed by 43 and inflicts 733 physical damage per sec for 8 seconds.",
            "level16": "Shoots a venomous bullet that decreases Movement Speed by 45 and inflicts 818 physical damage per sec for 8 seconds."
        }
    ],
    "Maelstrom": [
        {
            "level1": "Places an enemy under a covenant of death, inflicts 75 extra damage for each blow and decreases Accuracy by 9 for 10 seconds.",
            "level2": "Places an enemy under a covenant of death, inflicts 915 extra damage for each blow and decreases Accuracy by 11 for 10 seconds.",
            "level3": "Places an enemy under a covenant of death, inflicts 1105 extra damage for each blow and decreases Accuracy by 13 for 10 seconds.",
            "level4": "Places an enemy under a covenant of death, inflicts 1325 extra damage for each blow and decreases Accuracy by 15 for 10 seconds.",
            "level5": "Places an enemy under a covenant of death, inflicts 1595 extra damage for each blow and decreases Accuracy by 17 for 10 seconds.",
            "level6": "Places an enemy under a covenant of death, inflicts 1925 extra damage for each blow and decreases Accuracy by 19 for 10 seconds.",
            "level7": "Places an enemy under a covenant of death, inflicts 2265 extra damage for each blow and decreases Accuracy by 21 for 10 seconds.",
            "level8": "Places an enemy under a covenant of death, inflicts 2665 extra damage for each blow and decreases Accuracy by 23 for 10 seconds.",
            "level9": "Places an enemy under a covenant of death, inflicts 3105 extra damage for each blow and decreases Accuracy by 25 for 10 seconds.",
            "level10": "Places an enemy under a covenant of death, inflicts 3585 extra damage for each blow and decreases Accuracy by 27 for 10 seconds.",
            "level11": "Places an enemy under a covenant of death, inflicts 4145 extra damage for each blow and decreases Accuracy by 29 for 10 seconds.",
            "level12": "Places an enemy under a covenant of death, inflicts 4655 extra damage for each blow and decreases Accuracy by 31 for 10 seconds.",
            "level13": "Places an enemy under a covenant of death, inflicts 5225 extra damage for each blow and decreases Accuracy by 33 for 10 seconds.",
            "level14": "Places an enemy under a covenant of death, inflicts 5865 extra damage for each blow and decreases Accuracy by 35 for 10 seconds.",
            "level15": "Places an enemy under a covenant of death, inflicts 6575 extra damage for each blow and decreases Accuracy by 37 for 10 seconds.",
            "level16": "Places an enemy under a covenant of death, inflicts 7305 extra damage for each blow and decreases Accuracy by 40 for 10 seconds."
        }
    ],
    "Tiger Eye": [
        {
            "level1": "Increases critical rate by 1 and critical damage by 3%",
            "level2": "Increases critical rate by 2 and critical damage by 6%",
            "level3": "Increases critical rate by 3 and critical damage by 9%",
            "level4": "Increases critical rate by 4 and critical damage by 12%",
            "level5": "Increases critical rate by 5 and critical damage by 15%",
            "level6": "Increases critical rate by 6 and critical damage by 18%",
            "level7": "Increases critical rate by 7 and critical damage by 21%",
            "level8": "Increases critical rate by 8 and critical damage by 24%",
            "level9": "Increases critical rate by 9 and critical damage by 27%",
            "level10": "Increases critical rate by 10 and critical damage by 30%"
        }
    ],
    "Sirocco": [
        {
            "level1": "Increases dodge rate by 3.",
            "level2": "Increases dodge rate by 4.",
            "level3": "Increases dodge rate by 5.",
            "level4": "Increases dodge rate by 6.",
            "level5": "Increases dodge rate by 7.",
            "level6": "Increases dodge rate by 8.",
            "level7": "Increases dodge rate by 9.",
            "level8": "Increases dodge rate by 10.",
            "level9": "Increases dodge rate by 11.",
            "level10": "Increases dodge rate by 12."
        }
    ],
    "Black Rose": [
        {
            "level1": "Increases critical rate by 20 for 2 minutes.",
            "level2": "Increases critical rate by 23 for 2 minutes.",
            "level3": "Increases critical rate by 26 for 2 minutes.",
            "level4": "Increases critical rate by 29 for 2 minutes.",
            "level5": "Increases critical rate by 32 for 2 minutes.",
            "level6": "Increases critical rate by 35 for 2 minutes.",
            "level7": "Increases critical rate by 38 for 2 minutes.",
            "level8": "Increases critical rate by 41 for 2 minutes.",
            "level9": "Increases critical rate by 44 for 2 minutes.",
            "level10": "Increases critical rate by 50 for 2 minutes."
        }
    ],
    "Hemlock": [
        {
            "level1": "Shoots a venomous bullet that responds to Mana. This inflicts 133 physical damage and takes 8% of Max Mana apart and converts into extra damage.",
            "level2": "Shoots a venomous bullet that responds to Mana. This inflicts 160 physical damage and takes 8% of Max Mana apart and converts into extra damage.",
            "level3": "Shoots a venomous bullet that responds to Mana. This inflicts 194 physical damage and takes 9% of Max Mana apart and converts into extra damage.",
            "level4": "Shoots a venomous bullet that responds to Mana. This inflicts 235 physical damage and takes 9% of Max Mana apart and converts into extra damage.",
            "level5": "Shoots a venomous bullet that responds to Mana. This inflicts 277 physical damage and takes 10% of Max Mana apart and converts into extra damage.",
            "level6": "Shoots a venomous bullet that responds to Mana. This inflicts 328 physical damage and takes 10% of Max Mana apart and converts into extra damage.",
            "level7": "Shoots a venomous bullet that responds to Mana. This inflicts 382 physical damage and takes 11% of Max Mana apart and converts into extra damage.",
            "level8": "Shoots a venomous bullet that responds to Mana. This inflicts 442 physical damage and takes 11% of Max Mana apart and converts into extra damage.",
            "level9": "Shoots a venomous bullet that responds to Mana. This inflicts 506 physical damage and takes 12% of Max Mana apart and converts into extra damage.",
            "level10": "Shoots a venomous bullet that responds to Mana. This inflicts 576 physical damage and takes 12% of Max Mana apart and converts into extra damage.",
            "level11": "Shoots a venomous bullet that responds to Mana. This inflicts 648 physical damage and takes 13% of Max Mana apart and converts into extra damage.",
            "level12": "Shoots a venomous bullet that responds to Mana. This inflicts 728 physical damage and takes 13% of Max Mana apart and converts into extra damage.",
            "level13": "Shoots a venomous bullet that responds to Mana. This inflicts 816 physical damage and takes 14% of Max Mana apart and converts into extra damage.",
            "level14": "Shoots a venomous bullet that responds to Mana. This inflicts 907 physical damage and takes 14% of Max Mana apart and converts into extra damage.",
            "level15": "Shoots a venomous bullet that responds to Mana. This inflicts 1008 physical damage and takes 15% of Max Mana apart and converts into extra damage.",
            "level16": "Shoots a venomous bullet that responds to Mana. This inflicts 1120 physical damage and takes 15% of Max Mana apart and converts into extra damage."
        }
    ],
    "Crossfire": [
        {
            "level1": "Deals 538 physical damage to enemies within 5 meters.",
            "level2": "Deals 650 physical damage to enemies within 5 meters.",
            "level3": "Deals 784 physical damage to enemies within 5 meters.",
            "level4": "Deals 925 physical damage to enemies within 5 meters.",
            "level5": "Deals 1091 physical damage to enemies within 5 meters.",
            "level6": "Deals 1267 physical damage to enemies within 5 meters.",
            "level7": "Deals 1469 physical damage to enemies within 5 meters.",
            "level8": "Deals 1686 physical damage to enemies within 5 meters.",
            "level9": "Deals 1898 physical damage to enemies within 5 meters.",
            "level10": "Deals 2134 physical damage to enemies within 5 meters.",
            "level11": "Deals 2400 physical damage to enemies within 5 meters.",
            "level12": "Deals 2682 physical damage to enemies within 5 meters.",
            "level13": "Deals 2979 physical damage to enemies within 5 meters.",
            "level14": "Deals 3309 physical damage to enemies within 5 meters.",
            "level15": "Deals 3677 physical damage to enemies within 5 meters.",
            "level16": "Deals 4083 physical damage to enemies within 5 meters."
        }
    ],
    "Concussive Shock": [
        {
            "level1": "Stuns enemy for 10 seconds. Target takes 230 additional damage when attacked. This skill cannot be automatically recast.",
            "level2": "Stuns enemy for 12 seconds. Target takes 280 additional damage when attacked. This skill cannot be automatically recast.",
            "level3": "Stuns enemy for 14 seconds. Target takes 333 additional damage when attacked. This skill cannot be automatically recast.",
            "level4": "Stuns enemy for 16 seconds. Target takes 393 additional damage when attacked. This skill cannot be automatically recast.",
            "level5": "Stuns enemy for 18 seconds. Target takes 460 additional damage when attacked. This skill cannot be automatically recast.",
            "level6": "Stuns enemy for 20 seconds. Target takes 534 additional damage when attacked. This skill cannot be automatically recast.",
            "level7": "Stuns enemy for 22 seconds. Target takes 616 additional damage when attacked. This skill cannot be automatically recast.",
            "level8": "Stuns enemy for 24 seconds. Target takes 700 additional damage when attacked. This skill cannot be automatically recast.",
            "level9": "Stuns enemy for 26 seconds. Target takes 788 additional damage when attacked. This skill cannot be automatically recast.",
            "level10": "Stuns enemy for 30 seconds. Target takes 884 additional damage when attacked. This skill cannot be automatically recast."
        }
    ],
    "Flashbang": [
        {
            "level1": "Deals 244 physical damage to all enemies within 3 meters and binds them for 3 seconds.",
            "level2": "Deals 294 physical damage to all enemies within 3 meters and binds them for 4 seconds.",
            "level3": "Deals 347 physical damage to all enemies within 3 meters and binds them for 5 seconds.",
            "level4": "Deals 409 physical damage to all enemies within 3 meters and binds them for 6 seconds.",
            "level5": "Deals 475 physical damage to all enemies within 3 meters and binds them for 7 seconds.",
            "level6": "Deals 551 physical damage to all enemies within 3 meters and binds them for 8 seconds.",
            "level7": "Deals 631 physical damage to all enemies within 3 meters and binds them for 9 seconds.",
            "level8": "Deals 712 physical damage to all enemies within 3 meters and binds them for 10 seconds.",
            "level9": "Deals 800 physical damage to all enemies within 3 meters and binds them for 11 seconds.",
            "level10": "Deals 900 physical damage to all enemies within 3 meters and binds them for 12 seconds."
        }
    ],
    "Belladonna": [
        {
            "level1": "Poisons the target to deal damage equivalent to 100% of the recovery when cured. Lasts for 3 cure offects or 10 seconds.",
            "level2": "Poisons the target to deal damage equivalent to 110% of the recovery when cured. Lasts for 3 cure offects or 15 seconds.",
            "level3": "Poisons the target to deal damage equivalent to 120% of the recovery when cured. Lasts for 3 cure offects or 20 seconds.",
            "level4": "Poisons the target to deal damage equivalent to 130% of the recovery when cured. Lasts for 3 cure offects or 25 seconds.",
            "level5": "Poisons the target to deal damage equivalent to 140% of the recovery when cured. Lasts for 3 cure offects or 30 seconds.",
            "level6": "Poisons the target to deal damage equivalent to 150% of the recovery when cured. Lasts for 3 cure offects or 35 seconds.",
            "level7": "Poisons the target to deal damage equivalent to 160% of the recovery when cured. Lasts for 3 cure offects or 40 seconds.",
            "level8": "Poisons the target to deal damage equivalent to 170% of the recovery when cured. Lasts for 3 cure offects or 45 seconds.",
            "level9": "Poisons the target to deal damage equivalent to 180% of the recovery when cured. Lasts for 3 cure offects or 50 seconds.",
            "level10": "Poisons the target to deal damage equivalent to 200% of the recovery when cured. Lasts for 3 cure offects or 60 seconds."
        }
    ],
    "Reload": [
        {
            "level1": "Resets cooldown time of all skills and decreases all cooldown times by 25% for 30 seconds.",
            "level2": "Resets cooldown time of all skills and decreases all cooldown times by 30% for 40 seconds.",
            "level3": "Resets cooldown time of all skills and decreases all cooldown times by 35% for 50 seconds.",
            "level4": "Resets cooldown time of all skills and decreases all cooldown times by 40% for 60 seconds.",
            "level5": "Resets cooldown time of all skills and decreases all cooldown times by 45% for 70 seconds.",
            "level6": "Resets cooldown time of all skills and decreases all cooldown times by 50% for 80 seconds.",
            "level7": "Resets cooldown time of all skills and decreases all cooldown times by 55% for 90 seconds.",
            "level8": "Resets cooldown time of all skills and decreases all cooldown times by 57% for 100 seconds.",
            "level9": "Resets cooldown time of all skills and decreases all cooldown times by 59% for 110 seconds.",
            "level10": "Resets cooldown time of all skills and decreases all cooldown times by 60% for 120 seconds."
        }
    ],
    "Heartbreaker": [
        {
            "level1": "Inflcits 613 physical damage and weakens and enemy's heart for 10 seconds. Every Critical hit stuns an enemy for 1 second.",
            "level2": "Inflcits 723 physical damage and weakens and enemy's heart for 10 seconds. Every Critical hit stuns an enemy for 1 second.",
            "level3": "Inflcits 853 physical damage and weakens and enemy's heart for 10 seconds. Every Critical hit stuns an enemy for 1 second.",
            "level4": "Inflcits 990 physical damage and weakens and enemy's heart for 10 seconds. Every Critical hit stuns an enemy for 1 second.",
            "level5": "Inflcits 1148 physical damage and weakens and enemy's heart for 10 seconds. Every Critical hit stuns an enemy for 1 second.",
            "level6": "Inflcits 1313 physical damage and weakens and enemy's heart for 10 seconds. Every Critical hit stuns an enemy for 1 second.",
            "level7": "Inflcits 1483 physical damage and weakens and enemy's heart for 10 seconds. Every Critical hit stuns an enemy for 1 second.",
            "level8": "Inflcits 1668 physical damage and weakens and enemy's heart for 10 seconds. Every Critical hit stuns an enemy for 1 second.",
            "level9": "Inflcits 1875 physical damage and weakens and enemy's heart for 10 seconds. Every Critical hit stuns an enemy for 2 second.",
            "level10": "Inflcits 2095 physical damage and weakens and enemy's heart for 10 seconds. Every Critical hit stuns an enemy for 2 second.",
            "level11": "Inflcits 2328 physical damage and weakens and enemy's heart for 10 seconds. Every Critical hit stuns an enemy for 2 second.",
            "level12": "Inflcits 2585 physical damage and weakens and enemy's heart for 10 seconds. Every Critical hit stuns an enemy for 2 second.",
            "level13": "Inflcits 2873 physical damage and weakens and enemy's heart for 10 seconds. Every Critical hit stuns an enemy for 2 second.",
            "level14": "Inflcits 3163 physical damage and weakens and enemy's heart for 10 seconds. Every Critical hit stuns an enemy for 2 second.",
            "level15": "Inflcits 3480 physical damage and weakens and enemy's heart for 10 seconds. Every Critical hit stuns an enemy for 2 second.",
            "level16": "Inflcits 3833 physical damage and weakens and enemy's heart for 10 seconds. Every Critical hit stuns an enemy for 2 second."
        }
    ]
    ,"Nightshade": [
        {
            "level1": "Poisoned bullet deals 764 physical damage to the target and paralyzes them for 3 seconds.",
            "level2": "Poisoned bullet deals 884 physical damage to the target and paralyzes them for 3 seconds.",
            "level3": "Poisoned bullet deals 1012 physical damage to the target and paralyzes them for 3 seconds.",
            "level4": "Poisoned bullet deals 1152 physical damage to the target and paralyzes them for 3 seconds.",
            "level5": "Poisoned bullet deals 1296 physical damage to the target and paralyzes them for 3 seconds.",
            "level6": "Poisoned bullet deals 1456 physical damage to the target and paralyzes them for 3 seconds.",
            "level7": "Poisoned bullet deals 1632 physical damage to the target and paralyzes them for 3 seconds.",
            "level8": "Poisoned bullet deals 1814 physical damage to the target and paralyzes them for 3 seconds.",
            "level9": "Poisoned bullet deals 2016 physical damage to the target and paralyzes them for 3 seconds.",
            "level10": "Poisoned bullet deals 2240 physical damage to the target and paralyzes them for 3 seconds."
        }
    ]
    ,"Elude": [
        {
            "level1": "Increases resistance to snaring effects by 5% and immobilizing effects by 3%.",
            "level2": "Increases resistance to snaring effects by 10% and immobilizing effects by 6%.",
            "level3": "Increases resistance to snaring effects by 15% and immobilizing effects by 9%.",
            "level4": "Increases resistance to snaring effects by 20% and immobilizing effects by 12%.",
            "level5": "Increases resistance to snaring effects by 25% and immobilizing effects by 15%.",
            "level6": "Increases resistance to snaring effects by 30% and immobilizing effects by 18%.",
            "level7": "Increases resistance to snaring effects by 35% and immobilizing effects by 21%.",
            "level8": "Increases resistance to snaring effects by 40% and immobilizing effects by 24%.",
            "level9": "Increases resistance to snaring effects by 45% and immobilizing effects by 27%.",
            "level10": "Increases resistance to snaring effects by 50% and immobilizing effects by 30%."
        }
    ],
    "Bloody Rose": [
        {
            "level1": "Cast while in Hot Shot(Above Level 1), for 20 seconds, Normal attack deal splash damage equivalent to 20% of Physical ATK, double ATK is increased by 20, and the skill user absorbs 20% of damage on enemies as HP.",
            "level2": "Cast while in Hot Shot(Above Level 1), for 22 seconds, Normal attack deal splash damage equivalent to 25% of Physical ATK, double ATK is increased by 22, and the skill user absorbs 25% of damage on enemies as HP.",
            "level3": "Cast while in Hot Shot(Above Level 1), for 24 seconds, Normal attack deal splash damage equivalent to 30% of Physical ATK, double ATK is increased by 24, and the skill user absorbs 30% of damage on enemies as HP.",
            "level4": "Cast while in Hot Shot(Above Level 1), for 26 seconds, Normal attack deal splash damage equivalent to 35% of Physical ATK, double ATK is increased by 26, and the skill user absorbs 35% of damage on enemies as HP.",
            "level5": "Cast while in Hot Shot(Above Level 1), for 28 seconds, Normal attack deal splash damage equivalent to 40% of Physical ATK, double ATK is increased by 28, and the skill user absorbs 40% of damage on enemies as HP.",
            "level6": "Cast while in Hot Shot(Above Level 1), for 30 seconds, Normal attack deal splash damage equivalent to 45% of Physical ATK, double ATK is increased by 30, and the skill user absorbs 45% of damage on enemies as HP.",
            "level7": "Cast while in Hot Shot(Above Level 1), for 32 seconds, Normal attack deal splash damage equivalent to 50% of Physical ATK, double ATK is increased by 32, and the skill user absorbs 50% of damage on enemies as HP.",
            "level8": "Cast while in Hot Shot(Above Level 1), for 34 seconds, Normal attack deal splash damage equivalent to 55% of Physical ATK, double ATK is increased by 34, and the skill user absorbs 55% of damage on enemies as HP.",
            "level9": "Cast while in Hot Shot(Above Level 1), for 36 seconds, Normal attack deal splash damage equivalent to 60% of Physical ATK, double ATK is increased by 36, and the skill user absorbs 60% of damage on enemies as HP.",
            "level10": "Cast while in Hot Shot(Above Level 1), for 40 seconds, Normal attack deal splash damage equivalent to 70% of Physical ATK, double ATK is increased by 38, and the skill user absorbs 70% of damage on enemies as HP.",
            "level11": "Cast while in Hot Shot(Above Level 1), for 40 seconds, Normal attack deal splash damage equivalent to 70% of Physical ATK, double ATK is increased by 40, and the skill user absorbs 70% of damage on enemies as HP."
        }
    ],
    "Exploit Weakness": [
        {
            "leve1": "Deals 1086 physical damage. 150% damage dealt if the target is stunned.",
            "leve2": "Deals 1222 physical damage. 152% damage dealt if the target is stunned.",
            "leve3": "Deals 1376 physical damage. 154% damage dealt if the target is stunned.",
            "leve4": "Deals 1544 physical damage. 156% damage dealt if the target is stunned.",
            "leve5": "Deals 1722 physical damage. 158% damage dealt if the target is stunned.",
            "leve6": "Deals 1912 physical damage. 160% damage dealt if the target is stunned.",
            "leve7": "Deals 2122 physical damage. 162% damage dealt if the target is stunned.",
            "leve8": "Deals 2358 physical damage. 164% damage dealt if the target is stunned.",
            "leve9": "Deals 2618 physical damage. 166% damage dealt if the target is stunned.",
            "leve10": "Deals 2910 physical damage. 168% damage dealt if the target is stunned.",
            "leve11": "Deals 3066 physical damage. 170% damage dealt if the target is stunned."
        }
    ],
    "Misdirection": [
        {
            "level1": "Decreases threat generated by all attacks and actions and Mana cost of single target skills by 10%. Also, reduces damage from enemies under [Cover Fire] debuff by 75%.",
            "level2": "Decreases threat generated by all attacks and actions and Mana cost of single target skills by 12%. Also, reduces damage from enemies under [Cover Fire] debuff by 75%.",
            "level3": "Decreases threat generated by all attacks and actions and Mana cost of single target skills by 14%. Also, reduces damage from enemies under [Cover Fire] debuff by 75%.",
            "level4": "Decreases threat generated by all attacks and actions and Mana cost of single target skills by 16%. Also, reduces damage from enemies under [Cover Fire] debuff by 75%.",
            "level5": "Decreases threat generated by all attacks and actions and Mana cost of single target skills by 18%. Also, reduces damage from enemies under [Cover Fire] debuff by 75%.",
            "level6": "Decreases threat generated by all attacks and actions and Mana cost of single target skills by 20%. Also, reduces damage from enemies under [Cover Fire] debuff by 75%.",
            "level7": "Decreases threat generated by all attacks and actions and Mana cost of single target skills by 22%. Also, reduces damage from enemies under [Cover Fire] debuff by 75%.",
            "level8": "Decreases threat generated by all attacks and actions and Mana cost of single target skills by 24%. Also, reduces damage from enemies under [Cover Fire] debuff by 75%.",
            "level9": "Decreases threat generated by all attacks and actions and Mana cost of single target skills by 26%. Also, reduces damage from enemies under [Cover Fire] debuff by 75%.",
            "level10": "Decreases threat generated by all attacks and actions and Mana cost of single target skills by 28%. Also, reduces damage from enemies under [Cover Fire] debuff by 75%."
        }
    ],
    "Lead Rain": [
        {
            "level1": "Deals 2473 physical damage to all enemies within 4 meters of the target.",
            "level2": "Deals 2779 physical damage to all enemies within 4 meters of the target.",
            "level3": "Deals 3100 physical damage to all enemies within 4 meters of the target.",
            "level4": "Deals 3442 physical damage to all enemies within 4 meters of the target.",
            "level5": "Deals 3820 physical damage to all enemies within 4 meters of the target.",
            "level6": "Deals 4244 physical damage to all enemies within 4 meters of the target.",
            "level7": "Deals 4712 physical damage to all enemies within 4 meters of the target.",
            "level8": "Deals 5238 physical damage to all enemies within 4 meters of the target.",
            "level9": "Deals 5519 physical damage to all enemies within 4 meters of the target."
        }
    ],
    "Death Mark": [
        {
            "level1": "Deals 1274 Physical Attack and engraves mark of assasin that all those who attack the target with the mark recovers 202 HP each hit for 10 seconds.",
            "level2": "Deals 1428 Physical Attack and engraves mark of assasin that all those who attack the target with the mark recovers 225 HP each hit for 10 seconds.",
            "level3": "Deals 1587 Physical Attack and engraves mark of assasin that all those who attack the target with the mark recovers 247 HP each hit for 10 seconds.",
            "level4": "Deals 1764 Physical Attack and engraves mark of assasin that all those who attack the target with the mark recovers 271 HP each hit for 10 seconds.",
            "level5": "Deals 1960 Physical Attack and engraves mark of assasin that all those who attack the target with the mark recovers 298 HP each hit for 10 seconds.",
            "level6": "Deals 2175 Physical Attack and engraves mark of assasin that all those who attack the target with the mark recovers 328 HP each hit for 10 seconds.",
            "level7": "Deals 2415 Physical Attack and engraves mark of assasin that all those who attack the target with the mark recovers 360 HP each hit for 10 seconds.",
            "level8": "Deals 2683 Physical Attack and engraves mark of assasin that all those who attack the target with the mark recovers 396 HP each hit for 10 seconds."
        }
    ],
    "Assassinate": [
        {
            "level1": "Deals 1836 Physical Attack and additional damage, max of 2814, proportinal to HP decrease of the target.",
            "level2": "Deals 2041 Physical Attack and additional damage, max of 3092, proportinal to HP decrease of the target.",
            "level3": "Deals 2268 Physical Attack and additional damage, max of 3396, proportinal to HP decrease of the target.",
            "level4": "Deals 2520 Physical Attack and additional damage, max of 3734, proportinal to HP decrease of the target.",
            "level5": "Deals 2797 Physical Attack and additional damage, max of 4100, proportinal to HP decrease of the target.",
            "level6": "Deals 3105 Physical Attack and additional damage, max of 4502, proportinal to HP decrease of the target.",
            "level7": "Deals 3449 Physical Attack and additional damage, max of 4944, proportinal to HP decrease of the target."
        }
    ],
    "Chain Reaction": [
        {
            "level1": "Deals 2268 Physical Attack and additional 330 damage for each harmful buffs. Enters into chain movement mode.",
            "level2": "Deals 2520 Physical Attack and additional 366 damage for each harmful buffs. Enters into chain movement mode.",
            "level3": "Deals 2800 Physical Attack and additional 407 damage for each harmful buffs. Enters into chain movement mode.",
            "level4": "Deals 3108 Physical Attack and additional 454 damage for each harmful buffs. Enters into chain movement mode.",
            "level5": "Deals 3450 Physical Attack and additional 504 damage for each harmful buffs. Enters into chain movement mode.",
            "level6": "Deals 3833 Physical Attack and additional 560 damage for each harmful buffs. Enters into chain movement mode."
        }
    ],
    "Cover Fire": [
        {
            "level1": "Deals 2629 physical damage to enemies with 4m radius. If you spent at least one skill point on skill [Misdirection], damage received decrease by 75% for 10 seconds.",
            "level2": "Deals 2918 physical damage to enemies with 4m radius. If you spent at least one skill point on skill [Misdirection], damage received decrease by 75% for 12 seconds.",
            "level3": "Deals 3424 physical damage to enemies with 4m radius. If you spent at least one skill point on skill [Misdirection], damage received decrease by 75% for 14 seconds.",
            "level4": "Deals 3600 physical damage to enemies with 4m radius. If you spent at least one skill point on skill [Misdirection], damage received decrease by 75% for 16 seconds.",
            "level5": "Deals 4001 physical damage to enemies with 4m radius. If you spent at least one skill point on skill [Misdirection], damage received decrease by 75% for 18 seconds.",
            "level6": "Deals 4216 physical damage to enemies with 4m radius. If you spent at least one skill point on skill [Misdirection], damage received decrease by 75% for 20 seconds."
        }
    ],
    "Breakthrough": [
        {
            "level1": "Maximizes the capacity of dual pistols, increases physical damage by 40% for 8 seconds. However, durability decreases rate will increase by 20%",
            "level2": "Maximizes the capacity of dual pistols, increases physical damage by 45% for 8 seconds. However, durability decreases rate will increase by 25%",
            "level3": "Maximizes the capacity of dual pistols, increases physical damage by 50% for 8 seconds. However, durability decreases rate will increase by 30%",
            "level4": "Maximizes the capacity of dual pistols, increases physical damage by 55% for 8 seconds. However, durability decreases rate will increase by 35%",
            "level5": "Maximizes the capacity of dual pistols, increases physical damage by 60% for 8 seconds. However, durability decreases rate will increase by 40%"
        }
    ],
    "Gunblaze Festival": [
        {
            "level1": "Shoot wildly to deal 3867 damage to nearby enemies and instill Fear 3 sec. The skill user then hides within the smokescreen.",
            "level2": "Shoot wildly to deal 4294 damage to nearby enemies and instill Fear 3 sec. The skill user then hides within the smokescreen.",
            "level3": "Shoot wildly to deal 4772 damage to nearby enemies and instill Fear 3 sec. The skill user then hides within the smokescreen.",
            "level4": "Shoot wildly to deal 5028 damage to nearby enemies and instill Fear 3 sec. The skill user then hides within the smokescreen."
        }
    ],
    "Wicked Timer": [
        {
            "level1": "Inflicts 2760 physical damage, adds 447 extra damage per one buff effect of a target, and plants a bomb on the target. The bomb hinders the target from attacking and using skills and after 5 seconds, it adds 2070 damage upon exploding.",
            "level2": "Inflicts 3066 physical damage, adds 496 extra damage per one buff effect of a target, and plants a bomb on the target. The bomb hinders the target from attacking and using skills and after 5 seconds, it adds 2300 damage upon exploding."
        } 
    ]
}